{
  "userId": 3379436,
  "authorName": "C. Paige Gabhart",
  "from": "&quot;C. Paige Gabhart&quot; &lt;pgabhart@...&gt;",
  "profile": "pgabhart",
  "replyTo": "LIST",
  "senderId": "D6wzV9YwkGFsuOEJI65NPbdK_Ah5yhOjSOclzh9yXpenCkaw4lYnePDP8kQJp76j0JkIMsWe1GzpauSj5IQh0OAqB5DLVZYaMQjG1JuAbsWZ",
  "spamInfo": {
    "isSpam": false,
    "reason": "0"
  },
  "subject": "Re: [Read_Alphabet] Remapping Jerome",
  "postDate": "1016767933",
  "msgId": 126,
  "canDelete": false,
  "contentTrasformed": false,
  "systemMessage": false,
  "headers": {
    "messageIdInHeader": "PDNDOUFBNUJDLkY5MzRBQzRDQGNvcmVjb21tLm5ldD4=",
    "referencesHeader": "PDNDODZGN0U5LjUzNTJBMTRGQGNvcmVjb21tLm5ldD4gPDAwNjkwMWMxYzcwMCRlYmQwNTEzMCRjYzMzNzg0MUB3aW54cD4gPDNDOTNBNUYzLjUxNDZDNjU4QGNvcmVjb21tLm5ldD4gPDAwMzYwMWMxY2UwYSQxMDRmMWVhMCQ0ZjM0Nzg0MUB3aW54cD4="
  },
  "prevInTopic": 125,
  "nextInTopic": 127,
  "prevInTime": 125,
  "nextInTime": 127,
  "topicId": 104,
  "numMessagesInTopic": 15,
  "msgSnippet": "Jon: In the last few days, I ve been trying to learn a little something about fonts and keyboard mapping.  I would be interested in having some information",
  "messageBody": "<div id=\"ygrps-yiv-540261460\">\n<html>\n \nJon:\n<p>In the last few days, I&#39;ve been trying to learn a little something about\nfonts and keyboard mapping.&nbsp; I would be interested in having some\ninformation regarding the program you used to develop Jerome?&nbsp; What\nis it?&nbsp; Where is it available?&nbsp; What does it cost?&nbsp; And\ndoes that same program also set up the keyboard mapping?&nbsp; If you can\nbriefly shed any light on this, I would appreciate it.&nbsp; Thanks.\n<p>Paige\n<p>Jon Zuck wrote:\n<blockquote><span title=\"qreply\"> <blockquote TYPE=\"CITE\"><style></style>\n<font face=\"Arial\"><font size=\"-1\">Great\nissues Paige, Thanks for your feedback.&nbsp; Unfortunately, I don&#39;t have\nthe time to think about these matters in depth right now.&nbsp; I&#39;ll have\nto look into it another time, unfortunately I don&#39;t know when, but I haven&#39;t\nforgotten.</font></font>&nbsp;<font face=\"Arial\"><font size=\"-1\">Thanks,</font></font>&nbsp;Shalom\nv&#39;Tovah,.&nbsp;Jon\n<br><a rel=\"nofollow\" target=\"_blank\" href=\"http://surf.to/frimmin\">http://surf.to/frimmin</a>&nbsp;It\nis more necessary to love much than to think much;\n<br>always do that which impels you most to love.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n--St. Teresa of Avila, The Interior Castle\n<blockquote dir=\"ltr\"\n style=\"PADDING-RIGHT:0px;PADDING-LEFT:5px;MARGIN-LEFT:5px;BORDER-LEFT:#000000 2px solid;MARGIN-RIGHT:0px;\">\n<div style=\"FONT:10pt arial;\">----- Original Message -----</div>\n\n<div\n style=\"BACKGROUND:#e4e4e4;FONT:10pt arial;\"><b>From:</b>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pgabhart@...\" title=\"pgabhart@...\">C.\nPaige Gabhart</a></div>\n\n<div style=\"FONT:10pt arial;\"><b>To:</b> <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Read_Alphabet@yahoogroups.com\" title=\"Read_Alphabet@yahoogroups.com\">Read_Alphabet@yahoogroups.com</a>\n; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:frimmin@...\" title=\"frimmin@...\">frimmin@...</a></div>\n\n<div style=\"FONT:10pt arial;\"><b>Sent:</b> Saturday, March 16, 2002 3:07\nPM</div>\n\n<div style=\"FONT:10pt arial;\"><b>Subject:</b> Re: [Read_Alphabet] Remapping\nJerome</div>\n&nbsp;Jon:\n<p>I had almost completed my response to your attached post when the computer\nlocked up, and I found once again I had neglected to save the file!&nbsp;\nIf Chevrolets or Fords were this undependable who would buy them?&nbsp;\nI have been reviewing your remapping proposal and have made some comments\nbelow.&nbsp; Let me say that I think it is great and on the right track\nbut still needs a little tweaking.\n<p>Jon Zuck wrote:\n<blockquote TYPE=\"CITE\"><tt>It appears to me that you intend to the DFJK\nkeys to act like the shift key,</tt>\n<br><tt>to be depressed and held down while the vowel key on the opposite\nhand is</tt>\n<br><tt>struck.&nbsp; It certainly would make more sense to have a &quot;SHIFTy&quot;\nfunction</tt>\n<br><tt>performed by index fingers instead of the poor little pinky, so\nthat is</tt>\n<br><tt>definitely a noble idea.&nbsp; Unfortunately, &lt;sigh&gt; it won&#39;t\nwork. [snip]</tt></blockquote>\nI had reached that conclusion by the time I sent the post that it wouldn&#39;t\nwork for the reason you discussed.&nbsp; But your solution of using a key\n(&quot;j&quot;) as a &quot;flag&quot; to alter the output of the regular key will work just\nas well as what I had proposed.&nbsp; I toyed around with the idea of using\n&quot;f&quot; as a flag for letters typed with the right hand, but &quot;f&quot; can combine\nwith too many other letters to form regular words so I believe your choice\nof &quot;j&quot; as the single flag for the half-letters and alternate &quot;n&quot; and &quot;x&quot;\nmakes more sense.&nbsp; The two letter combinations for namer dot should\nwork fine in my opinion.\n<p>I agree that the use of the half-letters should be left to the discretion\nof the writer and not automatically inserted by the driver.&nbsp; However,\nI do not agree with you that the half-letters should be relegated to&nbsp;\nword art or special effects on the computer.&nbsp; The half-letters make\nquite distinctive word outlines that appeal to me greatly.&nbsp; After\nmuch use of QS, I feel confident in saying that they are no harder to read\nand are automatically interpreted by the eye and brain in an appropriate\nfashion.&nbsp; In fact, they might even be easier to read quickly since\nI believe automatic word recognition, i.e. without having to break the\nword down into its constituent letters for deciphering, is facilitated\nby unique word-shapes.&nbsp; In any event, I feel a person who wishes to\nuse half-letters in his computer writing should be free to do so if he\nchooses.&nbsp; If other people are put off by this or find it harder to\nread, the writer will find it out by their comments to him.\n<p>Your approach to the traditionally-written digraph letters will be quite\neasy to learn.&nbsp; By the way, when I printed your proposed remapping\nout, in place of Quikscript tall and deep &quot;x,&quot; I got the letter &quot;e.&quot;&nbsp;\nOne with an accent aigu and one with accent grave.&nbsp; Any idea why this\noccurred?&nbsp; (As I told you previously, I have not used &quot;x&quot;&nbsp; in\nwriting in Jerome as I felt their inclusion in the alphabet somewhat incongruous\nwith Quikscript&#39;s rationale so I had not had this occur previously in my\nwriting.)\n<p>Here is a problem I have noticed:&nbsp; If we type &quot;th&quot;, for example,\nin the word &quot;hothouse,&quot; how does the driver know this should not be a &quot;thoth&quot;\nbut two separate letters?&nbsp; Admittedly, I doubt this would be a common\noccurrence, but we should have a way to deal with it.&nbsp; There are probably\nother English words that would cause similar problems that we are not aware\nof yet.\n<p>Could we somehow tell the driver to ignore the apparently flagged character\nwhen it was inappropriately triggered?&nbsp; Could there be an &quot;undo&quot; key\nthat, if input immediately after the inappropriate flagged character, signals\nthe driver to correct the two preceding keystrokes to their normal outputs\nrather than interpreting them as a flagged character?&nbsp; Perhaps the\n&quot;&lt;&quot; character could be used, suggesting by its shape that the flagged\ncharacter should be opened back up to the two separate characters that\nwere input.\n<p>As I had proposed before, mapping the half-letters as flagged characters\non the same primary keys, i.e. half-tot on the &quot;t&quot; key and mapping &quot;Whitewheat&quot;\nto &quot;q&quot; seems felicitous to me as it is logical and will foster quick learning\nof the mapping.\n<p>You commented in&nbsp; your post of 24 Feb.,&nbsp; that you love the\nligature letters.&nbsp; I also find them very attractive.&nbsp; Rather\nthan discarding them out of hand as you proposed due to the apparent scarcity\nof available spots on the keyboard,&nbsp; I would suggest the following:&nbsp;\nmap the ligatures to the number keys at the top of the keyboard and trigger\ntheir output with the &quot;j&quot; flag.&nbsp; In this manner the numbers and their\nnormal shift characters would still work, people who do not want to use\nthe ligatures could ignore them, and those of us who revel in their curvaceous\nappearance can enjoy them in our writing.&nbsp;&nbsp; This sounds like\na win-win solution to me!&nbsp; I would map them to numbers 3 - 9 as this\navoids the use of the left hand little finger, which is weaker and shorter.&nbsp;\nTo extend this one last step:&nbsp; the two Gaelic letters could be mapped\nto &quot;1&quot; and &quot;0,&quot; where they would bother no one, but would be available\nfor Scottish writers.&nbsp; Since the use of these letters would be minimal,\nhaving to access them with right and left little fingers should not be\ntoo much of a strain.\n<p>Another difficulty I see with your proposal is&nbsp; in connection with\nthe vowels not mapped to a single key.&nbsp; I agree with the suggestion\nthat they be mapped with a flag that apes the typical spelling in traditional\northography as this would simplify learning the mapping.&nbsp; However,\nwe probably need a test period to see how well the proposed letter combinations\nwill work in actuality.\n<p>The driver will interpret the first letter typed as a standard QS letter\nuntil the &quot;flag&quot; letter is typed so we have to insure that our flag does\nnot duplicate a pattern that normally occurs in English.&nbsp; As an example,\nyou proposed\n<br>the combination &quot;ah&quot; for the character &quot;Ah.&nbsp; But what if you are\ntrying to type the word &quot;ahead.&quot;&nbsp; You need a schwa followed by an\n&quot;h,&quot; but the driver will interpret this as an &quot;Ah.&quot;&nbsp; Again, the idea\nof an &quot;undo&quot; character as I suggested above would&nbsp; solve this (if\nthat is technically feasible), or we need to map another letter combination\nfor &quot;Ah.&quot;&nbsp; I have not given much thought to the other proposed letter\ncombinations for these vowels, but I would not be surprised if they also\ncould give rise to unexpected results.\n<p>Let me know your thoughts on this.\n<p>Thanks for your work, Jon.\n<p>Sincerely,\n<br>&nbsp;\n<p>Paige\n<br>&nbsp;\n<br>&nbsp;\n<br>&nbsp;\n<br>&nbsp;\n<br>&nbsp;\n<blockquote TYPE=\"CITE\">&nbsp;\n<p><tt>To unsubscribe from this group, send an email to:</tt>\n<br><tt>Read_Alphabet-unsubscribe@egroups.com</tt>\n<br>&nbsp;\n<br>&nbsp;\n<p><tt>Your use of Yahoo! Groups is subject to the <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">Yahoo!\nTerms of Service</a>.</tt></p></blockquote>\n</blockquote>\n\n<p><br>\n<br><tt>To unsubscribe from this group, send an email to:</tt>\n<br><tt>Read_Alphabet-unsubscribe@egroups.com</tt>\n<br>&nbsp;\n<br>&nbsp;\n<p><tt>Your use of Yahoo! Groups is subject to the <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">Yahoo!\nTerms of Service</a>.</tt></p></blockquote>\n\n \n</span></blockquote></html>\n</div>",
  "specialLinks": [],
  "rawEmail": "Return-Path: &lt;pgabhart@...&gt;\r\nX-Sender: pgabhart@...\r\nX-Apparently-To: Read_Alphabet@yahoogroups.com\r\nReceived: (EGP: unknown); 22 Mar 2002 03:20:49 -0000\r\nReceived: (qmail 64469 invoked from network); 22 Mar 2002 03:20:49 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m3.grp.scd.yahoo.com with QMQP; 22 Mar 2002 03:20:49 -0000\r\nReceived: from unknown (HELO mail3.mx.voyager.net) (216.93.66.202)\n  by mta3.grp.scd.yahoo.com with SMTP; 22 Mar 2002 03:20:48 -0000\r\nReceived: from corecomm.net (d1.as0.lsvl.ky.voyager.net [216.127.12.2])\n\tby mail3.mx.voyager.net (8.11.6/8.10.2) with ESMTP id g2M3KYu51513\n\tfor &lt;Read_Alphabet@yahoogroups.com&gt;; Thu, 21 Mar 2002 22:20:35 -0500 (EST)\r\nSender: pgabhart@...\r\nMessage-ID: &lt;3C9AA5BC.F934AC4C@...&gt;\r\nDate: Thu, 21 Mar 2002 22:32:13 -0500\r\nX-Mailer: Mozilla 4.75 [en] (X11; U; Linux 2.2.16-22 i586)\r\nX-Accept-Language: en\r\nMIME-Version: 1.0\r\nTo: Read_Alphabet@yahoogroups.com\r\nSubject: Re: [Read_Alphabet] Remapping Jerome\r\nReferences: &lt;3C86F7E9.5352A14F@...&gt; &lt;006901c1c700$ebd05130$cc337841@winxp&gt; &lt;3C93A5F3.5146C658@...&gt; &lt;003601c1ce0a$104f1ea0$4f347841@winxp&gt;\r\nContent-Type: multipart/alternative;\n boundary=&quot;------------356AD0DFBC3CF82697B2A1B8&quot;\r\nFrom: &quot;C. Paige Gabhart&quot; &lt;pgabhart@...&gt;\r\nX-Yahoo-Group-Post: member; u=3379436\r\nX-Yahoo-Profile: pgabhart\r\n\r\n\r\n--------------356AD0DFBC3CF82697B2A1B8\r\nContent-Type: text/plain; charset=us-ascii\r\nContent-Transfer-Encoding: 7bit\r\n\r\nJon:\n\nIn the last few days, I&#39;ve been trying to learn a little something about\nfonts and keyboard mapping.  I would be interested in having some\ninformation regarding the program you used to develop Jerome?  What is\nit?  Where is it available?  What does it cost?  And does that same\nprogram also set up the keyboard mapping?  If you can briefly shed any\nlight on this, I would appreciate it.  Thanks.\n\nPaige\n\nJon Zuck wrote:\n\n&gt; Great issues Paige, Thanks for your feedback.  Unfortunately, I don&#39;t\n&gt; have the time to think about these matters in depth right now.  I&#39;ll\n&gt; have to look into it another time, unfortunately I don&#39;t know when,\n&gt; but I haven&#39;t forgotten. Thanks, Shalom v&#39;Tovah,. Jon\n&gt; http://surf.to/frimmin It is more necessary to love much than to think\n&gt; much;\n&gt; always do that which impels you most to love.         --St. Teresa of\n&gt; Avila, The Interior Castle\n&gt;\n&gt;      ----- Original Message -----\n&gt;      From: C. Paige Gabhart\n&gt;      To: Read_Alphabet@yahoogroups.com ; frimmin@...\n&gt;      Sent: Saturday, March 16, 2002 3:07 PM\n&gt;      Subject: Re: [Read_Alphabet] Remapping Jerome\n&gt;       Jon:\n&gt;\n&gt;      I had almost completed my response to your attached post\n&gt;      when the computer locked up, and I found once again I had\n&gt;      neglected to save the file!  If Chevrolets or Fords were\n&gt;      this undependable who would buy them?  I have been reviewing\n&gt;      your remapping proposal and have made some comments below.\n&gt;      Let me say that I think it is great and on the right track\n&gt;      but still needs a little tweaking.\n&gt;\n&gt;      Jon Zuck wrote:\n&gt;\n&gt;     &gt; It appears to me that you intend to the DFJK keys to act\n&gt;     &gt; like the shift key,\n&gt;     &gt; to be depressed and held down while the vowel key on the\n&gt;     &gt; opposite hand is\n&gt;     &gt; struck.  It certainly would make more sense to have a\n&gt;     &gt; &quot;SHIFTy&quot; function\n&gt;     &gt; performed by index fingers instead of the poor little\n&gt;     &gt; pinky, so that is\n&gt;     &gt; definitely a noble idea.  Unfortunately, &lt;sigh&gt; it won&#39;t\n&gt;     &gt; work. [snip]\n&gt;\n&gt;      I had reached that conclusion by the time I sent the post\n&gt;      that it wouldn&#39;t work for the reason you discussed.  But\n&gt;      your solution of using a key (&quot;j&quot;) as a &quot;flag&quot; to alter the\n&gt;      output of the regular key will work just as well as what I\n&gt;      had proposed.  I toyed around with the idea of using &quot;f&quot; as\n&gt;      a flag for letters typed with the right hand, but &quot;f&quot; can\n&gt;      combine with too many other letters to form regular words so\n&gt;      I believe your choice of &quot;j&quot; as the single flag for the\n&gt;      half-letters and alternate &quot;n&quot; and &quot;x&quot; makes more sense.\n&gt;      The two letter combinations for namer dot should work fine\n&gt;      in my opinion.\n&gt;\n&gt;      I agree that the use of the half-letters should be left to\n&gt;      the discretion of the writer and not automatically inserted\n&gt;      by the driver.  However, I do not agree with you that the\n&gt;      half-letters should be relegated to  word art or special\n&gt;      effects on the computer.  The half-letters make quite\n&gt;      distinctive word outlines that appeal to me greatly.  After\n&gt;      much use of QS, I feel confident in saying that they are no\n&gt;      harder to read and are automatically interpreted by the eye\n&gt;      and brain in an appropriate fashion.  In fact, they might\n&gt;      even be easier to read quickly since I believe automatic\n&gt;      word recognition, i.e. without having to break the word down\n&gt;      into its constituent letters for deciphering, is facilitated\n&gt;      by unique word-shapes.  In any event, I feel a person who\n&gt;      wishes to use half-letters in his computer writing should be\n&gt;      free to do so if he chooses.  If other people are put off by\n&gt;      this or find it harder to read, the writer will find it out\n&gt;      by their comments to him.\n&gt;\n&gt;      Your approach to the traditionally-written digraph letters\n&gt;      will be quite easy to learn.  By the way, when I printed\n&gt;      your proposed remapping out, in place of Quikscript tall and\n&gt;      deep &quot;x,&quot; I got the letter &quot;e.&quot;  One with an accent aigu and\n&gt;      one with accent grave.  Any idea why this occurred?  (As I\n&gt;      told you previously, I have not used &quot;x&quot;  in writing in\n&gt;      Jerome as I felt their inclusion in the alphabet somewhat\n&gt;      incongruous with Quikscript&#39;s rationale so I had not had\n&gt;      this occur previously in my writing.)\n&gt;\n&gt;      Here is a problem I have noticed:  If we type &quot;th&quot;, for\n&gt;      example, in the word &quot;hothouse,&quot; how does the driver know\n&gt;      this should not be a &quot;thoth&quot; but two separate letters?\n&gt;      Admittedly, I doubt this would be a common occurrence, but\n&gt;      we should have a way to deal with it.  There are probably\n&gt;      other English words that would cause similar problems that\n&gt;      we are not aware of yet.\n&gt;\n&gt;      Could we somehow tell the driver to ignore the apparently\n&gt;      flagged character when it was inappropriately triggered?\n&gt;      Could there be an &quot;undo&quot; key that, if input immediately\n&gt;      after the inappropriate flagged character, signals the\n&gt;      driver to correct the two preceding keystrokes to their\n&gt;      normal outputs rather than interpreting them as a flagged\n&gt;      character?  Perhaps the &quot;&lt;&quot; character could be used,\n&gt;      suggesting by its shape that the flagged character should be\n&gt;      opened back up to the two separate characters that were\n&gt;      input.\n&gt;\n&gt;      As I had proposed before, mapping the half-letters as\n&gt;      flagged characters on the same primary keys, i.e. half-tot\n&gt;      on the &quot;t&quot; key and mapping &quot;Whitewheat&quot; to &quot;q&quot; seems\n&gt;      felicitous to me as it is logical and will foster quick\n&gt;      learning of the mapping.\n&gt;\n&gt;      You commented in  your post of 24 Feb.,  that you love the\n&gt;      ligature letters.  I also find them very attractive.  Rather\n&gt;      than discarding them out of hand as you proposed due to the\n&gt;      apparent scarcity of available spots on the keyboard,  I\n&gt;      would suggest the following:  map the ligatures to the\n&gt;      number keys at the top of the keyboard and trigger their\n&gt;      output with the &quot;j&quot; flag.  In this manner the numbers and\n&gt;      their normal shift characters would still work, people who\n&gt;      do not want to use the ligatures could ignore them, and\n&gt;      those of us who revel in their curvaceous appearance can\n&gt;      enjoy them in our writing.   This sounds like a win-win\n&gt;      solution to me!  I would map them to numbers 3 - 9 as this\n&gt;      avoids the use of the left hand little finger, which is\n&gt;      weaker and shorter.  To extend this one last step:  the two\n&gt;      Gaelic letters could be mapped to &quot;1&quot; and &quot;0,&quot; where they\n&gt;      would bother no one, but would be available for Scottish\n&gt;      writers.  Since the use of these letters would be minimal,\n&gt;      having to access them with right and left little fingers\n&gt;      should not be too much of a strain.\n&gt;\n&gt;      Another difficulty I see with your proposal is  in\n&gt;      connection with the vowels not mapped to a single key.  I\n&gt;      agree with the suggestion that they be mapped with a flag\n&gt;      that apes the typical spelling in traditional orthography as\n&gt;      this would simplify learning the mapping.  However, we\n&gt;      probably need a test period to see how well the proposed\n&gt;      letter combinations will work in actuality.\n&gt;\n&gt;      The driver will interpret the first letter typed as a\n&gt;      standard QS letter until the &quot;flag&quot; letter is typed so we\n&gt;      have to insure that our flag does not duplicate a pattern\n&gt;      that normally occurs in English.  As an example, you\n&gt;      proposed\n&gt;      the combination &quot;ah&quot; for the character &quot;Ah.  But what if you\n&gt;      are trying to type the word &quot;ahead.&quot;  You need a schwa\n&gt;      followed by an &quot;h,&quot; but the driver will interpret this as an\n&gt;      &quot;Ah.&quot;  Again, the idea of an &quot;undo&quot; character as I suggested\n&gt;      above would  solve this (if that is technically feasible),\n&gt;      or we need to map another letter combination for &quot;Ah.&quot;  I\n&gt;      have not given much thought to the other proposed letter\n&gt;      combinations for these vowels, but I would not be surprised\n&gt;      if they also could give rise to unexpected results.\n&gt;\n&gt;      Let me know your thoughts on this.\n&gt;\n&gt;      Thanks for your work, Jon.\n&gt;\n&gt;      Sincerely,\n&gt;\n&gt;\n&gt;      Paige\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;     &gt;\n&gt;     &gt;\n&gt;     &gt; To unsubscribe from this group, send an email to:\n&gt;     &gt; Read_Alphabet-unsubscribe@egroups.com\n&gt;     &gt;\n&gt;     &gt;\n&gt;     &gt;\n&gt;     &gt; Your use of Yahoo! Groups is subject to the Yahoo! Terms\n&gt;     &gt; of Service.\n&gt;\n&gt;\n&gt;                    Yahoo! Groups Sponsor\n                        ADVERTISEMENT\n\n\n&gt;\n&gt; To unsubscribe from this group, send an email to:\n&gt; Read_Alphabet-unsubscribe@egroups.com\n&gt;\n&gt;\n&gt;\n&gt; Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service.\n\r\n--------------356AD0DFBC3CF82697B2A1B8\r\nContent-Type: multipart/related;\n boundary=&quot;------------AF0B540EC7A27E50883116F7&quot;\r\n\r\n\r\n--------------AF0B540EC7A27E50883116F7\r\nContent-Type: text/html; charset=us-ascii\r\nContent-Transfer-Encoding: 7bit\r\n\r\n&lt;!doctype html public &quot;-//w3c//dtd html 4.0 transitional//en&quot;&gt;\n&lt;html&gt;\n&lt;body bgcolor=&quot;#FFFFFF&quot;&gt;\nJon:\n&lt;p&gt;In the last few days, I&#39;ve been trying to learn a little something about\nfonts and keyboard mapping.&nbsp; I would be interested in having some\ninformation regarding the program you used to develop Jerome?&nbsp; What\nis it?&nbsp; Where is it available?&nbsp; What does it cost?&nbsp; And\ndoes that same program also set up the keyboard mapping?&nbsp; If you can\nbriefly shed any light on this, I would appreciate it.&nbsp; Thanks.\n&lt;p&gt;Paige\n&lt;p&gt;Jon Zuck wrote:\n&lt;blockquote TYPE=CITE&gt;&lt;style&gt;&lt;/style&gt;\n&lt;font face=&quot;Arial&quot;&gt;&lt;font size=-1&gt;Great\nissues Paige, Thanks for your feedback.&nbsp; Unfortunately, I don&#39;t have\nthe time to think about these matters in depth right now.&nbsp; I&#39;ll have\nto look into it another time, unfortunately I don&#39;t know when, but I haven&#39;t\nforgotten.&lt;/font&gt;&lt;/font&gt;&nbsp;&lt;font face=&quot;Arial&quot;&gt;&lt;font size=-1&gt;Thanks,&lt;/font&gt;&lt;/font&gt;&nbsp;Shalom\nv&#39;Tovah,.&nbsp;Jon\n&lt;br&gt;&lt;a href=&quot;http://surf.to/frimmin&quot;&gt;http://surf.to/frimmin&lt;/a&gt;&nbsp;It\nis more necessary to love much than to think much;\n&lt;br&gt;always do that which impels you most to love.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n--St. Teresa of Avila, The Interior Castle\n&lt;blockquote dir=ltr \nstyle=&quot;PADDING-RIGHT: 0px; PADDING-LEFT: 5px; MARGIN-LEFT: 5px; BORDER-LEFT: #000000 2px solid; MARGIN-RIGHT: 0px&quot;&gt;\n&lt;div style=&quot;FONT: 10pt arial&quot;&gt;----- Original Message -----&lt;/div&gt;\n\n&lt;div \n  style=&quot;BACKGROUND: #e4e4e4; FONT: 10pt arial; font-color: black&quot;&gt;&lt;b&gt;From:&lt;/b&gt;\n&lt;a href=&quot;mailto:pgabhart@...&quot; title=&quot;pgabhart@...&quot;&gt;C.\nPaige Gabhart&lt;/a&gt;&lt;/div&gt;\n\n&lt;div style=&quot;FONT: 10pt arial&quot;&gt;&lt;b&gt;To:&lt;/b&gt; &lt;a href=&quot;mailto:Read_Alphabet@yahoogroups.com&quot; title=&quot;Read_Alphabet@yahoogroups.com&quot;&gt;Read_Alphabet@yahoogroups.com&lt;/a&gt;\n; &lt;a href=&quot;mailto:frimmin@...&quot; title=&quot;frimmin@...&quot;&gt;frimmin@...&lt;/a&gt;&lt;/div&gt;\n\n&lt;div style=&quot;FONT: 10pt arial&quot;&gt;&lt;b&gt;Sent:&lt;/b&gt; Saturday, March 16, 2002 3:07\nPM&lt;/div&gt;\n\n&lt;div style=&quot;FONT: 10pt arial&quot;&gt;&lt;b&gt;Subject:&lt;/b&gt; Re: [Read_Alphabet] Remapping\nJerome&lt;/div&gt;\n&nbsp;Jon:\n&lt;p&gt;I had almost completed my response to your attached post when the computer\nlocked up, and I found once again I had neglected to save the file!&nbsp;\nIf Chevrolets or Fords were this undependable who would buy them?&nbsp;\nI have been reviewing your remapping proposal and have made some comments\nbelow.&nbsp; Let me say that I think it is great and on the right track\nbut still needs a little tweaking.\n&lt;p&gt;Jon Zuck wrote:\n&lt;blockquote TYPE=&quot;CITE&quot;&gt;&lt;tt&gt;It appears to me that you intend to the DFJK\nkeys to act like the shift key,&lt;/tt&gt;\n&lt;br&gt;&lt;tt&gt;to be depressed and held down while the vowel key on the opposite\nhand is&lt;/tt&gt;\n&lt;br&gt;&lt;tt&gt;struck.&nbsp; It certainly would make more sense to have a &quot;SHIFTy&quot;\nfunction&lt;/tt&gt;\n&lt;br&gt;&lt;tt&gt;performed by index fingers instead of the poor little pinky, so\nthat is&lt;/tt&gt;\n&lt;br&gt;&lt;tt&gt;definitely a noble idea.&nbsp; Unfortunately, &lt;sigh&gt; it won&#39;t\nwork. [snip]&lt;/tt&gt;&lt;/blockquote&gt;\nI had reached that conclusion by the time I sent the post that it wouldn&#39;t\nwork for the reason you discussed.&nbsp; But your solution of using a key\n(&quot;j&quot;) as a &quot;flag&quot; to alter the output of the regular key will work just\nas well as what I had proposed.&nbsp; I toyed around with the idea of using\n&quot;f&quot; as a flag for letters typed with the right hand, but &quot;f&quot; can combine\nwith too many other letters to form regular words so I believe your choice\nof &quot;j&quot; as the single flag for the half-letters and alternate &quot;n&quot; and &quot;x&quot;\nmakes more sense.&nbsp; The two letter combinations for namer dot should\nwork fine in my opinion.\n&lt;p&gt;I agree that the use of the half-letters should be left to the discretion\nof the writer and not automatically inserted by the driver.&nbsp; However,\nI do not agree with you that the half-letters should be relegated to&nbsp;\nword art or special effects on the computer.&nbsp; The half-letters make\nquite distinctive word outlines that appeal to me greatly.&nbsp; After\nmuch use of QS, I feel confident in saying that they are no harder to read\nand are automatically interpreted by the eye and brain in an appropriate\nfashion.&nbsp; In fact, they might even be easier to read quickly since\nI believe automatic word recognition, i.e. without having to break the\nword down into its constituent letters for deciphering, is facilitated\nby unique word-shapes.&nbsp; In any event, I feel a person who wishes to\nuse half-letters in his computer writing should be free to do so if he\nchooses.&nbsp; If other people are put off by this or find it harder to\nread, the writer will find it out by their comments to him.\n&lt;p&gt;Your approach to the traditionally-written digraph letters will be quite\neasy to learn.&nbsp; By the way, when I printed your proposed remapping\nout, in place of Quikscript tall and deep &quot;x,&quot; I got the letter &quot;e.&quot;&nbsp;\nOne with an accent aigu and one with accent grave.&nbsp; Any idea why this\noccurred?&nbsp; (As I told you previously, I have not used &quot;x&quot;&nbsp; in\nwriting in Jerome as I felt their inclusion in the alphabet somewhat incongruous\nwith Quikscript&#39;s rationale so I had not had this occur previously in my\nwriting.)\n&lt;p&gt;Here is a problem I have noticed:&nbsp; If we type &quot;th&quot;, for example,\nin the word &quot;hothouse,&quot; how does the driver know this should not be a &quot;thoth&quot;\nbut two separate letters?&nbsp; Admittedly, I doubt this would be a common\noccurrence, but we should have a way to deal with it.&nbsp; There are probably\nother English words that would cause similar problems that we are not aware\nof yet.\n&lt;p&gt;Could we somehow tell the driver to ignore the apparently flagged character\nwhen it was inappropriately triggered?&nbsp; Could there be an &quot;undo&quot; key\nthat, if input immediately after the inappropriate flagged character, signals\nthe driver to correct the two preceding keystrokes to their normal outputs\nrather than interpreting them as a flagged character?&nbsp; Perhaps the\n&quot;&lt;&quot; character could be used, suggesting by its shape that the flagged\ncharacter should be opened back up to the two separate characters that\nwere input.\n&lt;p&gt;As I had proposed before, mapping the half-letters as flagged characters\non the same primary keys, i.e. half-tot on the &quot;t&quot; key and mapping &quot;Whitewheat&quot;\nto &quot;q&quot; seems felicitous to me as it is logical and will foster quick learning\nof the mapping.\n&lt;p&gt;You commented in&nbsp; your post of 24 Feb.,&nbsp; that you love the\nligature letters.&nbsp; I also find them very attractive.&nbsp; Rather\nthan discarding them out of hand as you proposed due to the apparent scarcity\nof available spots on the keyboard,&nbsp; I would suggest the following:&nbsp;\nmap the ligatures to the number keys at the top of the keyboard and trigger\ntheir output with the &quot;j&quot; flag.&nbsp; In this manner the numbers and their\nnormal shift characters would still work, people who do not want to use\nthe ligatures could ignore them, and those of us who revel in their curvaceous\nappearance can enjoy them in our writing.&nbsp;&nbsp; This sounds like\na win-win solution to me!&nbsp; I would map them to numbers 3 - 9 as this\navoids the use of the left hand little finger, which is weaker and shorter.&nbsp;\nTo extend this one last step:&nbsp; the two Gaelic letters could be mapped\nto &quot;1&quot; and &quot;0,&quot; where they would bother no one, but would be available\nfor Scottish writers.&nbsp; Since the use of these letters would be minimal,\nhaving to access them with right and left little fingers should not be\ntoo much of a strain.\n&lt;p&gt;Another difficulty I see with your proposal is&nbsp; in connection with\nthe vowels not mapped to a single key.&nbsp; I agree with the suggestion\nthat they be mapped with a flag that apes the typical spelling in traditional\northography as this would simplify learning the mapping.&nbsp; However,\nwe probably need a test period to see how well the proposed letter combinations\nwill work in actuality.\n&lt;p&gt;The driver will interpret the first letter typed as a standard QS letter\nuntil the &quot;flag&quot; letter is typed so we have to insure that our flag does\nnot duplicate a pattern that normally occurs in English.&nbsp; As an example,\nyou proposed\n&lt;br&gt;the combination &quot;ah&quot; for the character &quot;Ah.&nbsp; But what if you are\ntrying to type the word &quot;ahead.&quot;&nbsp; You need a schwa followed by an\n&quot;h,&quot; but the driver will interpret this as an &quot;Ah.&quot;&nbsp; Again, the idea\nof an &quot;undo&quot; character as I suggested above would&nbsp; solve this (if\nthat is technically feasible), or we need to map another letter combination\nfor &quot;Ah.&quot;&nbsp; I have not given much thought to the other proposed letter\ncombinations for these vowels, but I would not be surprised if they also\ncould give rise to unexpected results.\n&lt;p&gt;Let me know your thoughts on this.\n&lt;p&gt;Thanks for your work, Jon.\n&lt;p&gt;Sincerely,\n&lt;br&gt;&nbsp;\n&lt;p&gt;Paige\n&lt;br&gt;&nbsp;\n&lt;br&gt;&nbsp;\n&lt;br&gt;&nbsp;\n&lt;br&gt;&nbsp;\n&lt;br&gt;&nbsp;\n&lt;blockquote TYPE=&quot;CITE&quot;&gt;&nbsp;\n&lt;p&gt;&lt;tt&gt;To unsubscribe from this group, send an email to:&lt;/tt&gt;\n&lt;br&gt;&lt;tt&gt;Read_Alphabet-unsubscribe@egroups.com&lt;/tt&gt;\n&lt;br&gt;&nbsp;\n&lt;br&gt;&nbsp;\n&lt;p&gt;&lt;tt&gt;Your use of Yahoo! Groups is subject to the &lt;a href=&quot;http://docs.yahoo.com/info/terms/&quot;&gt;Yahoo!\nTerms of Service&lt;/a&gt;.&lt;/tt&gt;&lt;/blockquote&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&lt;br&gt;\n&lt;br&gt;&lt;tt&gt;To unsubscribe from this group, send an email to:&lt;/tt&gt;\n&lt;br&gt;&lt;tt&gt;Read_Alphabet-unsubscribe@egroups.com&lt;/tt&gt;\n&lt;br&gt;&nbsp;\n&lt;br&gt;&nbsp;\n&lt;p&gt;&lt;tt&gt;Your use of Yahoo! Groups is subject to the &lt;a href=&quot;http://docs.yahoo.com/info/terms/&quot;&gt;Yahoo!\nTerms of Service&lt;/a&gt;.&lt;/tt&gt;&lt;/blockquote&gt;\n\n&lt;/body&gt;\n&lt;/html&gt;\n\r\n--------------AF0B540EC7A27E50883116F7\r\nContent-Type: image/gif\r\nContent-ID: &lt;part1.3C9AA5BC.51095EE5@...&gt;\r\nContent-Disposition: inline; filename=&quot;/tmp/nsmail3C9AA5BC01A3751.gif&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--------------AF0B540EC7A27E50883116F7\r\nContent-Type: image/gif\r\nContent-ID: &lt;part2.3C9AA5BC.51095EE5@...&gt;\r\nContent-Disposition: inline; filename=&quot;/tmp/nsmail3C9AA5BC01B3751.gif&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--------------AF0B540EC7A27E50883116F7--\r\n\n\r\n--------------356AD0DFBC3CF82697B2A1B8--\r\n\n"
}