{
  "userId": 63011010,
  "authorName": "Sergey Goldgaber",
  "from": "&quot;Sergey Goldgaber&quot; &lt;sgoldgaber@...&gt;",
  "profile": "sgoldgaber",
  "replyTo": "LIST",
  "senderId": "m8cql3FPW_m91kCaLFsSwkBYFxPnIoQ_Lr5syl0LQPsqPVWkK5EwAt_5QCXdE4qp3BPeWj2LDd13ZbLkrj67L8-EBM_EnAW5iDpZBM1mIwc",
  "spamInfo": {
    "isSpam": false,
    "reason": "6"
  },
  "subject": "Computer-aided and traditional Quikscript instruction",
  "postDate": "1219694249",
  "msgId": 2014,
  "canDelete": false,
  "contentTrasformed": false,
  "systemMessage": false,
  "headers": {
    "messageIdInHeader": "PGc4djJyOSs0cGNqQGVHcm91cHMuY29tPg=="
  },
  "prevInTopic": 0,
  "nextInTopic": 2015,
  "prevInTime": 2013,
  "nextInTime": 2015,
  "topicId": 2014,
  "numMessagesInTopic": 12,
  "msgSnippet": "Computer-aided and traditional Quikscript instruction Hi, I m new to the group... just started learning QS a few days ago, and am only up to chapter 5 in the",
  "messageBody": "<div id=\"ygrps-yiv-1637453657\">Computer-aided and traditional Quikscript instruction<br/>\n<br/>\nHi, I&#39;m new to the group... just started learning QS a few days ago, <br/>\nand am only up to chapter 5 in the Alice tutorial.  Even though I&#39;m <br/>\nbrand new to QS, my head is already swimming with ideas... so please <br/>\npardon me if some of these ideas have already been covered here <br/>\nbefore.<br/>\n<br/>\n(Note: this message is rather long... you have been warned)<br/>\n<br/>\n<br/>\nPart I - Paper flash cards<br/>\n<br/>\nApart from reading the Alice tutorial, I&#39;ve been using hand-written <br/>\nflash cards that I made on index cards.  Each flash card contains a <br/>\nQS symbol on one side and a few words in TO with the letters for that <br/>\nsymbol&#39;s sound underlined.<br/>\n<br/>\nThis is a decent way of learning the symbols, but it has its <br/>\nproblems.  The most glaring problem is that the **words** written on <br/>\nthe back of each of my flashcards act as a hint to the symbol... and <br/>\nI find myself remembering the QS symbol when cued by the **word**, <br/>\nrather than by the **sound**.  Of course, it&#39;s preferable to be cued <br/>\nby the sound the symbol represents.  To this end, I think flashcards <br/>\non computers are the way to go.<br/>\n<br/>\n<br/>\nPart II - Computerized flash cards<br/>\n<br/>\nOn a computer sounds could be recorded for each phoneme and played <br/>\nback to test the user&#39;s memory of the symbols the sounds represent.<br/>\n<br/>\n - Multiple sounds from one person could be recorded for a single <br/>\nphoneme, capturing slight real-word differences in enunciation, the <br/>\nplaying back of which as part of the flash card regimen could enhance <br/>\nreal-word recognition of these sounds by the student.<br/>\n<br/>\n - Sounds for the same phoneme could also be recorded from more than <br/>\none person, both from people sharing one dialect and from people with <br/>\nother dialects (they could be mixed or learned separately, per the <br/>\nuser&#39;s discretion).<br/>\n<br/>\n - These sounds could be learned individually or strung together in <br/>\nto words, or even sentences.  Of course, this would sound pretty <br/>\nartificial, but it would still likely help in remembering the right <br/>\nQS symbols for the right phoneme and in building speed (more on that <br/>\nlater).<br/>\n<br/>\n<br/>\nA - Answers<br/>\n<br/>\n - When the user is asked to produce the symbol corresponding to the <br/>\nsound he has heard, he could either type the answer on a keyboard or <br/>\non a tablet/PDA which could use handwriting recognition to match <br/>\nwhat&#39;s written with QS symbols. (Lots of handwriting recognition <br/>\nsoftware already exists... it would just need to be configured to <br/>\nrecognize QS symbols).  Writing on a tablet/PDA won&#39;t have the same <br/>\nfeel as writing with a pen on paper, but the skills will likely be <br/>\neasily transferable.<br/>\n<br/>\n - Of course, these flash cards wouldn&#39;t be limited to being used to <br/>\nremember QS symbols upon hearing phonemes.  As with paper flash <br/>\ncards, the symbol could be shown and the user could be prompted to <br/>\nproduce the corresponding sound.  This sound could be spoken in to a <br/>\nmicrophone connected to the computer, and voice recognition could be <br/>\nused to match what is spoken in to the microphone with a phoneme.  <br/>\n(I&#39;m guessing that software to do this already exists.  It would only <br/>\nneed to be integrated with the display of QS symbols, prompting the <br/>\nuser for an answer, and matching the voice recognized phoneme with <br/>\nwhatever phoneme the programmer expects to match the QS symbol)<br/>\n<br/>\n - When many right answers are given the speed of questions could be <br/>\nincreased.  Conversely, wrong answers could slow the speed of <br/>\nquestions down... and symbols gotten wrong could be asked more <br/>\nfrequently (see the Leitner system in wikipedia&#39;s article on <br/>\nflashcards for more information).<br/>\n<br/>\n<br/>\nB - Speed, words, and sentences<br/>\n<br/>\n - As the increases the speed at which he can give the right answers <br/>\nfor the prompted QS symbols (or phonemes), the speed at which these <br/>\nsymbols/phonemes could be increased, and the symbols/phonemes could <br/>\nbe strung together in to words and even sentences.  Their arrangement <br/>\ncould be completely random, based on a frequency analysis of the <br/>\nsymbols/phonemes most often gotten wrong, or based on a computerized <br/>\ndatabase of the phonemic spelling of english words.  Sentences can <br/>\nalso either be formed based on statistical modeling (markove chains, <br/>\ncontext free grammars, bayesian methods, etc...) or from an English <br/>\nlanguage corpus.<br/>\n<br/>\n<br/>\nC - Last thought on computerized flash cards<br/>\n<br/>\nI would bet that something like what I&#39;ve described above already <br/>\nexists as a language learning aid.  Is anyone aware of such a thing?  <br/>\nHow easily could it be adopted for QS ?<br/>\n<br/>\n<br/>\nPart III - Other computerized learning aids<br/>\n<br/>\nDoes anyone know of any free, downloadable, open format sources of <br/>\nphonemically spelled English words?  These would be really useful for <br/>\nautomatically generating QS texts (again, either using statistical <br/>\nmethods or something like Project Gutenberg), and would save a lot of <br/>\nslow transcription of English texts by hand.<br/>\n<br/>\nOne other quick idea I wanted to mention in regards to QS text meant <br/>\nfor public consumption is a proposal to have some sort of <br/>\nstandardized indication of what dialect the text is written in.  The <br/>\nAlice tutorial is written in an Australian dialect (with almost all <br/>\nof the R&#39;s missing)... as an American, it&#39;s quite readable for me, <br/>\nbut I&#39;m wondering if I&#39;m acquiring bad habits in training myself to <br/>\nrecognize the spelling of familiar words with an Australian accent.<br/>\n<br/>\nSo it would be nice if I could do a quick web search for QS texts <br/>\nwritten in an American dialect (or, even better, in a New England <br/>\naccent, which is closer to my own), or at least be quickly able to be <br/>\ndetermine which dialect/accent a QS text is written in.<br/>\n<br/>\nFor example, I&#39;ve seen Aesop&#39;s fables in QS on the web somewhere... <br/>\nbut I&#39;m not going to have any idea of which dialect they&#39;re written <br/>\nin until I actually try to read it.  So I think some kind of standard <br/>\nnotice re: the dialect/accent of the text would be useful.  (Of <br/>\ncourse, if a standardized spelling for all QS texts is adopted, this <br/>\nwill be a moot point)<br/>\n<br/>\n<br/>\nPart IV - Traditional QS instruction<br/>\n<br/>\nA - Alice<br/>\n<br/>\nNow some comments about the Alice tutorial.  I&#39;m really enjoying it.  <br/>\nI think using Alice in Wonderland as a teaching text is a great idea, <br/>\nas it has such a universal appeal across cultures and age groups, <br/>\nconsidering its relatively simple language, and considering much of <br/>\nCarroll&#39;s own concern in the book is with language and wordplay.<br/>\n<br/>\nB - Problems with Alice<br/>\n<br/>\nHowever, using Alice in Wonderland as a tutorial, and using it in <br/>\nthis particular way has it&#39;s problems.<br/>\n<br/>\nFirst, it is rather long, and having to read each chapter twice can <br/>\nget tiresome.<br/>\n<br/>\nSecond, while the method of mixing Roman letters with QS is an <br/>\ningenious way of learning, I find that it also leads to some <br/>\nconfusion.  For example, since the QS symbol &quot;Roe&quot; (#25) is not <br/>\nintroduced until chapter 10, while the QS symbol &quot;Utter&quot; (#36) is <br/>\nintroduced in chapter 4, and the lowercase Roman letter &quot;r&quot; looks <br/>\nsimilar to the QS symbol &quot;Utter&quot;, it&#39;s easy to confuse the two... <br/>\nespecially when a word spelled with &quot;Utter&quot; closely precedes or <br/>\nfollows a word spelled with &quot;r&quot;.<br/>\n<br/>\nThird there&#39;s the issue of the most comprehensive QS tutorial being <br/>\nwritten in the Australian dialect, which is great for Australian (and <br/>\nmaybe even British) students... but the American dialect would be <br/>\nmuch preferable for American students; since, while a QS text written <br/>\nwith an Australian dialect is quite readable for Americans (at least <br/>\nfor this American it is), I am concerned that I&#39;m learning bad habits <br/>\n(for example, learning to spell/recognize words without &quot;r&quot;s and <br/>\nusing different QS symbols than I would in American).  This might <br/>\nturn out to be a minor issue, but I think I&#39;d still be more <br/>\ncomfortable learning with a text written with an American dialect... <br/>\njust in case.<br/>\n<br/>\nC - Proposed solutions<br/>\n<br/>\n - A series of short tutorials instead of one long tutorail might be <br/>\npreferable, to break up the tedium of requiring the reading of one <br/>\nlong book (well, long for a first book read in a new orthographic <br/>\nsystem, anyway).<br/>\n<br/>\n - These tutorials could use poems, very short children&#39;s books, <br/>\nmyths, and/or folk tales (which also tend to be short).<br/>\n<br/>\n - Ideally, the tutorial should be written using only the QS letters <br/>\nthe student has learned up to that point.  This may require <br/>\nexceedingly simple texts at first, but the texts should be able to <br/>\nquickly move up in complexity (and interest for adult students).<br/>\n<br/>\n - Books on reading instruction (for both adults and children) would <br/>\nprobably have some great ideas for other creative ways of teaching <br/>\nreading, and perhaps some good suggestions for texts that could be <br/>\nused for tutorials.<br/>\n<br/>\n - We need some thorough tutorials written in American dialects.  <br/>\nHopefully, by the time I&#39;m through learning QS myself, I&#39;ll have <br/>\nenough enthusiasm left to write my own.  Until then, all I can do is <br/>\nsend out a plea to others of you who are already competent enough to <br/>\nwrite tutorials.  If you have time, writing some tutorials in <br/>\nAmerican dialects would be most helpful.  Perhaps a group project <br/>\ncould be created for this purpose, with various people here <br/>\ncontributing chapters or segments to it... and maybe others doing <br/>\nproofreading.<br/>\n<br/>\n - More QS reading material needs to be created.  I&#39;m sure this point <br/>\nhas been discussed at length in this group and elsewhere.  So, can <br/>\nanyone tell me what the status of automated software for the <br/>\nconversion of texts written in TO (ie. Project Gutenberg) to QS is?  <br/>\nDoes such software exist?  I&#39;m under the impression that BBC news is <br/>\nbeing converted to QS in an automated fashion.  Does anyone know the <br/>\ndetails of how this is accomplished?  Could the same system be used <br/>\nto translate Project Gutenberg texts?<br/>\n<br/>\nThat&#39;s it.  For anyone who&#39;s managed to bear through my whole post, I <br/>\nsalute you!  :)<br/>\n<br/>\n  --Sergey Goldgaber</div>",
  "specialLinks": [],
  "rawEmail": "Return-Path: &lt;sgoldgaber@...&gt;\r\nX-Sender: sgoldgaber@...\r\nX-Apparently-To: Read_Alphabet@yahoogroups.com\r\nX-Received: (qmail 1413 invoked from network); 25 Aug 2008 19:57:33 -0000\r\nX-Received: from unknown (66.218.67.96)\n  by m52.grp.scd.yahoo.com with QMQP; 25 Aug 2008 19:57:33 -0000\r\nX-Received: from unknown (HELO n17d.bullet.scd.yahoo.com) (66.218.67.56)\n  by mta17.grp.scd.yahoo.com with SMTP; 25 Aug 2008 19:57:33 -0000\r\nX-Received: from [66.218.69.6] by n17.bullet.scd.yahoo.com with NNFMP; 25 Aug 2008 19:57:30 -0000\r\nX-Received: from [66.218.66.87] by t6.bullet.scd.yahoo.com with NNFMP; 25 Aug 2008 19:57:29 -0000\r\nDate: Mon, 25 Aug 2008 19:57:29 -0000\r\nTo: Read_Alphabet@yahoogroups.com\r\nMessage-ID: &lt;g8v2r9+4pcj@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:6:0:0:0\r\nFrom: &quot;Sergey Goldgaber&quot; &lt;sgoldgaber@...&gt;\r\nSubject: Computer-aided and traditional Quikscript instruction\r\nX-Yahoo-Group-Post: member; u=63011010; y=Dymz2Ipx1dSs2cMURzA2ALNwdXQ1EbDJs0wIguYJRenVaRv94Q\r\nX-Yahoo-Profile: sgoldgaber\r\n\r\nComputer-aided and traditional Quikscript instruction\n\nHi, I&#39;m new to the g=\r\nroup... just started learning QS a few days ago, \nand am only up to chapter=\r\n 5 in the Alice tutorial.  Even though I&#39;m \nbrand new to QS, my head is alr=\r\neady swimming with ideas... so please \npardon me if some of these ideas hav=\r\ne already been covered here \nbefore.\n\n(Note: this message is rather long...=\r\n you have been warned)\n\n\nPart I - Paper flash cards\n\nApart from reading the=\r\n Alice tutorial, I&#39;ve been using hand-written \nflash cards that I made on i=\r\nndex cards.  Each flash card contains a \nQS symbol on one side and a few wo=\r\nrds in TO with the letters for that \nsymbol&#39;s sound underlined.\n\nThis is a =\r\ndecent way of learning the symbols, but it has its \nproblems.  The most gla=\r\nring problem is that the **words** written on \nthe back of each of my flash=\r\ncards act as a hint to the symbol... and \nI find myself remembering the QS =\r\nsymbol when cued by the **word**, \nrather than by the **sound**.  Of course=\r\n, it&#39;s preferable to be cued \nby the sound the symbol represents.  To this =\r\nend, I think flashcards \non computers are the way to go.\n\n\nPart II - Comput=\r\nerized flash cards\n\nOn a computer sounds could be recorded for each phoneme=\r\n and played \nback to test the user&#39;s memory of the symbols the sounds repre=\r\nsent.\n\n - Multiple sounds from one person could be recorded for a single \np=\r\nhoneme, capturing slight real-word differences in enunciation, the \nplaying=\r\n back of which as part of the flash card regimen could enhance \nreal-word r=\r\necognition of these sounds by the student.\n\n - Sounds for the same phoneme =\r\ncould also be recorded from more than \none person, both from people sharing=\r\n one dialect and from people with \nother dialects (they could be mixed or l=\r\nearned separately, per the \nuser&#39;s discretion).\n\n - These sounds could be l=\r\nearned individually or strung together in \nto words, or even sentences.  Of=\r\n course, this would sound pretty \nartificial, but it would still likely hel=\r\np in remembering the right \nQS symbols for the right phoneme and in buildin=\r\ng speed (more on that \nlater).\n\n\nA - Answers\n\n - When the user is asked to =\r\nproduce the symbol corresponding to the \nsound he has heard, he could eithe=\r\nr type the answer on a keyboard or \non a tablet/PDA which could use handwri=\r\nting recognition to match \nwhat&#39;s written with QS symbols. (Lots of handwri=\r\nting recognition \nsoftware already exists... it would just need to be confi=\r\ngured to \nrecognize QS symbols).  Writing on a tablet/PDA won&#39;t have the sa=\r\nme \nfeel as writing with a pen on paper, but the skills will likely be \neas=\r\nily transferable.\n\n - Of course, these flash cards wouldn&#39;t be limited to b=\r\neing used to \nremember QS symbols upon hearing phonemes.  As with paper fla=\r\nsh \ncards, the symbol could be shown and the user could be prompted to \npro=\r\nduce the corresponding sound.  This sound could be spoken in to a \nmicropho=\r\nne connected to the computer, and voice recognition could be \nused to match=\r\n what is spoken in to the microphone with a phoneme.  \n(I&#39;m guessing that s=\r\noftware to do this already exists.  It would only \nneed to be integrated wi=\r\nth the display of QS symbols, prompting the \nuser for an answer, and matchi=\r\nng the voice recognized phoneme with \nwhatever phoneme the programmer expec=\r\nts to match the QS symbol)\n\n - When many right answers are given the speed =\r\nof questions could be \nincreased.  Conversely, wrong answers could slow the=\r\n speed of \nquestions down... and symbols gotten wrong could be asked more \n=\r\nfrequently (see the Leitner system in wikipedia&#39;s article on \nflashcards fo=\r\nr more information).\n\n\nB - Speed, words, and sentences\n\n - As the increases=\r\n the speed at which he can give the right answers \nfor the prompted QS symb=\r\nols (or phonemes), the speed at which these \nsymbols/phonemes could be incr=\r\neased, and the symbols/phonemes could \nbe strung together in to words and e=\r\nven sentences.  Their arrangement \ncould be completely random, based on a f=\r\nrequency analysis of the \nsymbols/phonemes most often gotten wrong, or base=\r\nd on a computerized \ndatabase of the phonemic spelling of english words.  S=\r\nentences can \nalso either be formed based on statistical modeling (markove =\r\nchains, \ncontext free grammars, bayesian methods, etc...) or from an Englis=\r\nh \nlanguage corpus.\n\n\nC - Last thought on computerized flash cards\n\nI would=\r\n bet that something like what I&#39;ve described above already \nexists as a lan=\r\nguage learning aid.  Is anyone aware of such a thing?  \nHow easily could it=\r\n be adopted for QS ?\n\n\nPart III - Other computerized learning aids\n\nDoes an=\r\nyone know of any free, downloadable, open format sources of \nphonemically s=\r\npelled English words?  These would be really useful for \nautomatically gene=\r\nrating QS texts (again, either using statistical \nmethods or something like=\r\n Project Gutenberg), and would save a lot of \nslow transcription of English=\r\n texts by hand.\n\nOne other quick idea I wanted to mention in regards to QS =\r\ntext meant \nfor public consumption is a proposal to have some sort of \nstan=\r\ndardized indication of what dialect the text is written in.  The \nAlice tut=\r\norial is written in an Australian dialect (with almost all \nof the R&#39;s miss=\r\ning)... as an American, it&#39;s quite readable for me, \nbut I&#39;m wondering if I=\r\n&#39;m acquiring bad habits in training myself to \nrecognize the spelling of fa=\r\nmiliar words with an Australian accent.\n\nSo it would be nice if I could do =\r\na quick web search for QS texts \nwritten in an American dialect (or, even b=\r\netter, in a New England \naccent, which is closer to my own), or at least be=\r\n quickly able to be \ndetermine which dialect/accent a QS text is written in=\r\n.\n\nFor example, I&#39;ve seen Aesop&#39;s fables in QS on the web somewhere... \nbut=\r\n I&#39;m not going to have any idea of which dialect they&#39;re written \nin until =\r\nI actually try to read it.  So I think some kind of standard \nnotice re: th=\r\ne dialect/accent of the text would be useful.  (Of \ncourse, if a standardiz=\r\ned spelling for all QS texts is adopted, this \nwill be a moot point)\n\n\nPart=\r\n IV - Traditional QS instruction\n\nA - Alice\n\nNow some comments about the Al=\r\nice tutorial.  I&#39;m really enjoying it.  \nI think using Alice in Wonderland =\r\nas a teaching text is a great idea, \nas it has such a universal appeal acro=\r\nss cultures and age groups, \nconsidering its relatively simple language, an=\r\nd considering much of \nCarroll&#39;s own concern in the book is with language a=\r\nnd wordplay.\n\nB - Problems with Alice\n\nHowever, using Alice in Wonderland a=\r\ns a tutorial, and using it in \nthis particular way has it&#39;s problems.\n\nFirs=\r\nt, it is rather long, and having to read each chapter twice can \nget tireso=\r\nme.\n\nSecond, while the method of mixing Roman letters with QS is an \ningeni=\r\nous way of learning, I find that it also leads to some \nconfusion.  For exa=\r\nmple, since the QS symbol &quot;Roe&quot; (#25) is not \nintroduced until chapter 10, =\r\nwhile the QS symbol &quot;Utter&quot; (#36) is \nintroduced in chapter 4, and the lowe=\r\nrcase Roman letter &quot;r&quot; looks \nsimilar to the QS symbol &quot;Utter&quot;, it&#39;s easy t=\r\no confuse the two... \nespecially when a word spelled with &quot;Utter&quot; closely p=\r\nrecedes or \nfollows a word spelled with &quot;r&quot;.\n\nThird there&#39;s the issue of th=\r\ne most comprehensive QS tutorial being \nwritten in the Australian dialect, =\r\nwhich is great for Australian (and \nmaybe even British) students... but the=\r\n American dialect would be \nmuch preferable for American students; since, w=\r\nhile a QS text written \nwith an Australian dialect is quite readable for Am=\r\nericans (at least \nfor this American it is), I am concerned that I&#39;m learni=\r\nng bad habits \n(for example, learning to spell/recognize words without &quot;r&quot;s=\r\n and \nusing different QS symbols than I would in American).  This might \ntu=\r\nrn out to be a minor issue, but I think I&#39;d still be more \ncomfortable lear=\r\nning with a text written with an American dialect... \njust in case.\n\nC - Pr=\r\noposed solutions\n\n - A series of short tutorials instead of one long tutora=\r\nil might be \npreferable, to break up the tedium of requiring the reading of=\r\n one \nlong book (well, long for a first book read in a new orthographic \nsy=\r\nstem, anyway).\n\n - These tutorials could use poems, very short children&#39;s b=\r\nooks, \nmyths, and/or folk tales (which also tend to be short).\n\n - Ideally,=\r\n the tutorial should be written using only the QS letters \nthe student has =\r\nlearned up to that point.  This may require \nexceedingly simple texts at fi=\r\nrst, but the texts should be able to \nquickly move up in complexity (and in=\r\nterest for adult students).\n\n - Books on reading instruction (for both adul=\r\nts and children) would \nprobably have some great ideas for other creative w=\r\nays of teaching \nreading, and perhaps some good suggestions for texts that =\r\ncould be \nused for tutorials.\n\n - We need some thorough tutorials written i=\r\nn American dialects.  \nHopefully, by the time I&#39;m through learning QS mysel=\r\nf, I&#39;ll have \nenough enthusiasm left to write my own.  Until then, all I ca=\r\nn do is \nsend out a plea to others of you who are already competent enough =\r\nto \nwrite tutorials.  If you have time, writing some tutorials in \nAmerican=\r\n dialects would be most helpful.  Perhaps a group project \ncould be created=\r\n for this purpose, with various people here \ncontributing chapters or segme=\r\nnts to it... and maybe others doing \nproofreading.\n\n - More QS reading mate=\r\nrial needs to be created.  I&#39;m sure this point \nhas been discussed at lengt=\r\nh in this group and elsewhere.  So, can \nanyone tell me what the status of =\r\nautomated software for the \nconversion of texts written in TO (ie. Project =\r\nGutenberg) to QS is?  \nDoes such software exist?  I&#39;m under the impression =\r\nthat BBC news is \nbeing converted to QS in an automated fashion.  Does anyo=\r\nne know the \ndetails of how this is accomplished?  Could the same system be=\r\n used \nto translate Project Gutenberg texts?\n\nThat&#39;s it.  For anyone who&#39;s =\r\nmanaged to bear through my whole post, I \nsalute you!  :)\n\n  --Sergey Goldg=\r\naber\n\n\n\n"
}