{
  "userId": 260423823,
  "authorName": "ianknowland",
  "from": "&quot;ianknowland&quot; &lt;ianknowland@...&gt;",
  "profile": "ianknowland",
  "replyTo": "LIST",
  "senderId": "7CeLL8hDIVErYFwV_fFJofcOHd2GVb3GFg18vi4ZOcCt-2gq6SLNi2oFiZIUvfxb5Zfcsh_9Urdm-6uarixptQeYRE1nDEdSKc7FHw",
  "spamInfo": {
    "isSpam": false,
    "reason": "6"
  },
  "subject": "My thoughts on the matter...",
  "postDate": "1243540233",
  "msgId": 2107,
  "canDelete": false,
  "contentTrasformed": false,
  "systemMessage": true,
  "headers": {
    "messageIdInHeader": "PGd2bXB1OSt1MGM0QGVHcm91cHMuY29tPg=="
  },
  "prevInTopic": 0,
  "nextInTopic": 2108,
  "prevInTime": 2106,
  "nextInTime": 2108,
  "topicId": 2107,
  "numMessagesInTopic": 3,
  "msgSnippet": "I ve been studying Quickscript on and off for a while now. I am definitely intrigued by the economy of written language that it offers. I am a career student",
  "messageBody": "<div id=\"ygrps-yiv-1454595109\">I&#39;ve been studying Quickscript on and off for a while now. I am definitely intrigued by the economy of written language that it offers. I am a career student of languages in all forms and I have to say that in the grand scheme of things, this idea of simplifying the written English language seems like a stifled--and brilliant--revelation. <br/>\n     We&#39;re too lazy to begin integrating a system like this for whatever reason, even though in recent years we&#39;ve wasted no time in ditching many American and English traditions. America is not synonymous with tradition the way so many other countries are. To the rest of the world we are forward-thinking wielders of ingenuity and innovation, always changing and finding new ways to make things better, faster, smarter, and stronger. <br/>\n     With that said, this isn&#39;t something that can happen quickly. The change would have to be slow and consistent. If we started to integrate this into our culture, it would have to start with elementary schoolchildren. Adults alive today probably won&#39;t live to see the integration completed, as it isn&#39;t very practical to teach every last person who is currently in this country. This much is stated in the manual itself and I think it&#39;s still spot on. <br/>\n     If this sort of thing became a reality we would definitely see a lot of fast and positive growth nationwide and even worldwide. It would be new and strange and rejected in some places at first, but after 10 or 12 years it would be almost natural to hear about. The idea has incredible merit and I think as long as we were consistent about it we would have no problem accepting it as a nation. After we got past the initial hump of familiarizing ourselves with the concept, we&#39;d be unable to deny the impact it could very well have on our economy. Many, many companies are finding more and more ways to &quot;go green&quot; and by simply introducing a new writing system like this we would be cutting a lot of excess budget for things like paper mills, printing presses, various tools for handwritten communication. It seems like a small thing but pens, pencils and erasers would last twice as long, if not longer, and thus completely cut in half that entire market. <br/>\n     These are the most obvious implications and I&#39;m sure I&#39;m not the first to have thought of them. Shaw and Kingsley Read certainly were thinking of this, though I don&#39;t think they saw exactly how much it could benefit us in this day and age. <br/>\n     I&#39;m going to keep learning the system and use it whenever possible, and in my lifetime it will probably only be a hobby for me and the handful of individuals who study it for kicks like me. But it has incredible potential, that much is certain. Does anybody think differently? I don&#39;t ask that in a challenging way, but I&#39;d honestly like to know what someone thinks who doesn&#39;t believe it could work mainstream. I definitely have a biased view so I haven&#39;t really thought about the negative aspects that might arise.</div>",
  "specialLinks": [],
  "rawEmail": "Return-Path: &lt;ianknowland@...&gt;\r\nReceived: (qmail 36342 invoked from network); 29 May 2009 06:19:44 -0000\r\nReceived: from unknown (98.137.34.45)\n  by m8.grp.re1.yahoo.com with QMQP; 29 May 2009 06:19:44 -0000\r\nReceived: from unknown (HELO n40b.bullet.mail.sp1.yahoo.com) (66.163.168.154)\n  by mta2.grp.sp2.yahoo.com with SMTP; 29 May 2009 06:19:44 -0000\r\nDKIM-Signature: v=1; a=rsa-sha256; c=relaxed/relaxed; d=yahoogroups.com; s=lima; t=1243577957; bh=p5dS0rmKjjccN3gG994D/3DC/nHDYNNPzTO31SKI7g4=; h=Received:Received:X-Sender:X-Apparently-To:X-Received:X-Received:X-Received:X-Received:X-Received:Date:To:Message-ID:User-Agent:MIME-Version:Content-Type:Content-Transfer-Encoding:X-Mailer:X-Yahoo-Newman-Property:X-Originating-IP:X-eGroups-Msg-Info:X-Yahoo-Post-IP:From:Subject:X-Yahoo-Group-Post:X-Yahoo-Profile:Sender:X-eGroups-Approved-By:X-eGroups-Auth; b=opifck849YJBwF/IAC85INHVBMvC+uzxNpXH88F/rOrc9cGDIgPs/oZ+F3BZPeFbaLu2OXSvj1Vh7RrUxKaPGPin0e+qp39AgECPbvlzGyLhPhIfj7lOdx4HSp6ZMqef\r\nReceived: from [69.147.65.171] by n40.bullet.mail.sp1.yahoo.com with NNFMP; 29 May 2009 06:19:17 -0000\r\nReceived: from [98.137.34.72] by t13.bullet.mail.sp1.yahoo.com with NNFMP; 29 May 2009 06:19:17 -0000\r\nX-Sender: ianknowland@...\r\nX-Apparently-To: Read_Alphabet@yahoogroups.com\r\nX-Received: (qmail 93159 invoked from network); 28 May 2009 19:50:45 -0000\r\nX-Received: from unknown (98.137.34.44)\n  by m5.grp.sp2.yahoo.com with QMQP; 28 May 2009 19:50:45 -0000\r\nX-Received: from unknown (HELO n38b.bullet.mail.sp1.yahoo.com) (66.163.168.152)\n  by mta1.grp.sp2.yahoo.com with SMTP; 28 May 2009 19:50:44 -0000\r\nX-Received: from [69.147.65.171] by n38.bullet.mail.sp1.yahoo.com with NNFMP; 28 May 2009 19:50:33 -0000\r\nX-Received: from [98.137.34.32] by t13.bullet.mail.sp1.yahoo.com with NNFMP; 28 May 2009 19:50:33 -0000\r\nDate: Thu, 28 May 2009 19:50:33 -0000\r\nTo: Read_Alphabet@yahoogroups.com\r\nMessage-ID: &lt;gvmpu9+u0c4@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-system\r\nX-eGroups-Msg-Info: 1:6:0:0:0\r\nFrom: &quot;ianknowland&quot; &lt;ianknowland@...&gt;\r\nSubject: My thoughts on the matter...\r\nX-Yahoo-Group-Post: member; u=260423823; y=6oqY3BvSnB3zAzVLhAH2x8lQTsEQcDlquOn9gTsksyHr710VgXM\r\nX-Yahoo-Profile: ianknowland\r\nX-eGroups-Approved-By: tinyallen &lt;Tinyallen@...&gt; via web; 29 May 2009 06:19:16 -0000\r\n\r\n     I&#39;ve been studying Quickscript on and off for a while now. I am defini=\r\ntely intrigued by the economy of written language that it offers. I am a ca=\r\nreer student of languages in all forms and I have to say that in the grand =\r\nscheme of things, this idea of simplifying the written English language see=\r\nms like a stifled--and brilliant--revelation. \n     We&#39;re too lazy to begin=\r\n integrating a system like this for whatever reason, even though in recent =\r\nyears we&#39;ve wasted no time in ditching many American and English traditions=\r\n. America is not synonymous with tradition the way so many other countries =\r\nare. To the rest of the world we are forward-thinking wielders of ingenuity=\r\n and innovation, always changing and finding new ways to make things better=\r\n, faster, smarter, and stronger. \n     With that said, this isn&#39;t something=\r\n that can happen quickly. The change would have to be slow and consistent. =\r\nIf we started to integrate this into our culture, it would have to start wi=\r\nth elementary schoolchildren. Adults alive today probably won&#39;t live to see=\r\n the integration completed, as it isn&#39;t very practical to teach every last =\r\nperson who is currently in this country. This much is stated in the manual =\r\nitself and I think it&#39;s still spot on. \n     If this sort of thing became a=\r\n reality we would definitely see a lot of fast and positive growth nationwi=\r\nde and even worldwide. It would be new and strange and rejected in some pla=\r\nces at first, but after 10 or 12 years it would be almost natural to hear a=\r\nbout. The idea has incredible merit and I think as long as we were consiste=\r\nnt about it we would have no problem accepting it as a nation. After we got=\r\n past the initial hump of familiarizing ourselves with the concept, we&#39;d be=\r\n unable to deny the impact it could very well have on our economy. Many, ma=\r\nny companies are finding more and more ways to &quot;go green&quot; and by simply int=\r\nroducing a new writing system like this we would be cutting a lot of excess=\r\n budget for things like paper mills, printing presses, various tools for ha=\r\nndwritten communication. It seems like a small thing but pens, pencils and =\r\nerasers would last twice as long, if not longer, and thus completely cut in=\r\n half that entire market. \n     These are the most obvious implications and=\r\n I&#39;m sure I&#39;m not the first to have thought of them. Shaw and Kingsley Read=\r\n certainly were thinking of this, though I don&#39;t think they saw exactly how=\r\n much it could benefit us in this day and age. \n     I&#39;m going to keep lear=\r\nning the system and use it whenever possible, and in my lifetime it will pr=\r\nobably only be a hobby for me and the handful of individuals who study it f=\r\nor kicks like me. But it has incredible potential, that much is certain. Do=\r\nes anybody think differently? I don&#39;t ask that in a challenging way, but I&#39;=\r\nd honestly like to know what someone thinks who doesn&#39;t believe it could wo=\r\nrk mainstream. I definitely have a biased view so I haven&#39;t really thought =\r\nabout the negative aspects that might arise.\n\n\n"
}