{
  "userId": 96992996,
  "authorName": "cossyrosario",
  "from": "&quot;cossyrosario&quot; &lt;cossyrosario@...&gt;",
  "profile": "cossyrosario",
  "replyTo": "LIST",
  "senderId": "L_LgG-7fb7AFJWqrAJc__JmHL7zRbkYNnSH0FGcz4FN3UQkjWBhhJLA3bQ_wnRR6edE5KA09U0Ky8NTdqCzTnm3hNVlLgJy-goa91VLlBLk",
  "spamInfo": {
    "isSpam": false,
    "reason": "6"
  },
  "subject": "Shavian - ad lib",
  "postDate": "1314281402",
  "msgId": 2247,
  "canDelete": false,
  "contentTrasformed": false,
  "systemMessage": false,
  "headers": {
    "messageIdInHeader": "PGozNWwzcStuOWdhQGVHcm91cHMuY29tPg=="
  },
  "prevInTopic": 0,
  "nextInTopic": 2248,
  "prevInTime": 2245,
  "nextInTime": 2248,
  "topicId": 2247,
  "numMessagesInTopic": 4,
  "msgSnippet": "By now I am sufficiently familiar and (shall I say) fluent with reading and writing QuikScript (Junior and Senior) to be willing to look at the Shaw alphabet",
  "messageBody": "<div id=\"ygrps-yiv-843367678\">By now I am sufficiently familiar and (shall I say) fluent with reading and writing QuikScript (Junior and Senior) to be willing to look at the Shaw alphabet without feeling I&#39;m going to confuse myself. After all, I am already multi-lingual and don&#39;t get confused among languages, similar and dissimilar. <br><br>When I&#39;m switching from, say, Italian to Portuguese, I just need a few moments to get into the mental &quot;set&quot; needed and I can speak, converse, read and write Portuguese. When I next want to speak Italian, I just take a few moments to change my set back to Italian. Of course, since English is my daily language, I don&#39;t need to get back into an English mental set. It&#39;s there whenever I need it. I can do the Portuguese-Italian switch with other languages too: Bahasa Indonesia, Hindi, Esperanto. (Incidentally, the Shaw alphabet has been adapted for Esperanto, and is called <a rel=\"nofollow\" target=\"_blank\" href=\"http://esperanto.us/sxava_alfabeto/\">La Sxavo Alfabeto</a>&nbsp;.)<br><br>I thought of experimenting with multi-script switching. Once again, the Traditional Orthography is available on call, and I need to get &quot;into the mode&quot; only when I want to write and read QS. I thought that with a little mental focus I could do the same with the Shaw alphabet, and switch back and forth between the scripts, until I decide which I prefer.<br><br>I started this experiment by familiarizing myself with Shavian. I found it remarkably easy to pick up, and to read and write. After less than a week, I can switch back and forth between Shavian and QS.<br><br>I found that while QS is faster to write (almost like shorthand) because it is semi-cursive, Shavian with its print-like quality is easier to write because it doesn&#39;t seem so dependent on aligning Tall and Short letters on a common baseline and running the Deep letters through the baseline. Also QS has Shush and They are so similar in shape that they absolutely depend on the correct positioning to distinguish one from the other, with Shush being on the line and They through the line. And I find the Loll in QS clumsy as compared to the same letter in Shavian.<br><br>On the other hand, Shavian doesn&#39;t have any ambiguous letters, that depend on positioning, so that I can write Tall and Short and Deep fairly fast on blank unruled paper, and have no difficulty in reading what I have written even after a few days.<br><br>I&#39;m still persuaded as to the economy of time and space that QS provides, specially Senior Script, and will probably revert to it as the standard note-taking script, but I have a question:<br><br>Question:<br>What do you think of the idea of using <i>some</i> Shavian characters in QS, where one finds them more aesthetic or easier to distinguish or easier to write like the Shavian version of Loll? After all, when speaking English we do take the liberty of using foreign words, italicizing them, <i>ad lib</i>. Some Latin contractions are so well known that we don&#39;t even recognize them as Latin, <i>e.g., i.e.</i> We don&#39;t even italicize these.<br><br>So it looks as if I&#39;m inclining slightly away from the <i>pukka </i>standards that I set for myself when I started this journey. That said, I promised myself I would not go <i>berserk</i> with mixed scripts, not use them <i>ad absurdam, </i>but might use them<i> </i>as verbal/script <i>confetti!<br><br></i></div>",
  "specialLinks": [],
  "rawEmail": "Return-Path: &lt;cossyrosario@...&gt;\r\nX-Sender: cossyrosario@...\r\nX-Apparently-To: Read_Alphabet@yahoogroups.com\r\nX-Received: (qmail 93009 invoked from network); 25 Aug 2011 14:10:03 -0000\r\nX-Received: from unknown (98.137.34.44)\n  by m6.grp.sp2.yahoo.com with QMQP; 25 Aug 2011 14:10:03 -0000\r\nX-Received: from unknown (HELO n45b.bullet.mail.sp1.yahoo.com) (66.163.168.159)\n  by mta1.grp.sp2.yahoo.com with SMTP; 25 Aug 2011 14:10:03 -0000\r\nX-Received: from [69.147.65.149] by n45.bullet.mail.sp1.yahoo.com with NNFMP; 25 Aug 2011 14:10:03 -0000\r\nX-Received: from [98.137.34.32] by t9.bullet.mail.sp1.yahoo.com with NNFMP; 25 Aug 2011 14:10:03 -0000\r\nDate: Thu, 25 Aug 2011 14:10:02 -0000\r\nTo: Read_Alphabet@yahoogroups.com\r\nMessage-ID: &lt;j35l3q+n9ga@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: multipart/alternative; boundary=&quot;6-3517198743-0385637643=:2&quot;\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:6:0:0:0\r\nFrom: &quot;cossyrosario&quot; &lt;cossyrosario@...&gt;\r\nSubject: Shavian - ad lib\r\nX-Yahoo-Group-Post: member; u=96992996; y=BdjDb3r9f8--nJeRJYwmVAaFc8CL3GDcCwAGp0jKpB0fjjphNFNL\r\nX-Yahoo-Profile: cossyrosario\r\n\r\n\r\n--6-3517198743-0385637643=:2\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nBy now I am sufficiently familiar and (shall I say) fluent with reading\nand=\r\n writing QuikScript (Junior and Senior) to be willing to look at the\nShaw a=\r\nlphabet without feeling I&#39;m going to confuse myself. After all, I\nam alread=\r\ny multi-lingual and don&#39;t get confused among languages, similar\nand dissimi=\r\nlar.\n\nWhen I&#39;m switching from, say, Italian to Portuguese, I just need a fe=\r\nw\nmoments to get into the mental &quot;set&quot; needed and I can speak, converse,\nre=\r\nad and write Portuguese. When I next want to speak Italian, I just\ntake a f=\r\new moments to change my set back to Italian. Of course, since\nEnglish is my=\r\n daily language, I don&#39;t need to get back into an English\nmental set. It&#39;s =\r\nthere whenever I need it. I can do the\nPortuguese-Italian switch with other=\r\n languages too: Bahasa Indonesia,\nHindi, Esperanto. (Incidentally, the Shaw=\r\n alphabet has been adapted for\nEsperanto, and is called La Sxavo Alfabeto\n&lt;=\r\nhttp://esperanto.us/sxava_alfabeto/&gt;  .)\n\nI thought of experimenting with m=\r\nulti-script switching. Once again, the\nTraditional Orthography is available=\r\n on call, and I need to get &quot;into\nthe mode&quot; only when I want to write and r=\r\nead QS. I thought that with a\nlittle mental focus I could do the same with =\r\nthe Shaw alphabet, and\nswitch back and forth between the scripts, until I d=\r\necide which I\nprefer.\n\nI started this experiment by familiarizing myself wi=\r\nth Shavian. I found\nit remarkably easy to pick up, and to read and write. A=\r\nfter less than a\nweek, I can switch back and forth between Shavian and QS.\n=\r\n\nI found that while QS is faster to write (almost like shorthand) because\ni=\r\nt is semi-cursive, Shavian with its print-like quality is easier to\nwrite b=\r\necause it doesn&#39;t seem so dependent on aligning Tall and Short\nletters on a=\r\n common baseline and running the Deep letters through the\nbaseline. Also QS=\r\n has Shush and They are so similar in shape that they\nabsolutely depend on =\r\nthe correct positioning to distinguish one from the\nother, with Shush being=\r\n on the line and They through the line. And I\nfind the Loll in QS clumsy as=\r\n compared to the same letter in Shavian.\n\nOn the other hand, Shavian doesn&#39;=\r\nt have any ambiguous letters, that\ndepend on positioning, so that I can wri=\r\nte Tall and Short and Deep\nfairly fast on blank unruled paper, and have no =\r\ndifficulty in reading\nwhat I have written even after a few days.\n\nI&#39;m still=\r\n persuaded as to the economy of time and space that QS\nprovides, specially =\r\nSenior Script, and will probably revert to it as the\nstandard note-taking s=\r\ncript, but I have a question:\n\nQuestion:\nWhat do you think of the idea of u=\r\nsing some Shavian characters in QS,\nwhere one finds them more aesthetic or =\r\neasier to distinguish or easier\nto write like the Shavian version of Loll? =\r\nAfter all, when speaking\nEnglish we do take the liberty of using foreign wo=\r\nrds, italicizing them,\nad lib. Some Latin contractions are so well known th=\r\nat we don&#39;t even\nrecognize them as Latin, e.g., i.e. We don&#39;t even italiciz=\r\ne these.\n\nSo it looks as if I&#39;m inclining slightly away from the pukka stan=\r\ndards\nthat I set for myself when I started this journey. That said, I promi=\r\nsed\nmyself I would not go berserk with mixed scripts, not use them ad\nabsur=\r\ndam, but might use them as verbal/script confetti!\n\n\n\r\n--6-3517198743-0385637643=:2\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nBy now I am sufficiently familiar and (shall I say) fluent with reading and=\r\n writing QuikScript (Junior and Senior) to be willing to look at the Shaw a=\r\nlphabet without feeling I&#39;m going to confuse myself. After all, I am alread=\r\ny multi-lingual and don&#39;t get confused among languages, similar and dissimi=\r\nlar. &lt;br&gt;&lt;br&gt;When I&#39;m switching from, say, Italian to Portuguese, I just ne=\r\ned a few moments to get into the mental &quot;set&quot; needed and I can speak, conve=\r\nrse, read and write Portuguese. When I next want to speak Italian, I just t=\r\nake a few moments to change my set back to Italian. Of course, since Englis=\r\nh is my daily language, I don&#39;t need to get back into an English mental set=\r\n. It&#39;s there whenever I need it. I can do the Portuguese-Italian switch wit=\r\nh other languages too: Bahasa Indonesia, Hindi, Esperanto. (Incidentally, t=\r\nhe Shaw alphabet has been adapted for Esperanto, and is called &lt;a href=3D&quot;h=\r\nttp://esperanto.us/sxava_alfabeto/&quot;&gt;La Sxavo Alfabeto&lt;/a&gt;&nbsp;.)&lt;br&gt;&lt;br&gt;I =\r\nthought of experimenting with multi-script switching. Once again, the Tradi=\r\ntional Orthography is available on call, and I need to get &quot;into the mode&quot; =\r\nonly when I want to write and read QS. I thought that with a little mental =\r\nfocus I could do the same with the Shaw alphabet, and switch back and forth=\r\n between the scripts, until I decide which I prefer.&lt;br&gt;&lt;br&gt;I started this =\r\nexperiment by familiarizing myself with Shavian. I found it remarkably easy=\r\n to pick up, and to read and write. After less than a week, I can switch ba=\r\nck and forth between Shavian and QS.&lt;br&gt;&lt;br&gt;I found that while QS is faster=\r\n to write (almost like shorthand) because it is semi-cursive, Shavian with =\r\nits print-like quality is easier to write because it doesn&#39;t seem so depend=\r\nent on aligning Tall and Short letters on a common baseline and running the=\r\n Deep letters through the baseline. Also QS has Shush and They are so simil=\r\nar in shape that they absolutely depend on the correct positioning to disti=\r\nnguish one from the other, with Shush being on the line and They through th=\r\ne line. And I find the Loll in QS clumsy as compared to the same letter in =\r\nShavian.&lt;br&gt;&lt;br&gt;On the other hand, Shavian doesn&#39;t have any ambiguous lette=\r\nrs, that depend on positioning, so that I can write Tall and Short and Deep=\r\n fairly fast on blank unruled paper, and have no difficulty in reading what=\r\n I have written even after a few days.&lt;br&gt;&lt;br&gt;I&#39;m still persuaded as to the=\r\n economy of time and space that QS provides, specially Senior Script, and w=\r\nill probably revert to it as the standard note-taking script, but I have a =\r\nquestion:&lt;br&gt;&lt;br&gt;Question:&lt;br&gt;What do you think of the idea of using &lt;i&gt;som=\r\ne&lt;/i&gt; Shavian characters in QS, where one finds them more aesthetic or easi=\r\ner to distinguish or easier to write like the Shavian version of Loll? Afte=\r\nr all, when speaking English we do take the liberty of using foreign words,=\r\n italicizing them, &lt;i&gt;ad lib&lt;/i&gt;. Some Latin contractions are so well known=\r\n that we don&#39;t even recognize them as Latin, &lt;i&gt;e.g., i.e.&lt;/i&gt; We don&#39;t eve=\r\nn italicize these.&lt;br&gt;&lt;br&gt;So it looks as if I&#39;m inclining slightly away fro=\r\nm the &lt;i&gt;pukka &lt;/i&gt;standards that I set for myself when I started this jour=\r\nney. That said, I promised myself I would not go &lt;i&gt;berserk&lt;/i&gt; with mixed =\r\nscripts, not use them &lt;i&gt;ad absurdam, &lt;/i&gt;but might use them&lt;i&gt; &lt;/i&gt;as verb=\r\nal/script &lt;i&gt;confetti!&lt;br&gt;&lt;br&gt;&lt;/i&gt;\n\r\n--6-3517198743-0385637643=:2--\r\n\n"
}