{
  "userId": 111730019,
  "authorName": "Tim",
  "from": "&quot;Tim&quot; &lt;rubik67@...&gt;",
  "profile": "rubik67",
  "replyTo": "LIST",
  "senderId": "z2LISq-8oEcCUPqotp5I5PH6kMfeLZ7HzUjUEP26Whvq4h8iZqlzbvY-vMvKz2PEi0wA7_w2_67O6aEARmLvuw",
  "spamInfo": {
    "isSpam": false,
    "reason": "12"
  },
  "subject": "And now for something completely different.",
  "postDate": "1357366525",
  "msgId": 2316,
  "canDelete": false,
  "contentTrasformed": false,
  "systemMessage": false,
  "headers": {
    "messageIdInHeader": "PGtjOGdkdCtydm5hQGVHcm91cHMuY29tPg=="
  },
  "prevInTopic": 0,
  "nextInTopic": 2317,
  "prevInTime": 2315,
  "nextInTime": 2317,
  "topicId": 2316,
  "numMessagesInTopic": 5,
  "msgSnippet": "A post from me that s actually on topic. :-) Over the past week, I ve been writing messages about getting my book published. I was wondering, has anyone ever",
  "messageBody": "<div id=\"ygrps-yiv-1652202480\">A post from me that&#39;s actually on topic. :-) Over the past week, I&#39;ve been writing messages about getting my book published. I was wondering, has anyone ever tried to get anything published in Quikscript? I first decided to publish my book because I felt that the world as a whole NEEDS to learn about how to make English spelling phonetic. I learned about Quikscript later, and later still about Unifon. I&#39;m sure there&#39;s countless others out there, too. Although I haven&#39;t really researched Quikscript enough to become a fan of it (someone sent me the manual for it years ago, but I found it too confusing compared at the time to the simplicity of Shavian), I&#39;d probably buy a book or two written in Quikscript, especially if it was on a subject of interest to me, but the only info I found on publication in this group was a message by tim_rice09 back on July 4th, 2006. Since I found the other groups, I was pretty impressed with the transliterated works that people posted to the files section, but so long as that&#39;s ALL that&#39;s done, phonetic spelling over all will only be seen by the general public as a pipe dream. It&#39;ll take publication for people to REALLY sit up and take notice and to build overall awareness. It doesn&#39;t really matter to me which system &quot;wins&quot;, so long as traditional orthography ends up being the loser.</div>",
  "specialLinks": [],
  "rawEmail": "Return-Path: &lt;rubik67@...&gt;\r\nX-Sender: rubik67@...\r\nX-Apparently-To: Read_Alphabet@yahoogroups.com\r\nX-Received: (qmail 97624 invoked from network); 5 Jan 2013 06:15:26 -0000\r\nX-Received: from unknown (98.137.34.46)\n  by m15.grp.sp2.yahoo.com with QMQP; 5 Jan 2013 06:15:26 -0000\r\nX-Received: from unknown (HELO ng18-vm5.bullet.mail.gq1.yahoo.com) (98.136.219.226)\n  by mta3.grp.sp2.yahoo.com with SMTP; 5 Jan 2013 06:15:26 -0000\r\nX-Received: from [98.137.0.81] by ng18.bullet.mail.gq1.yahoo.com with NNFMP; 05 Jan 2013 06:15:25 -0000\r\nX-Received: from [98.137.34.73] by tg10.bullet.mail.gq1.yahoo.com with NNFMP; 05 Jan 2013 06:15:25 -0000\r\nDate: Sat, 05 Jan 2013 06:15:25 -0000\r\nTo: Read_Alphabet@yahoogroups.com\r\nMessage-ID: &lt;kc8gdt+rvna@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Tim&quot; &lt;rubik67@...&gt;\r\nSubject: And now for something completely different.\r\nX-Yahoo-Group-Post: member; u=111730019; y=IKmwJLgfXFkPKVnHVLMZ3j3YZfG8h59_tevbRFsDG_S_Og\r\nX-Yahoo-Profile: rubik67\r\n\r\nA post from me that&#39;s actually on topic. :-) Over the past week, I&#39;ve been =\r\nwriting messages about getting my book published. I was wondering, has anyo=\r\nne ever tried to get anything published in Quikscript? I first decided to p=\r\nublish my book because I felt that the world as a whole NEEDS to learn abou=\r\nt how to make English spelling phonetic. I learned about Quikscript later, =\r\nand later still about Unifon. I&#39;m sure there&#39;s countless others out there, =\r\ntoo. Although I haven&#39;t really researched Quikscript enough to become a fan=\r\n of it (someone sent me the manual for it years ago, but I found it too con=\r\nfusing compared at the time to the simplicity of Shavian), I&#39;d probably buy=\r\n a book or two written in Quikscript, especially if it was on a subject of =\r\ninterest to me, but the only info I found on publication in this group was =\r\na message by tim_rice09 back on July 4th, 2006. Since I found the other gro=\r\nups, I was pretty impressed with the transliterated works that people poste=\r\nd to the files section, but so long as that&#39;s ALL that&#39;s done, phonetic spe=\r\nlling over all will only be seen by the general public as a pipe dream. It&#39;=\r\nll take publication for people to REALLY sit up and take notice and to buil=\r\nd overall awareness. It doesn&#39;t really matter to me which system &quot;wins&quot;, so=\r\n long as traditional orthography ends up being the loser.\n\n\n"
}