{
  "userId": 111730019,
  "authorName": "Tim",
  "from": "&quot;Tim&quot; &lt;rubik67@...&gt;",
  "profile": "rubik67",
  "replyTo": "LIST",
  "senderId": "1kf-KGAnaxn5hH4X14o_qj57LpIsPaNnVDFKDnECN2WhLg0zwalA2G_n5eJQBvJCBlC9KdjnS9n2eYpI5yTK7g",
  "spamInfo": {
    "isSpam": false,
    "reason": "12"
  },
  "subject": "Re: And now for something completely different.",
  "postDate": "1357426667",
  "msgId": 2319,
  "canDelete": false,
  "contentTrasformed": false,
  "systemMessage": false,
  "headers": {
    "messageIdInHeader": "PGtjYWI1YitsOGU5QGVHcm91cHMuY29tPg==",
    "inReplyToHeader": "PDEzNTczODMyMjYuNjQ1MzkuWWFob29NYWlsTmVvQHdlYjE2MzYwMS5tYWlsLmdxMS55YWhvby5jb20+"
  },
  "prevInTopic": 2318,
  "nextInTopic": 2320,
  "prevInTime": 2318,
  "nextInTime": 2320,
  "topicId": 2316,
  "numMessagesInTopic": 5,
  "msgSnippet": "... You re preaching to the choir on that one. ... You can indeed. If you go to unifon.org and click on Downloads, there s stacks of fonts that you can",
  "messageBody": "<div id=\"ygrps-yiv-1128580951\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Read_Alphabet@yahoogroups.com\">Read_Alphabet@yahoogroups.com</a>, Sid Tanaban  wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I admire your enthusiasm about involvement in such projects and <br/>\n&gt; have tried my hand at it but decisions seem to paralyze one&#39;s <br/>\n&gt; progress. <br/>\n<br/>\n </span></blockquote>You&#39;re preaching to the choir on that one.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Can you write unifon on the computer?<br/>\n<br/>\n </span></blockquote>You can indeed. If you go to unifon.org and click on Downloads, there&#39;s stacks of fonts that you can download and install. near the bottom of the page, there&#39;s a printable chart of unifon characters. If you study it for about 3 minutes, you&#39;ll probably be able to read it with a reasonable degree of fluency. heck, it may not even be necessary to read the chart. I was pretty depressed when I found out about that after spending so much time on Shavian. Like Quikscript, Unifon merges up and ado. It also merges ah an on/ox, but leaves awe on its own.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; BTW I am interested in reading Shaw&#39;s but really have not received <br/>\n&gt; any info except Shaw and Poe. Are you unable to simply write a <br/>\n&gt; simple ad about it for those who cannot see clearly your graphic ad <br/>\n&gt; about it? <br/>\n<br/>\n </span></blockquote>I can, but I&#39;m still surprised that it&#39;s not coming up. I&#39;ve tried it on 7 systems so far, my own (CRT), a public access one (flat screen), 2 Macbook Pros, a Macbook Air, an iPad mini and an iPad 2, and on ALL of them it&#39;s coming up super clear. If anything, the Mac/iPad systems show up even MORE clear and easier to read than the do on my CRT! If I hadn&#39;t seen it for myself, I wouldn&#39;t have believed that that was possible. Then again, the last time I really paid much attention to flat screens, LCD was all the rage.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How many pages does it have, dimensions, fiction or non-fiction, Why did you choose these two authors, etc.<br/>\n<br/>\n </span></blockquote>The book&#39;s 397 pages long (121 for the condensed version, with all of the Poe works of the original, just none of the traditional spelling), Crown Quatro sized for both (7.444&quot; x 9.681&quot;, or 18.91cm x 24.589cm, 0.79kg and 0.27kg respectively). The breakdown is 22 pages of poetry, 119 pages of fiction and 44 pages of non-fiction, per alphabet in the original and 14, 61 and 23 pages respectively for the Condensed book (smaller font, while still maintaining readability).<br/>\n<br/>\nThe &quot;Shaw&quot; part of the title is merely a reference to the Shaw Alphabet. I chose Poe mainly because of his extreme versatility. Most people think of him only as a horror writer, but he also wrote love poetry, science fiction (before Jules Verne), science fact (even hypothesising the solar wind 100 years before anyone in astronomy did), mysteries (even including a detective before the word &quot;detective&quot; was coined in English, using terms like &quot;ratiocination&quot; instead) book reviews, philosophical treatises, and even a documentary on how he wrote The Raven (The Philosophy of Composition). I&#39;ve also included my own version of The Philosophy of Composition in the book (Introduction, or How to Write a Book In Just 11 Years), an appendix where I go over things about the Shaw Alphabet that I found challenging with the spelling, how I resolved them, and propose 4 new characters to fill in what I felt were some major gaps (ks, gz, wh and -ing), and finally a Shaw Alphabet &quot;cheat sheet&quot; at the back of the book similar to the one in Androcles. The only thing &quot;missing&quot; from the Condensed version is the &quot;Bonus&quot; section where I set Some Words With a Mummy to standard margins so people could really see for themselves just how much can really be saved by switching to Shaw from traditional spelling. It was dropped because everything in the Condensed version uses standard margins anyway and it would have been unnecessary duplication.<br/>\n<br/>\nTo see them without going through my web site, you can go to Lulu.com and do a search on &quot;Poe Meets Shaw&quot;, or you can go to the direct links below.<br/>\n<br/>\nOriginal: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lulu.com/shop/tim-browne/poe-meets-shaw-the-shaw-alphabet-edition-of-edgar-allan-poe/paperback/product-20613599.html\">http://www.lulu.com/shop/tim-browne/poe-meets-shaw-the-shaw-alphabet-edition-of-edgar-allan-poe/paperback/product-20613599.html</a><br/>\nCondensed: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lulu.com/shop/tim-browne/poe-meets-shaw-the-condensed-shaw-alphabet-edition-of-edgar-allan-poe/paperback/product-20613636.html\">http://www.lulu.com/shop/tim-browne/poe-meets-shaw-the-condensed-shaw-alphabet-edition-of-edgar-allan-poe/paperback/product-20613636.html</a><br/>\n<br/>\nBelow each thumbnail, there&#39;s a Preview link so that you can look inside the book as well as see the front and back covers. The works included in the Preview are Eldorado, The Philosophy of Furniture, and The Sphinx, chosen basically because they&#39;re short, show one work from each section, and exposes the readers to things that they probably wouldn&#39;t get from any other Poe compilation. The Condensed preview also showcases The Divine Right of Kings, since I put it on the same page as Eldorado to help get the page size, and hence the cost, down as much as I could. The preview for both also includes the table of contents (in BOTH formats for the original) and the Shaw Alphabet&#39;s &quot;cheat sheet&quot;.</div>",
  "specialLinks": [],
  "rawEmail": "Return-Path: &lt;rubik67@...&gt;\r\nX-Sender: rubik67@...\r\nX-Apparently-To: Read_Alphabet@yahoogroups.com\r\nX-Received: (qmail 24513 invoked from network); 5 Jan 2013 22:57:48 -0000\r\nX-Received: from unknown (98.137.34.44)\n  by m7.grp.sp2.yahoo.com with QMQP; 5 Jan 2013 22:57:48 -0000\r\nX-Received: from unknown (HELO ng1-ip1.bullet.mail.ne1.yahoo.com) (98.138.215.55)\n  by mta1.grp.sp2.yahoo.com with SMTP; 5 Jan 2013 22:57:48 -0000\r\nX-Received: from [98.138.217.181] by ng1.bullet.mail.ne1.yahoo.com with NNFMP; 05 Jan 2013 22:57:48 -0000\r\nX-Received: from [98.137.34.184] by tg6.bullet.mail.ne1.yahoo.com with NNFMP; 05 Jan 2013 22:57:48 -0000\r\nDate: Sat, 05 Jan 2013 22:57:47 -0000\r\nTo: Read_Alphabet@yahoogroups.com\r\nMessage-ID: &lt;kcab5b+l8e9@...&gt;\r\nIn-Reply-To: &lt;1357383226.64539.YahooMailNeo@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Tim&quot; &lt;rubik67@...&gt;\r\nSubject: Re: And now for something completely different.\r\nX-Yahoo-Group-Post: member; u=111730019; y=dYSO7yiziM1HLdaWljvk6_kgRBAHk_IRJax69KPCRbdJZQ\r\nX-Yahoo-Profile: rubik67\r\n\r\n--- In Read_Alphabet@yahoogroups.com, Sid Tanaban  wrote:\n\n&gt; I admire your =\r\nenthusiasm about involvement in such projects and \n&gt; have tried my hand at =\r\nit but decisions seem to paralyze one&#39;s \n&gt; progress. \n\nYou&#39;re preaching to =\r\nthe choir on that one.\n\n&gt; Can you write unifon on the computer?\n\nYou can in=\r\ndeed. If you go to unifon.org and click on Downloads, there&#39;s stacks of fon=\r\nts that you can download and install. near the bottom of the page, there&#39;s =\r\na printable chart of unifon characters. If you study it for about 3 minutes=\r\n, you&#39;ll probably be able to read it with a reasonable degree of fluency. h=\r\neck, it may not even be necessary to read the chart. I was pretty depressed=\r\n when I found out about that after spending so much time on Shavian. Like Q=\r\nuikscript, Unifon merges up and ado. It also merges ah an on/ox, but leaves=\r\n awe on its own.\n\n&gt; BTW I am interested in reading Shaw&#39;s but really have n=\r\not received \n&gt; any info except Shaw and Poe. Are you unable to simply write=\r\n a \n&gt; simple ad about it for those who cannot see clearly your graphic ad \n=\r\n&gt; about it? \n\nI can, but I&#39;m still surprised that it&#39;s not coming up. I&#39;ve =\r\ntried it on 7 systems so far, my own (CRT), a public access one (flat scree=\r\nn), 2 Macbook Pros, a Macbook Air, an iPad mini and an iPad 2, and on ALL o=\r\nf them it&#39;s coming up super clear. If anything, the Mac/iPad systems show u=\r\np even MORE clear and easier to read than the do on my CRT! If I hadn&#39;t see=\r\nn it for myself, I wouldn&#39;t have believed that that was possible. Then agai=\r\nn, the last time I really paid much attention to flat screens, LCD was all =\r\nthe rage.\n\n&gt;=A0How many pages does it have, dimensions, fiction or non-fict=\r\nion, Why did you choose these two authors, etc.\n\nThe book&#39;s 397 pages long =\r\n(121 for the condensed version, with all of the Poe works of the original, =\r\njust none of the traditional spelling), Crown Quatro sized for both (7.444&quot;=\r\n x 9.681&quot;, or 18.91cm x 24.589cm, 0.79kg and 0.27kg respectively). The brea=\r\nkdown is 22 pages of poetry, 119 pages of fiction and 44 pages of non-ficti=\r\non, per alphabet in the original and 14, 61 and 23 pages respectively for t=\r\nhe Condensed book (smaller font, while still maintaining readability).\n\nThe=\r\n &quot;Shaw&quot; part of the title is merely a reference to the Shaw Alphabet. I cho=\r\nse Poe mainly because of his extreme versatility. Most people think of him =\r\nonly as a horror writer, but he also wrote love poetry, science fiction (be=\r\nfore Jules Verne), science fact (even hypothesising the solar wind 100 year=\r\ns before anyone in astronomy did), mysteries (even including a detective be=\r\nfore the word &quot;detective&quot; was coined in English, using terms like &quot;ratiocin=\r\nation&quot; instead) book reviews, philosophical treatises, and even a documenta=\r\nry on how he wrote The Raven (The Philosophy of Composition). I&#39;ve also inc=\r\nluded my own version of The Philosophy of Composition in the book (Introduc=\r\ntion, or How to Write a Book In Just 11 Years), an appendix where I go over=\r\n things about the Shaw Alphabet that I found challenging with the spelling,=\r\n how I resolved them, and propose 4 new characters to fill in what I felt w=\r\nere some major gaps (ks, gz, wh and -ing), and finally a Shaw Alphabet &quot;che=\r\nat sheet&quot; at the back of the book similar to the one in Androcles. The only=\r\n thing &quot;missing&quot; from the Condensed version is the &quot;Bonus&quot; section where I =\r\nset Some Words With a Mummy to standard margins so people could really see =\r\nfor themselves just how much can really be saved by switching to Shaw from =\r\ntraditional spelling. It was dropped because everything in the Condensed ve=\r\nrsion uses standard margins anyway and it would have been unnecessary dupli=\r\ncation.\n\nTo see them without going through my web site, you can go to Lulu.=\r\ncom and do a search on &quot;Poe Meets Shaw&quot;, or you can go to the direct links =\r\nbelow.\n\nOriginal: http://www.lulu.com/shop/tim-browne/poe-meets-shaw-the-sh=\r\naw-alphabet-edition-of-edgar-allan-poe/paperback/product-20613599.html\nCond=\r\nensed: http://www.lulu.com/shop/tim-browne/poe-meets-shaw-the-condensed-sha=\r\nw-alphabet-edition-of-edgar-allan-poe/paperback/product-20613636.html\n\nBelo=\r\nw each thumbnail, there&#39;s a Preview link so that you can look inside the bo=\r\nok as well as see the front and back covers. The works included in the Prev=\r\niew are Eldorado, The Philosophy of Furniture, and The Sphinx, chosen basic=\r\nally because they&#39;re short, show one work from each section, and exposes th=\r\ne readers to things that they probably wouldn&#39;t get from any other Poe comp=\r\nilation. The Condensed preview also showcases The Divine Right of Kings, si=\r\nnce I put it on the same page as Eldorado to help get the page size, and he=\r\nnce the cost, down as much as I could. The preview for both also includes t=\r\nhe table of contents (in BOTH formats for the original) and the Shaw Alphab=\r\net&#39;s &quot;cheat sheet&quot;.\n\n\n"
}