{
  "userId": 458641688,
  "authorName": "Nathan Sharfi",
  "from": "Nathan Sharfi &lt;bonusfrogs@...&gt;",
  "profile": "dipartite",
  "replyTo": "LIST",
  "senderId": "nqaJuuq2ixlCZEXrFlXEs_lrXWaiwYbQHbe8FhzKIBiHhhBQUg8S7d7v45WU0WpMQTGEFgc8ymzFA-xrYNvKI2LMvtMjlALx3FvP",
  "spamInfo": {
    "isSpam": false,
    "reason": "12"
  },
  "subject": "Re: [Read_Alphabet] Unicode Status",
  "postDate": "1366049523",
  "msgId": 2400,
  "canDelete": false,
  "contentTrasformed": false,
  "systemMessage": false,
  "headers": {
    "messageIdInHeader": "PDM2NzMwNERFLUIyRTEtNEJGMC1BRDkzLTVGOTQ4N0E1NDI1NkBnbWFpbC5jb20+",
    "inReplyToHeader": "PDA1NUJBMjgwLTVEMzctNDE2My1CRTU2LUUxRjRFNTk3QTA2NEBldmVydHlwZS5jb20+",
    "referencesHeader": "PGtrN3I0dit0c2hkQGVHcm91cHMuY29tPiA8MDU1QkEyODAtNUQzNy00MTYzLUJFNTYtRTFGNEU1OTdBMDY0QGV2ZXJ0eXBlLmNvbT4="
  },
  "prevInTopic": 2399,
  "nextInTopic": 2401,
  "prevInTime": 2399,
  "nextInTime": 2401,
  "topicId": 2365,
  "numMessagesInTopic": 34,
  "msgSnippet": "... Given what I ve seen I d have to disagree; I haven t seen anything written by Read s own hand that suggests that SHAVIAN PEEP would ever work in",
  "messageBody": "<div id=\"ygrps-yiv-228472754\">On Apr 12, 2013, at 3:58 AM, Michael Everson &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:everson@...\">everson@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; The concept is to visually identify shapes of words and the differences are enough to confuse a TEA versus PEA while reading.<br/>\n&gt; <br/>\n&gt; Characters are encoded according to the character/glyph model. QUIKSCRIPT PEA looks like a script glyph variant of SHAVIAN PEEP. QUIKSCRIPT FEE looks like a script glyph variant of SHAVIAN FEE.<br/>\n<br/>\n </span></blockquote>Given what I&#39;ve seen I&#39;d have to disagree; I haven&#39;t seen anything written by Read&#39;s own hand that suggests that SHAVIAN PEEP would ever work in Quikscript. In a letter dated 1969-12-18, the stroke of PEA goes from the top of the Short letters, up to the Tall Height (analogous to the ascender height), and then back down as far as necessary to connect to the next letter. This inverted U-shape seems to be the essence of PEA, and the waterfall shape of PEEP doesn&#39;t look like it at all to me.<br/>\n<br/>\n(an aside: &quot;the essence&quot; of a particular Quickscript letter seems to change between junior and Senior QS in some cases; in Junior QS, the trailing u-shape of ZOO is omittable whereas in Senior, it&#39;s all you need.)<br/>\n<br/>\nSimilarly, SHAVIAN FEE doesn&#39;t look like QUIKSCRIPT FEE to me — nowhere have I seen any QS handwriting where Read has failed to try and loop back rightwards after making the downward stroke. Because of this, QUICKSCRIPT FEE doesn&#39;t look like a variant of SHAVIAN FEE.<br/>\n<br/>\nI had a look at the Han Unification page on Wikipedia to try and get an idea of what the difference is between glyph variants and different characters, and I couldn&#39;t come up with a clear, crisp distinction — not surprising given the complicated subject matter.<br/>\n<br/>\nIn my own mind, given sets of characters X and Y, where:<br/>\n - x is some character in X<br/>\n - y is some character in Y<br/>\nx is a glyph variant of y…only if x and y are interchangeable <br/>\n<br/>\nKICK and KEY look interchangeable. On the other hand, if I saw TOT in a Quickscript text I&#39;d wonder if it were a too-angled PEA. If I saw THIGH in a Quickscript text I&#39;d think it were a FEE.<br/>\n<br/>\nIs there a general argument in favor of disunification? I&#39;d think &quot;if {Shavian glyph X} were used instead of {Quickscript glyph X} here, it wouldn&#39;t be a variant — it&#39;d be wrong&quot; works. If this general argument is valid, then IMO PEA, TEA, FEE, THAW, YE, BAY, GAY, VIE, THEY, and J&#39;AI would all need to be disunified in addition to the ones specified in shavian-quikscript-draft2.pdf.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Compare any Latin serif or sans-serif font with any Latin script font. <br/>\n<br/>\n </span></blockquote>It&#39;s entirely possible that the contemporary Quickscript community doesn&#39;t have a common notion of what proper Quikscript looks like except by pointing at scanned PDFs of things Read wrote in the late 60s. If we don&#39;t have a clearly delineated common notion of what&#39;s an acceptable variant of glyph X and what isn&#39;t, then my hunch is that the UTC will ask questions we can&#39;t answer crisply. The only remedy to this is to start passing around pictures of handwritten things and then nitpick each other&#39;s handwriting. Through this, we&#39;d start developing notions of what is, and isn&#39;t, proper Quickscript, and then codify all this in a penmanship manual someplace.<br/>\n<br/>\n~ ~ ~<br/>\n<br/>\nExplanations of why I&#39;m wrong about everything I wrote here are greatly appreciated.<br/>\n<br/>\n— Nathan</div>",
  "specialLinks": [],
  "rawEmail": "Return-Path: &lt;bonusfrogs@...&gt;\r\nX-Sender: bonusfrogs@...\r\nX-Apparently-To: Read_Alphabet@yahoogroups.com\r\nX-Received: (qmail 52488 invoked from network); 15 Apr 2013 18:12:08 -0000\r\nX-Received: from unknown (10.193.84.168)\n  by m3.grp.bf1.yahoo.com with QMQP; 15 Apr 2013 18:12:08 -0000\r\nX-Received: from unknown (HELO mail-pb0-f48.google.com) (209.85.160.48)\n  by mta6.grp.bf1.yahoo.com with SMTP; 15 Apr 2013 18:12:08 -0000\r\nX-Received: by mail-pb0-f48.google.com with SMTP id xb4so2632709pbc.35\n        for &lt;Read_Alphabet@yahoogroups.com&gt;; Mon, 15 Apr 2013 11:12:08 -0700 (PDT)\r\nX-Received: by 10.68.117.7 with SMTP id ka7mr29952939pbb.8.1366049528160;\n        Mon, 15 Apr 2013 11:12:08 -0700 (PDT)\r\nReturn-Path: &lt;bonusfrogs@...&gt;\r\nX-Received: from spreadthinly.localdomain (pool-72-67-36-2.lsanca.fios.verizon.net. [72.67.36.2])\n        by mx.google.com with ESMTPS id fa5sm21151312pbb.35.2013.04.15.11.12.05\n        (version=TLSv1 cipher=ECDHE-RSA-RC4-SHA bits=128/128);\n        Mon, 15 Apr 2013 11:12:06 -0700 (PDT)\r\nContent-Type: text/plain; charset=windows-1252\r\nMime-Version: 1.0 (Mac OS X Mail 6.3 &#92;(1503&#92;))\r\nIn-Reply-To: &lt;055BA280-5D37-4163-BE56-E1F4E597A064@...&gt;\r\nDate: Mon, 15 Apr 2013 11:12:03 -0700\r\nContent-Transfer-Encoding: quoted-printable\r\nMessage-Id: &lt;367304DE-B2E1-4BF0-AD93-5F9487A54256@...&gt;\r\nReferences: &lt;kk7r4v+tshd@...&gt; &lt;055BA280-5D37-4163-BE56-E1F4E597A064@...&gt;\r\nTo: Read_Alphabet@yahoogroups.com\r\nX-Mailer: Apple Mail (2.1503)\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Nathan Sharfi &lt;bonusfrogs@...&gt;\r\nSubject: Re: [Read_Alphabet] Unicode Status\r\nX-Yahoo-Group-Post: member; u=458641688; y=_86tM5iDzkypnv4Z2_y9PIBjhlSsPnfCaFkKA-maUuDUxIq9\r\nX-Yahoo-Profile: dipartite\r\n\r\n\nOn Apr 12, 2013, at 3:58 AM, Michael Everson &lt;everson@...&gt; wrote:=\r\n\n\n&gt; &gt; The concept is to visually identify shapes of words and the differenc=\r\nes are enough to confuse a TEA versus PEA while reading.\n&gt; \n&gt; Characters ar=\r\ne encoded according to the character/glyph model. QUIKSCRIPT PEA looks like=\r\n a script glyph variant of SHAVIAN PEEP. QUIKSCRIPT FEE looks like a script=\r\n glyph variant of SHAVIAN FEE.\n\nGiven what I&#39;ve seen I&#39;d have to disagree; =\r\nI haven&#39;t seen anything written by Read&#39;s own hand that suggests that SHAVI=\r\nAN PEEP would ever work in Quikscript. In a letter dated 1969-12-18, the st=\r\nroke of PEA goes from the top of the Short letters, up to the Tall Height (=\r\nanalogous to the ascender height), and then back down as far as necessary t=\r\no connect to the next letter. This inverted U-shape seems to be the essence=\r\n of PEA, and the waterfall shape of PEEP doesn&#39;t look like it at all to me.=\r\n\n\n(an aside: &quot;the essence&quot; of a particular Quickscript letter seems to chan=\r\nge between junior and Senior QS in some cases; in Junior QS, the trailing u=\r\n-shape of ZOO is omittable whereas in Senior, it&#39;s all you need.)\n\nSimilarl=\r\ny, SHAVIAN FEE doesn&#39;t look like QUIKSCRIPT FEE to me =97 nowhere have I se=\r\nen any QS handwriting where Read has failed to try and loop back rightwards=\r\n after making the downward stroke. Because of this, QUICKSCRIPT FEE doesn&#39;t=\r\n look like a variant of SHAVIAN FEE.\n\nI had a look at the Han Unification p=\r\nage on Wikipedia to try and get an idea of what the difference is between g=\r\nlyph variants and different characters, and I couldn&#39;t come up with a clear=\r\n, crisp distinction =97 not surprising given the complicated subject matter=\r\n.\n\nIn my own mind, given sets of characters X and Y, where:\n - x is some ch=\r\naracter in X\n - y is some character in Y\nx is a glyph variant of y=85only i=\r\nf x and y are interchangeable \n\nKICK and KEY look interchangeable. On the o=\r\nther hand, if I saw TOT in a Quickscript text I&#39;d wonder if it were a too-a=\r\nngled PEA. If I saw THIGH in a Quickscript text I&#39;d think it were a FEE.\n\nI=\r\ns there a general argument in favor of disunification? I&#39;d think &quot;if {Shavi=\r\nan glyph X} were used instead of {Quickscript glyph X} here, it wouldn&#39;t be=\r\n a variant =97 it&#39;d be wrong&quot; works. If this general argument is valid, the=\r\nn IMO PEA, TEA, FEE, THAW, YE, BAY, GAY, VIE, THEY, and J&#39;AI would all need=\r\n to be disunified in addition to the ones specified in shavian-quikscript-d=\r\nraft2.pdf.\n\n&gt; Compare any Latin serif or sans-serif font with any Latin scr=\r\nipt font. \n\nIt&#39;s entirely possible that the contemporary Quickscript commun=\r\nity doesn&#39;t have a common notion of what proper Quikscript looks like excep=\r\nt by pointing at scanned PDFs of things Read wrote in the late 60s. If we d=\r\non&#39;t have a clearly delineated common notion of what&#39;s an acceptable varian=\r\nt of glyph X and what isn&#39;t, then my hunch is that the UTC will ask questio=\r\nns we can&#39;t answer crisply. The only remedy to this is to start passing aro=\r\nund pictures of handwritten things and then nitpick each other&#39;s handwritin=\r\ng. Through this, we&#39;d start developing notions of what is, and isn&#39;t, prope=\r\nr Quickscript, and then codify all this in a penmanship manual someplace.\n\n=\r\n~ ~ ~\n\nExplanations of why I&#39;m wrong about everything I wrote here are grea=\r\ntly appreciated.\n\n=97 Nathan\n"
}