{
  "userId": 82638473,
  "authorName": "Michael Everson",
  "from": "Michael Everson &lt;everson@...&gt;",
  "profile": "evertype",
  "replyTo": "LIST",
  "senderId": "lyasWV3T6JTapQ0j5qltUycEUiNwh1crS050hNZkltFZw-j9wYpXRiseinORtwq4b54CfSEHL4SgHfxiqaVCF4JxQkIcH4phtqlgRmc",
  "spamInfo": {
    "isSpam": false,
    "reason": "12"
  },
  "subject": "Re: [Read_Alphabet] Unicode Status",
  "postDate": "1366060514",
  "msgId": 2401,
  "canDelete": false,
  "contentTrasformed": false,
  "systemMessage": false,
  "headers": {
    "messageIdInHeader": "PDRDOTFFOTc1LTY2REYtNDQxNi1BMUJELTU0RjE5ODQxOTVBMkBldmVydHlwZS5jb20+",
    "inReplyToHeader": "PDM2NzMwNERFLUIyRTEtNEJGMC1BRDkzLTVGOTQ4N0E1NDI1NkBnbWFpbC5jb20+",
    "referencesHeader": "PGtrN3I0dit0c2hkQGVHcm91cHMuY29tPiA8MDU1QkEyODAtNUQzNy00MTYzLUJFNTYtRTFGNEU1OTdBMDY0QGV2ZXJ0eXBlLmNvbT4gPDM2NzMwNERFLUIyRTEtNEJGMC1BRDkzLTVGOTQ4N0E1NDI1NkBnbWFpbC5jb20+"
  },
  "prevInTopic": 2400,
  "nextInTopic": 2403,
  "prevInTime": 2400,
  "nextInTime": 2402,
  "topicId": 2365,
  "numMessagesInTopic": 34,
  "msgSnippet": "... What does work mean? Quikscript users prefer cursive handwriting and cursive fonts. That doesn t mean that Quikscript has become a separate script from",
  "messageBody": "<div id=\"ygrps-yiv-170347544\">On 15 Apr 2013, at 19:12, Nathan Sharfi &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bonusfrogs@...\">bonusfrogs@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Characters are encoded according to the character/glyph model. QUIKSCRIPT PEA looks like a script glyph variant of SHAVIAN PEEP. QUIKSCRIPT FEE looks like a script glyph variant of SHAVIAN FEE.<br/>\n&gt; <br/>\n&gt; Given what I&#39;ve seen I&#39;d have to disagree; I haven&#39;t seen anything written by Read&#39;s own hand that suggests that SHAVIAN PEEP would ever work in Quikscript.<br/>\n<br/>\n </span></blockquote>What does &quot;work&quot; mean? Quikscript users prefer cursive handwriting and cursive fonts. That doesn&#39;t mean that Quikscript has become a separate script from Shavian: it hasn&#39;t. Shavian has a consonantal structure of tall/deep characters related to voiceless/voiced sounds, and by and large Quikscript does not deviate from this.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In a letter dated 1969-12-18, the stroke of PEA goes from the top of the Short letters, up to the Tall Height (analogous to the ascender height), and then back down as far as necessary to connect to the next letter. This inverted U-shape seems to be the essence of PEA, and the waterfall shape of PEEP doesn&#39;t look like it at all to me.<br/>\n<br/>\n </span></blockquote>Just look at the massive range of glyphs at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.myfonts.com/search/tag%3Acursive/fonts/\">http://www.myfonts.com/search/tag%3Acursive/fonts/</a> -- it is clear that the variation between Shavian PEEP/TOT and QS PEA/TEA is trivial compared to some of the fanciness we take for granted in Latin every day. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; (an aside: &quot;the essence&quot; of a particular Quickscript letter seems to change between junior and Senior QS in some cases; in Junior QS, the trailing u-shape of ZOO is omittable whereas in Senior, it&#39;s all you need.)<br/>\n<br/>\n </span></blockquote>No. The &quot;essence&quot; of characters in the Shavian/Junior/Senior script has to do with the tall/deep distinction and mirroring and rotation. That is the structural nature of the script. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Similarly, SHAVIAN FEE doesn&#39;t look like QUIKSCRIPT FEE to me — nowhere have I seen any QS handwriting where Read has failed to try and loop back rightwards after making the downward stroke. Because of this, QUICKSCRIPT FEE doesn&#39;t look like a variant of SHAVIAN FEE.<br/>\n<br/>\n </span></blockquote>At a structural level, it is. Not at a palaeographical level. But for palaeography you choose your preferred font, and a Shavianist chooses his or her preferred font. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I had a look at the Han Unification page on Wikipedia to try and get an idea of what the difference is between glyph variants and different characters, and I couldn&#39;t come up with a clear, crisp distinction — not surprising given the complicated subject matter.<br/>\n<br/>\n </span></blockquote>Yes, well, I&#39;ve been doing this work for twenty years and the committees don&#39;t rely on rigid definitions. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In my own mind, given sets of characters X and Y, where:<br/>\n&gt; - x is some character in X<br/>\n&gt; - y is some character in Y<br/>\n&gt; x is a glyph variant of y…only if x and y are interchangeable <br/>\n&gt; <br/>\n&gt; KICK and KEY look interchangeable. On the other hand, if I saw TOT in a Quickscript text I&#39;d wonder if it were a too-angled PEA. If I saw THIGH in a Quickscript text I&#39;d think it were a FEE.<br/>\n<br/>\n </span></blockquote>If you take it as a question of font and handwriting style, the confusion becomes irrelevant. There are Latin-script handwriting styles which are practically illegible without training -- yet they remain Latin. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is there a general argument in favor of disunification? I&#39;d think &quot;if {Shavian glyph X} were used instead of {Quickscript glyph X} here, it wouldn&#39;t be a variant — it&#39;d be wrong&quot; works. If this general argument is valid, then IMO PEA, TEA, FEE, THAW, YE, BAY, GAY, VIE, THEY, and J&#39;AI would all need to be disunified in addition to the ones specified in shavian-quikscript-draft2.pdf.<br/>\n<br/>\n </span></blockquote>I don&#39;t think so, because those participate in the tall/deep structure and loopines or non-loopiness is a matter of cursivity, not character identity. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Compare any Latin serif or sans-serif font with any Latin script font. <br/>\n&gt; <br/>\n&gt; It&#39;s entirely possible that the contemporary Quickscript community doesn&#39;t have a common notion of what proper Quikscript looks like except by pointing at scanned PDFs of things Read wrote in the late 60s.<br/>\n<br/>\n </span></blockquote>Fine. And you have fonts which present those shapes to those users. And Shavian users have Androcles and their range of preferred fonts. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If we don&#39;t have a clearly delineated common notion of what&#39;s an acceptable variant of glyph X and what isn&#39;t, then my hunch is that the UTC will ask questions we can&#39;t answer crisply.<br/>\n<br/>\n </span></blockquote>So far one of the chief experts on the UTC has already agreed that WHY LLAN LOCH EXCITE EXAM are reasonable additions. I am arguing for HE LOW MAY NO to be added to those. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The only remedy to this is to start passing around pictures of handwritten things and then nitpick each other&#39;s handwriting. Through this, we&#39;d start developing notions of what is, and isn&#39;t, proper Quickscript, and then codify all this in a penmanship manual someplace.<br/>\n<br/>\n </span></blockquote>That isn&#39;t really relevant to character encoding. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Explanations of why I&#39;m wrong about everything I wrote here are greatly appreciated.<br/>\n<br/>\n </span></blockquote>I stand by my analysis. Nine characters should be added to the UCS.<br/>\n<br/>\nMichael Everson * <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.evertype.com/\">http://www.evertype.com/</a></div>",
  "specialLinks": [],
  "rawEmail": "Return-Path: &lt;everson@...&gt;\r\nX-Sender: everson@...\r\nX-Apparently-To: Read_Alphabet@yahoogroups.com\r\nX-Received: (qmail 71800 invoked from network); 15 Apr 2013 21:15:17 -0000\r\nX-Received: from unknown (10.193.84.131)\n  by m2.grp.bf1.yahoo.com with QMQP; 15 Apr 2013 21:15:17 -0000\r\nX-Received: from unknown (HELO lh19.dnsireland.com) (78.137.164.59)\n  by mta4.grp.bf1.yahoo.com with SMTP; 15 Apr 2013 21:15:16 -0000\r\nX-Received: from [77.107.209.124] (port=62864 helo=[192.168.10.11])\n\tby lh19.dnsireland.com with esmtpsa (TLSv1:AES128-SHA:128)\n\t(Exim 4.80)\n\t(envelope-from &lt;everson@...&gt;)\n\tid 1URqjt-0004IK-00\n\tfor Read_Alphabet@yahoogroups.com; Mon, 15 Apr 2013 22:15:01 +0100\r\nContent-Type: text/plain; charset=windows-1252\r\nMime-Version: 1.0 (Mac OS X Mail 6.5 &#92;(1507&#92;))\r\nIn-Reply-To: &lt;367304DE-B2E1-4BF0-AD93-5F9487A54256@...&gt;\r\nDate: Mon, 15 Apr 2013 22:15:14 +0100\r\nContent-Transfer-Encoding: quoted-printable\r\nMessage-Id: &lt;4C91E975-66DF-4416-A1BD-54F1984195A2@...&gt;\r\nReferences: &lt;kk7r4v+tshd@...&gt; &lt;055BA280-5D37-4163-BE56-E1F4E597A064@...&gt; &lt;367304DE-B2E1-4BF0-AD93-5F9487A54256@...&gt;\r\nTo: Read_Alphabet@yahoogroups.com\r\nX-Mailer: Apple Mail (2.1507)\r\nX-AntiAbuse: This header was added to track abuse, please include it with any abuse report\r\nX-AntiAbuse: Primary Hostname - lh19.dnsireland.com\r\nX-AntiAbuse: Original Domain - yahoogroups.com\r\nX-AntiAbuse: Originator/Caller UID/GID - [47 12] / [47 12]\r\nX-AntiAbuse: Sender Address Domain - evertype.com\r\nX-Source: \r\nX-Source-Args: \r\nX-Source-Dir: \r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Michael Everson &lt;everson@...&gt;\r\nSubject: Re: [Read_Alphabet] Unicode Status\r\nX-Yahoo-Group-Post: member; u=82638473; y=5wPNcuFLwqyFUYQBttF3LGXT73JfzsvfnYtBjgMIkvlu_8s\r\nX-Yahoo-Profile: evertype\r\n\r\nOn 15 Apr 2013, at 19:12, Nathan Sharfi &lt;bonusfrogs@...&gt; wrote:\n\n&gt;&gt; C=\r\nharacters are encoded according to the character/glyph model. QUIKSCRIPT PE=\r\nA looks like a script glyph variant of SHAVIAN PEEP. QUIKSCRIPT FEE looks l=\r\nike a script glyph variant of SHAVIAN FEE.\n&gt; \n&gt; Given what I&#39;ve seen I&#39;d ha=\r\nve to disagree; I haven&#39;t seen anything written by Read&#39;s own hand that sug=\r\ngests that SHAVIAN PEEP would ever work in Quikscript.\n\nWhat does &quot;work&quot; me=\r\nan? Quikscript users prefer cursive handwriting and cursive fonts. That doe=\r\nsn&#39;t mean that Quikscript has become a separate script from Shavian: it has=\r\nn&#39;t. Shavian has a consonantal structure of tall/deep characters related to=\r\n voiceless/voiced sounds, and by and large Quikscript does not deviate from=\r\n this.\n\n&gt; In a letter dated 1969-12-18, the stroke of PEA goes from the top=\r\n of the Short letters, up to the Tall Height (analogous to the ascender hei=\r\nght), and then back down as far as necessary to connect to the next letter.=\r\n This inverted U-shape seems to be the essence of PEA, and the waterfall sh=\r\nape of PEEP doesn&#39;t look like it at all to me.\n\nJust look at the massive ra=\r\nnge of glyphs at http://www.myfonts.com/search/tag%3Acursive/fonts/ -- it i=\r\ns clear that the variation between Shavian PEEP/TOT and QS PEA/TEA is trivi=\r\nal compared to some of the fanciness we take for granted in Latin every day=\r\n. \n\n&gt; (an aside: &quot;the essence&quot; of a particular Quickscript letter seems to =\r\nchange between junior and Senior QS in some cases; in Junior QS, the traili=\r\nng u-shape of ZOO is omittable whereas in Senior, it&#39;s all you need.)\n\nNo. =\r\nThe &quot;essence&quot; of characters in the Shavian/Junior/Senior script has to do w=\r\nith the tall/deep distinction and mirroring and rotation. That is the struc=\r\ntural nature of the script. \n\n&gt; Similarly, SHAVIAN FEE doesn&#39;t look like QU=\r\nIKSCRIPT FEE to me =97 nowhere have I seen any QS handwriting where Read ha=\r\ns failed to try and loop back rightwards after making the downward stroke. =\r\nBecause of this, QUICKSCRIPT FEE doesn&#39;t look like a variant of SHAVIAN FEE=\r\n.\n\nAt a structural level, it is. Not at a palaeographical level. But for pa=\r\nlaeography you choose your preferred font, and a Shavianist chooses his or =\r\nher preferred font. \n\n&gt; I had a look at the Han Unification page on Wikiped=\r\nia to try and get an idea of what the difference is between glyph variants =\r\nand different characters, and I couldn&#39;t come up with a clear, crisp distin=\r\nction =97 not surprising given the complicated subject matter.\n\nYes, well, =\r\nI&#39;ve been doing this work for twenty years and the committees don&#39;t rely on=\r\n rigid definitions. \n\n&gt; In my own mind, given sets of characters X and Y, w=\r\nhere:\n&gt; - x is some character in X\n&gt; - y is some character in Y\n&gt; x is a gl=\r\nyph variant of y=85only if x and y are interchangeable \n&gt; \n&gt; KICK and KEY l=\r\nook interchangeable. On the other hand, if I saw TOT in a Quickscript text =\r\nI&#39;d wonder if it were a too-angled PEA. If I saw THIGH in a Quickscript tex=\r\nt I&#39;d think it were a FEE.\n\nIf you take it as a question of font and handwr=\r\niting style, the confusion becomes irrelevant. There are Latin-script handw=\r\nriting styles which are practically illegible without training -- yet they =\r\nremain Latin. \n\n&gt; Is there a general argument in favor of disunification? I=\r\n&#39;d think &quot;if {Shavian glyph X} were used instead of {Quickscript glyph X} h=\r\nere, it wouldn&#39;t be a variant =97 it&#39;d be wrong&quot; works. If this general arg=\r\nument is valid, then IMO PEA, TEA, FEE, THAW, YE, BAY, GAY, VIE, THEY, and =\r\nJ&#39;AI would all need to be disunified in addition to the ones specified in s=\r\nhavian-quikscript-draft2.pdf.\n\nI don&#39;t think so, because those participate =\r\nin the tall/deep structure and loopines or non-loopiness is a matter of cur=\r\nsivity, not character identity. \n\n&gt;&gt; Compare any Latin serif or sans-serif =\r\nfont with any Latin script font. \n&gt; \n&gt; It&#39;s entirely possible that the cont=\r\nemporary Quickscript community doesn&#39;t have a common notion of what proper =\r\nQuikscript looks like except by pointing at scanned PDFs of things Read wro=\r\nte in the late 60s.\n\nFine. And you have fonts which present those shapes to=\r\n those users. And Shavian users have Androcles and their range of preferred=\r\n fonts. \n\n&gt; If we don&#39;t have a clearly delineated common notion of what&#39;s a=\r\nn acceptable variant of glyph X and what isn&#39;t, then my hunch is that the U=\r\nTC will ask questions we can&#39;t answer crisply.\n\nSo far one of the chief exp=\r\nerts on the UTC has already agreed that WHY LLAN LOCH EXCITE EXAM are reaso=\r\nnable additions. I am arguing for HE LOW MAY NO to be added to those. \n\n&gt; T=\r\nhe only remedy to this is to start passing around pictures of handwritten t=\r\nhings and then nitpick each other&#39;s handwriting. Through this, we&#39;d start d=\r\neveloping notions of what is, and isn&#39;t, proper Quickscript, and then codif=\r\ny all this in a penmanship manual someplace.\n\nThat isn&#39;t really relevant to=\r\n character encoding. \n\n&gt; Explanations of why I&#39;m wrong about everything I w=\r\nrote here are greatly appreciated.\n\nI stand by my analysis. Nine characters=\r\n should be added to the UCS.\n\nMichael Everson * http://www.evertype.com/\n"
}