{
  "userId": 458641688,
  "authorName": "Nathan Sharfi",
  "from": "Nathan Sharfi &lt;bonusfrogs@...&gt;",
  "profile": "dipartite",
  "replyTo": "LIST",
  "senderId": "ZdxQQIwvk46d10PpQmBHFKXP36yphZIr0mG3Y5gMCfTTxejgrPfy6wb-Ldvjk4vN3sPYcxNXGpbLONCvyIHO5hCEteaAj3NrAd-Z",
  "spamInfo": {
    "isSpam": false,
    "reason": "12"
  },
  "subject": "Injecting new life into the Quikscript community (was: Re: [Read_Alphabet] we need each other for this,)",
  "postDate": "1372723256",
  "msgId": 2556,
  "canDelete": false,
  "contentTrasformed": false,
  "systemMessage": false,
  "headers": {
    "messageIdInHeader": "PDQ2MkU3RDI0LUEyM0YtNERCRS1CNzlELTEzMURDNkQxOURENUBnbWFpbC5jb20+",
    "inReplyToHeader": "PDg1MDE1OENELTU0MDMtNERGQy04MzBFLUYwMDE0NkYzRjBCRkBnbWFpbC5jb20+",
    "referencesHeader": "PGtxcmo0aStubXFpQGVHcm91cHMuY29tPiA8OTE3MTg5QjctNjhEQy00RDA4LTg0RkMtQUU5QUUwNzI4RDZGQGdtYWlsLmNvbT4gPDg1MDE1OENELTU0MDMtNERGQy04MzBFLUYwMDE0NkYzRjBCRkBnbWFpbC5jb20+"
  },
  "prevInTopic": 2554,
  "nextInTopic": 2557,
  "prevInTime": 2555,
  "nextInTime": 2557,
  "topicId": 2552,
  "numMessagesInTopic": 6,
  "msgSnippet": "From what I gather, I didn t convey tone in a way that would have been impossible to misunderstand — I was simply puzzled why someone would need our voice",
  "messageBody": "<div id=\"ygrps-yiv-1546506678\"><html><head><base></head><div>From what I gather, I didn&#39;t convey tone in a way that would have been impossible to misunderstand — I was simply puzzled why someone would need <b>our</b> voice samples as opposed to something that&#39;s a bit more nationally representative. If you&#39;ve been following the posts John Cowan and I have been sending back and forth, you&#39;d have noticed that our speech isn&#39;t necessarily representative of where we&#39;re from/in, so sampling <b>us</b> would&#39;ve been of limited utility. Plus there&#39;re other things that require <b>Quikscript</b> expertise…</div><div><br></div><div>If you&#39;re looking to inject some life into the community, here&#39;re a few things that I&#39;d like to do, but haven&#39;t quite had the time/inclination for:</div><div><br></div><div><ul class=\"ygrps-yiv-1546506678MailOutline\"><li>Design a largely QWERTY-compatible keyboard layout for Quikscript that disunifies parentheses from angle parentheses, omits half-letters (use OpenType substitution for that), and doesn&#39;t throw away any useful other punctuation.</li><li>Hold a nice, public discussion on what can be safely thrown away on a Quikscript keyboard ought to be useful —&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"https://github.com/adiabatic/king-kong\">King Kong</a>&#39;s supported punctuation is a strict superset of what&#39;s on a normal US keyboard, but this might not be strictly necessary — and I&#39;m kinda fuzzy on how AltGr is supposed to work on keyboards that have that key, anyway. At any rate, it&#39;d be nice to learn how AltGr works on Windows — I know that while it&#39;s conceptually similar to the Option key on the Mac, I don&#39;t know if AltGr users have preexisting expectations on what keys should do what. At any rate, there are quite a few keyboard layouts already buried in the Files section of this group, and — speaking as a keyboard-layout creator — get some feedback on what one non-experimental layout I should focus most of my time on.</li><li>Track down all the authors of all the Quikscript fonts that&#39;re out there and get them to clarify their license terms — ideally, with an explicit public domain dedication. The term &quot;freeware&quot;&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gnu.org/philosophy/categories.html#freeware\">is ambiguous</a>, and I&#39;d rather not allocate my time to playing in someone else&#39;s sandbox. As for Kingsley — tracking down &quot;tinyallen&quot; shouldn&#39;t be difficult since he&#39;s been active on the list over the past couple days, but I don&#39;t know about Messrs. Stephen Bartok and Oliver Langan. At any rate, the copyright field says &quot;Typeface copyright High-Logic. 1999, 2002. All Rights Reserved&quot;, but the license field says &quot;This is a freeware font.&quot;. Since High-Logic is a company that makes font-making software, I&#39;d suspect that it was inserted without the original author&#39;s intent — but I&#39;m not sure. At any rate, getting them to publish their font sources — as a&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"http://unifiedfontobject.org/\">UFO</a>, say — would be great.</li><li>Figure out, collectively, a&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"https://en.wikipedia.org/wiki/NATO_phonetic_alphabet\">NATO alphabet</a>&nbsp;for Quikscript (this echoes Tim Rice&#39;s call for better names). Ideally, all letters should start with the sound that they&#39;re for, not be anything that needs a name dot (i.e. no proper names), and be obvious to everyone what each is even when shouted over a bad cell-phone connection with significant amounts of background noise. This doesn&#39;t need to be the work of one person; Google Spreadsheets sounds like the sort of thing that could be used to collaborate on all this. This would help me out personally, because &quot;ah&quot; and &quot;awe&quot; are homophones to my ears, and distinguishing between .Ah/.Awe/.Ox is difficult.</li><li>Make a nice chart, ideally in HTML using codepoints in the Private Use Area, that shows all the letter combinations one might reasonably make in Quikscript. This is useful for testing kerning and alternate letterforms (does .Utter.Low actually get turned into .UtterAlt.Low?) Don&#39;t forget Senior Quikscript abbreviations like .Thaw.Ing for &quot;thing&quot;. (Part of) the hard part would be designing a layout that&#39;s nice and systematic.</li><li>Develop a pangram or three that uses every letter in the Quikscript alphabet. The closest I&#39;ve come was &quot;What is the price of a foot-bath kit? A goose in a dress near North Square thought it would cure jelly ankle. The goat nurse suggested palm oil in the mouth or wrapped around the ankle with a cloth.&quot; — which is still missing the following sounds: S, Z, tS, j, h, W. Oh, and it&#39;s too effing long to fit in my head. The checker I used I&#39;ve posted as&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"https://gist.github.com/adiabatic/5905628\">a gist on GitHub</a>&nbsp;— if there&#39;s demand, I could redo the thing in Javascript and put it out there on my website similar to the&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.frogorbits.com/qs/from-shavian/\">Shavian converter</a>. Again, none of this needs to be done as solitary work — having some back-and-forth with others, in public, on things like this&#39;d be nice.</li></ul><div><br></div></div><div>You could also start a blog in Quikscript, as I&#39;ve done. If you&#39;re having trouble getting it to work right, don&#39;t hesitate to ask on the list. Similarly, if you&#39;re having trouble getting Quikscript to work OK in whatever you&#39;re doing, ask on the list. Making QS less annoying to use on the computer will help adoption, but I don&#39;t know where the usual pain points are, especially for Windows users who aren&#39;t computer nerds.</div><div><br></div><div>Thank you for helping us help you help us all,</div><div><span class=\"ygrps-yiv-1546506678Apple-tab-span\" style=\"white-space:pre;\">\t</span>Nathan</div><div><br></div><br><blockquote><span title=\"qreply\"> <div><div>On Jul 1, 2013, at 12:23 PM, HeyMister &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:booth.g@...\">booth.g@...</a>&gt; wrote:</div><br><blockquote type=\"cite\"><div style=\"font-family:Helvetica;font-size:medium;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;line-height:normal;orphans:2;text-indent:0px;text-transform:none;white-space:normal;widows:2;word-spacing:0px;\"><div>And now I know why the group is dead. I&#39;m sure I&#39;m not the first person you&#39;ve helped.</div><div><br></div><div>Of course, you are right. It must be documented elsewhere, not that you&#39;d be able to find and post links to such comparative recordings, but no matter.</div><div><br></div><div>Better that there is no activity than wasted activity,eh? I&#39;ll concur.</div></div></blockquote></div><br></span></blockquote></html></div>",
  "specialLinks": [],
  "rawEmail": "Return-Path: &lt;bonusfrogs@...&gt;\r\nX-Sender: bonusfrogs@...\r\nX-Apparently-To: Read_Alphabet@yahoogroups.com\r\nX-Received: (qmail 26879 invoked from network); 2 Jul 2013 00:00:58 -0000\r\nX-Received: from unknown (98.137.63.212)\n  by m16.grp.sp2.yahoo.com with QMQP; 2 Jul 2013 00:00:58 -0000\r\nX-Received: from unknown (HELO mail-pd0-f175.google.com) (209.85.192.175)\n  by mtaq2.grp.sp2.yahoo.com with SMTP; 2 Jul 2013 00:00:58 -0000\r\nX-Received: by mail-pd0-f175.google.com with SMTP id 4so3043771pdd.6\n        for &lt;Read_Alphabet@yahoogroups.com&gt;; Mon, 01 Jul 2013 17:00:58 -0700 (PDT)\r\nX-Received: by 10.68.252.36 with SMTP id zp4mr26371246pbc.51.1372723257932;\n        Mon, 01 Jul 2013 17:00:57 -0700 (PDT)\r\nReturn-Path: &lt;bonusfrogs@...&gt;\r\nX-Received: from spreadthinly.localdomain (pool-74-100-97-239.lsanca.fios.verizon.net. [74.100.97.239])\n        by mx.google.com with ESMTPSA id z5sm24452968pbk.0.2013.07.01.17.00.56\n        for &lt;Read_Alphabet@yahoogroups.com&gt;\n        (version=TLSv1 cipher=ECDHE-RSA-RC4-SHA bits=128/128);\n        Mon, 01 Jul 2013 17:00:57 -0700 (PDT)\r\nContent-Type: multipart/alternative; boundary=&quot;Apple-Mail=_ED186433-75B8-471A-80DB-C124ADC04018&quot;\r\nMessage-Id: &lt;462E7D24-A23F-4DBE-B79D-131DC6D19DD5@...&gt;\r\nMime-Version: 1.0 (Mac OS X Mail 6.5 &#92;(1508&#92;))\r\nDate: Mon, 1 Jul 2013 17:00:56 -0700\r\nReferences: &lt;kqrj4i+nmqi@...&gt; &lt;917189B7-68DC-4D08-84FC-AE9AE0728D6F@...&gt; &lt;850158CD-5403-4DFC-830E-F00146F3F0BF@...&gt;\r\nTo: Read_Alphabet@yahoogroups.com\r\nIn-Reply-To: &lt;850158CD-5403-4DFC-830E-F00146F3F0BF@...&gt;\r\nX-Mailer: Apple Mail (2.1508)\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Nathan Sharfi &lt;bonusfrogs@...&gt;\r\nSubject: Injecting new life into the Quikscript community (was: Re: [Read_Alphabet] we need each other for this,)\r\nX-Yahoo-Group-Post: member; u=458641688; y=qwGO0j-7oW7B9OYqeG4znNDEtvEFSjo5-HRklSepmbfuxHzf\r\nX-Yahoo-Profile: dipartite\r\n\r\n\r\n--Apple-Mail=_ED186433-75B8-471A-80DB-C124ADC04018\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/plain;\n\tcharset=windows-1252\r\n\r\nFrom what I gather, I didn&#39;t convey tone in a way that would have been impo=\r\nssible to misunderstand =97 I was simply puzzled why someone would need our=\r\n voice samples as opposed to something that&#39;s a bit more nationally represe=\r\nntative. If you&#39;ve been following the posts John Cowan and I have been send=\r\ning back and forth, you&#39;d have noticed that our speech isn&#39;t necessarily re=\r\npresentative of where we&#39;re from/in, so sampling us would&#39;ve been of limite=\r\nd utility. Plus there&#39;re other things that require Quikscript expertise=85\n=\r\n\nIf you&#39;re looking to inject some life into the community, here&#39;re a few th=\r\nings that I&#39;d like to do, but haven&#39;t quite had the time/inclination for:\n\n=\r\nDesign a largely QWERTY-compatible keyboard layout for Quikscript that disu=\r\nnifies parentheses from angle parentheses, omits half-letters (use OpenType=\r\n substitution for that), and doesn&#39;t throw away any useful other punctuatio=\r\nn.\nHold a nice, public discussion on what can be safely thrown away on a Qu=\r\nikscript keyboard ought to be useful =97 King Kong&#39;s supported punctuation =\r\nis a strict superset of what&#39;s on a normal US keyboard, but this might not =\r\nbe strictly necessary =97 and I&#39;m kinda fuzzy on how AltGr is supposed to w=\r\nork on keyboards that have that key, anyway. At any rate, it&#39;d be nice to l=\r\nearn how AltGr works on Windows =97 I know that while it&#39;s conceptually sim=\r\nilar to the Option key on the Mac, I don&#39;t know if AltGr users have preexis=\r\nting expectations on what keys should do what. At any rate, there are quite=\r\n a few keyboard layouts already buried in the Files section of this group, =\r\nand =97 speaking as a keyboard-layout creator =97 get some feedback on what=\r\n one non-experimental layout I should focus most of my time on.\nTrack down =\r\nall the authors of all the Quikscript fonts that&#39;re out there and get them =\r\nto clarify their license terms =97 ideally, with an explicit public domain =\r\ndedication. The term &quot;freeware&quot; is ambiguous, and I&#39;d rather not allocate m=\r\ny time to playing in someone else&#39;s sandbox. As for Kingsley =97 tracking d=\r\nown &quot;tinyallen&quot; shouldn&#39;t be difficult since he&#39;s been active on the list o=\r\nver the past couple days, but I don&#39;t know about Messrs. Stephen Bartok and=\r\n Oliver Langan. At any rate, the copyright field says &quot;Typeface copyright H=\r\nigh-Logic. 1999, 2002. All Rights Reserved&quot;, but the license field says &quot;Th=\r\nis is a freeware font.&quot;. Since High-Logic is a company that makes font-maki=\r\nng software, I&#39;d suspect that it was inserted without the original author&#39;s=\r\n intent =97 but I&#39;m not sure. At any rate, getting them to publish their fo=\r\nnt sources =97 as a UFO, say =97 would be great.\nFigure out, collectively, =\r\na NATO alphabet for Quikscript (this echoes Tim Rice&#39;s call for better name=\r\ns). Ideally, all letters should start with the sound that they&#39;re for, not =\r\nbe anything that needs a name dot (i.e. no proper names), and be obvious to=\r\n everyone what each is even when shouted over a bad cell-phone connection w=\r\nith significant amounts of background noise. This doesn&#39;t need to be the wo=\r\nrk of one person; Google Spreadsheets sounds like the sort of thing that co=\r\nuld be used to collaborate on all this. This would help me out personally, =\r\nbecause &quot;ah&quot; and &quot;awe&quot; are homophones to my ears, and distinguishing betwee=\r\nn .Ah/.Awe/.Ox is difficult.\nMake a nice chart, ideally in HTML using codep=\r\noints in the Private Use Area, that shows all the letter combinations one m=\r\night reasonably make in Quikscript. This is useful for testing kerning and =\r\nalternate letterforms (does .Utter.Low actually get turned into .UtterAlt.L=\r\now?) Don&#39;t forget Senior Quikscript abbreviations like .Thaw.Ing for &quot;thing=\r\n&quot;. (Part of) the hard part would be designing a layout that&#39;s nice and syst=\r\nematic.\nDevelop a pangram or three that uses every letter in the Quikscript=\r\n alphabet. The closest I&#39;ve come was &quot;What is the price of a foot-bath kit?=\r\n A goose in a dress near North Square thought it would cure jelly ankle. Th=\r\ne goat nurse suggested palm oil in the mouth or wrapped around the ankle wi=\r\nth a cloth.&quot; =97 which is still missing the following sounds: S, Z, tS, j, =\r\nh, W. Oh, and it&#39;s too effing long to fit in my head. The checker I used I&#39;=\r\nve posted as a gist on GitHub =97 if there&#39;s demand, I could redo the thing=\r\n in Javascript and put it out there on my website similar to the Shavian co=\r\nnverter. Again, none of this needs to be done as solitary work =97 having s=\r\nome back-and-forth with others, in public, on things like this&#39;d be nice.\n\n=\r\nYou could also start a blog in Quikscript, as I&#39;ve done. If you&#39;re having t=\r\nrouble getting it to work right, don&#39;t hesitate to ask on the list. Similar=\r\nly, if you&#39;re having trouble getting Quikscript to work OK in whatever you&#39;=\r\nre doing, ask on the list. Making QS less annoying to use on the computer w=\r\nill help adoption, but I don&#39;t know where the usual pain points are, especi=\r\nally for Windows users who aren&#39;t computer nerds.\n\nThank you for helping us=\r\n help you help us all,\n\tNathan\n\n\nOn Jul 1, 2013, at 12:23 PM, HeyMister &lt;bo=\r\noth.g@...&gt; wrote:\n\n&gt; And now I know why the group is dead. I&#39;m sure I=\r\n&#39;m not the first person you&#39;ve helped.\n&gt; \n&gt; Of course, you are right. It mu=\r\nst be documented elsewhere, not that you&#39;d be able to find and post links t=\r\no such comparative recordings, but no matter.\n&gt; \n&gt; Better that there is no =\r\nactivity than wasted activity,eh? I&#39;ll concur.\n\n\r\n--Apple-Mail=_ED186433-75B8-471A-80DB-C124ADC04018\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/html;\n\tcharset=windows-1252\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;meta http-equiv=3D&quot;Content-Type&quot; content=3D&quot;text/html charset=\r\n=3Dwindows-1252&quot;&gt;&lt;base href=3D&quot;x-msg://7/&quot;&gt;&lt;/head&gt;&lt;body style=3D&quot;word-wrap:=\r\n break-word; -webkit-nbsp-mode: space; -webkit-line-break: after-white-spac=\r\ne; &quot;&gt;&lt;div&gt;From what I gather, I didn&#39;t convey tone in a way that would have=\r\n been impossible to misunderstand =97 I was simply puzzled why someone woul=\r\nd need &lt;b&gt;our&lt;/b&gt; voice samples as opposed to something that&#39;s a bit more n=\r\nationally representative. If you&#39;ve been following the posts John Cowan and=\r\n I have been sending back and forth, you&#39;d have noticed that our speech isn=\r\n&#39;t necessarily representative of where we&#39;re from/in, so sampling &lt;b&gt;us&lt;/b&gt;=\r\n would&#39;ve been of limited utility. Plus there&#39;re other things that require =\r\n&lt;b&gt;Quikscript&lt;/b&gt; expertise=85&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;If you&#39;re looking t=\r\no inject some life into the community, here&#39;re a few things that I&#39;d like t=\r\no do, but haven&#39;t quite had the time/inclination for:&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;=\r\ndiv&gt;&lt;ul class=3D&quot;MailOutline&quot;&gt;&lt;li&gt;Design a largely QWERTY-compatible keyboa=\r\nrd layout for Quikscript that disunifies parentheses from angle parentheses=\r\n, omits half-letters (use OpenType substitution for that), and doesn&#39;t thro=\r\nw away any useful other punctuation.&lt;/li&gt;&lt;li&gt;Hold a nice, public discussion=\r\n on what can be safely thrown away on a Quikscript keyboard ought to be use=\r\nful =97&nbsp;&lt;a href=3D&quot;https://github.com/adiabatic/king-kong&quot;&gt;King Kong&lt;/=\r\na&gt;&#39;s supported punctuation is a strict superset of what&#39;s on a normal US ke=\r\nyboard, but this might not be strictly necessary =97 and I&#39;m kinda fuzzy on=\r\n how AltGr is supposed to work on keyboards that have that key, anyway. At =\r\nany rate, it&#39;d be nice to learn how AltGr works on Windows =97 I know that =\r\nwhile it&#39;s conceptually similar to the Option key on the Mac, I don&#39;t know =\r\nif AltGr users have preexisting expectations on what keys should do what. A=\r\nt any rate, there are quite a few keyboard layouts already buried in the Fi=\r\nles section of this group, and =97 speaking as a keyboard-layout creator =\r\n=97 get some feedback on what one non-experimental layout I should focus mo=\r\nst of my time on.&lt;/li&gt;&lt;li&gt;Track down all the authors of all the Quikscript =\r\nfonts that&#39;re out there and get them to clarify their license terms =97 ide=\r\nally, with an explicit public domain dedication. The term &quot;freeware&quot;&nbsp;&lt;=\r\na href=3D&quot;http://www.gnu.org/philosophy/categories.html#freeware&quot;&gt;is ambigu=\r\nous&lt;/a&gt;, and I&#39;d rather not allocate my time to playing in someone else&#39;s s=\r\nandbox. As for Kingsley =97 tracking down &quot;tinyallen&quot; shouldn&#39;t be difficul=\r\nt since he&#39;s been active on the list over the past couple days, but I don&#39;t=\r\n know about Messrs. Stephen Bartok and Oliver Langan. At any rate, the copy=\r\nright field says &quot;Typeface copyright High-Logic. 1999, 2002. All Rights Res=\r\nerved&quot;, but the license field says &quot;This is a freeware font.&quot;. Since High-L=\r\nogic is a company that makes font-making software, I&#39;d suspect that it was =\r\ninserted without the original author&#39;s intent =97 but I&#39;m not sure. At any =\r\nrate, getting them to publish their font sources =97 as a&nbsp;&lt;a href=3D&quot;h=\r\nttp://unifiedfontobject.org/&quot;&gt;UFO&lt;/a&gt;, say =97 would be great.&lt;/li&gt;&lt;li&gt;Figu=\r\nre out, collectively, a&nbsp;&lt;a href=3D&quot;https://en.wikipedia.org/wiki/NATO_=\r\nphonetic_alphabet&quot;&gt;NATO alphabet&lt;/a&gt;&nbsp;for Quikscript (this echoes Tim R=\r\nice&#39;s call for better names). Ideally, all letters should start with the so=\r\nund that they&#39;re for, not be anything that needs a name dot (i.e. no proper=\r\n names), and be obvious to everyone what each is even when shouted over a b=\r\nad cell-phone connection with significant amounts of background noise. This=\r\n doesn&#39;t need to be the work of one person; Google Spreadsheets sounds like=\r\n the sort of thing that could be used to collaborate on all this. This woul=\r\nd help me out personally, because &quot;ah&quot; and &quot;awe&quot; are homophones to my ears,=\r\n and distinguishing between .Ah/.Awe/.Ox is difficult.&lt;/li&gt;&lt;li&gt;Make a nice =\r\nchart, ideally in HTML using codepoints in the Private Use Area, that shows=\r\n all the letter combinations one might reasonably make in Quikscript. This =\r\nis useful for testing kerning and alternate letterforms (does .Utter.Low ac=\r\ntually get turned into .UtterAlt.Low?) Don&#39;t forget Senior Quikscript abbre=\r\nviations like .Thaw.Ing for &quot;thing&quot;. (Part of) the hard part would be desig=\r\nning a layout that&#39;s nice and systematic.&lt;/li&gt;&lt;li&gt;Develop a pangram or thre=\r\ne that uses every letter in the Quikscript alphabet. The closest I&#39;ve come =\r\nwas &quot;What is the price of a foot-bath kit? A goose in a dress near North Sq=\r\nuare thought it would cure jelly ankle. The goat nurse suggested palm oil i=\r\nn the mouth or wrapped around the ankle with a cloth.&quot; =97 which is still m=\r\nissing the following sounds: S, Z, tS, j, h, W. Oh, and it&#39;s too effing lon=\r\ng to fit in my head. The checker I used I&#39;ve posted as&nbsp;&lt;a href=3D&quot;http=\r\ns://gist.github.com/adiabatic/5905628&quot;&gt;a gist on GitHub&lt;/a&gt;&nbsp;=97 if the=\r\nre&#39;s demand, I could redo the thing in Javascript and put it out there on m=\r\ny website similar to the&nbsp;&lt;a href=3D&quot;http://www.frogorbits.com/qs/from-=\r\nshavian/&quot;&gt;Shavian converter&lt;/a&gt;. Again, none of this needs to be done as so=\r\nlitary work =97 having some back-and-forth with others, in public, on thing=\r\ns like this&#39;d be nice.&lt;/li&gt;&lt;/ul&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;&lt;div&gt;You could also st=\r\nart a blog in Quikscript, as I&#39;ve done. If you&#39;re having trouble getting it=\r\n to work right, don&#39;t hesitate to ask on the list. Similarly, if you&#39;re hav=\r\ning trouble getting Quikscript to work OK in whatever you&#39;re doing, ask on =\r\nthe list. Making QS less annoying to use on the computer will help adoption=\r\n, but I don&#39;t know where the usual pain points are, especially for Windows =\r\nusers who aren&#39;t computer nerds.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Thank you for hel=\r\nping us help you help us all,&lt;/div&gt;&lt;div&gt;&lt;span class=3D&quot;Apple-tab-span&quot; styl=\r\ne=3D&quot;white-space:pre&quot;&gt;\t&lt;/span&gt;Nathan&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;br&gt;&lt;div&gt;&lt;div&gt;On J=\r\nul 1, 2013, at 12:23 PM, HeyMister &lt;&lt;a href=3D&quot;mailto:booth.g@...&quot;=\r\n&gt;booth.g@...&lt;/a&gt;&gt; wrote:&lt;/div&gt;&lt;br&gt;&lt;blockquote type=3D&quot;cite&quot;&gt;&lt;div d=\r\nir=3D&quot;auto&quot; style=3D&quot;font-family: Helvetica; font-size: medium; font-style:=\r\n normal; font-variant: normal; font-weight: normal; letter-spacing: normal;=\r\n line-height: normal; orphans: 2; text-align: -webkit-auto; text-indent: 0p=\r\nx; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px;=\r\n -webkit-text-size-adjust: auto; -webkit-text-stroke-width: 0px; &quot;&gt;&lt;div&gt;And=\r\n now I know why the group is dead. I&#39;m sure I&#39;m not the first person you&#39;ve=\r\n helped.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Of course, you are right. It must be docu=\r\nmented elsewhere, not that you&#39;d be able to find and post links to such com=\r\nparative recordings, but no matter.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Better that th=\r\nere is no activity than wasted activity,eh? I&#39;ll concur.&lt;/div&gt;&lt;/div&gt;&lt;/block=\r\nquote&gt;&lt;/div&gt;&lt;br&gt;&lt;/body&gt;&lt;/html&gt;\r\n--Apple-Mail=_ED186433-75B8-471A-80DB-C124ADC04018--\r\n\n"
}