{
  "userId": 473227320,
  "authorName": "HeyMister",
  "from": "HeyMister &lt;booth.g@...&gt;",
  "profile": "panecclesiastes",
  "replyTo": "LIST",
  "senderId": "zgrCg3m3tZRDUS1EqFKkHrv0F66XDYWWJK7yTj2ZRHtu3RsZ0K4OphAqp8K8Nf3Kubj_r0-3_4W2YOZrnBsvAssmdWI",
  "spamInfo": {
    "isSpam": false,
    "reason": "12"
  },
  "subject": "Re: Injecting new life into the Quikscript community",
  "postDate": "1372723704",
  "msgId": 2557,
  "canDelete": false,
  "contentTrasformed": false,
  "systemMessage": false,
  "headers": {
    "messageIdInHeader": "PDBFREVDRDBCLTQyNEYtNDhFOC1BRTc5LUI3NkJEN0Y2RDc1MkBnbWFpbC5jb20+",
    "inReplyToHeader": "PDQ2MkU3RDI0LUEyM0YtNERCRS1CNzlELTEzMURDNkQxOURENUBnbWFpbC5jb20+",
    "referencesHeader": "PGtxcmo0aStubXFpQGVHcm91cHMuY29tPiA8OTE3MTg5QjctNjhEQy00RDA4LTg0RkMtQUU5QUUwNzI4RDZGQGdtYWlsLmNvbT4gPDg1MDE1OENELTU0MDMtNERGQy04MzBFLUYwMDE0NkYzRjBCRkBnbWFpbC5jb20+IDw0NjJFN0QyNC1BMjNGLTREQkUtQjc5RC0xMzFEQzZEMTlERDVAZ21haWwuY29tPg=="
  },
  "prevInTopic": 2556,
  "nextInTopic": 2558,
  "prevInTime": 2556,
  "nextInTime": 2558,
  "topicId": 2552,
  "numMessagesInTopic": 6,
  "msgSnippet": "I think you ve conveyed this in a way that is impossible to misunderstand. I am not yours to command, and you have confirmed what I read the first time: No",
  "messageBody": "<div id=\"ygrps-yiv-918316021\"><html><head></head>I think you&#39;ve conveyed this in a way that is impossible to misunderstand.<div><br></div><div>I am not yours to command, and you have confirmed what I read the first time:</div><div><br></div><div>No activity is better than a wasted activity, eh?</div><div><br></div><div>I&#39;ll concur.</div><div><br></div><div><br><blockquote><span title=\"qreply\"> </span></blockquote></div><div><div><div>On Jul 1, 2013, at 7:00 PM, Nathan Sharfi &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bonusfrogs@...\">bonusfrogs@...</a>&gt; wrote:</div><br class=\"ygrps-yiv-918316021Apple-interchange-newline\"><blockquote type=\"cite\">\n\n\n\n\n\n\n\n\n\n\n\n\n\n<div style=\"background-color:#fff;\">\n<span style=\"display:none;\">&nbsp;</span>\n\n\n\n    <div id=\"ygrps-yiv-918316021ygrp-text\"><div><br class=\"ygrps-yiv-918316021webkit-block-placeholder\"></div><div>From what I gather, I didn&#39;t convey tone in a way that would have been impossible to misunderstand — I was simply puzzled why someone would need <b>our</b> voice samples as opposed to something that&#39;s a bit more nationally representative. If you&#39;ve been following the posts John Cowan and I have been sending back and forth, you&#39;d have noticed that our speech isn&#39;t necessarily representative of where we&#39;re from/in, so sampling <b>us</b> would&#39;ve been of limited utility. Plus there&#39;re other things that require <b>Quikscript</b> expertise…</div><div><br></div><div>If you&#39;re looking to inject some life into the community, here&#39;re a few things that I&#39;d like to do, but haven&#39;t quite had the time/inclination for:</div><div><br></div><div><ul class=\"ygrps-yiv-918316021MailOutline\"><li>Design a largely QWERTY-compatible keyboard layout for Quikscript that disunifies parentheses from angle parentheses, omits half-letters (use OpenType substitution for that), and doesn&#39;t throw away any useful other punctuation.</li><li>Hold a nice, public discussion on what can be safely thrown away on a Quikscript keyboard ought to be useful —&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"https://github.com/adiabatic/king-kong\">King Kong</a>&#39;s supported punctuation is a strict superset of what&#39;s on a normal US keyboard, but this might not be strictly necessary — and I&#39;m kinda fuzzy on how AltGr is supposed to work on keyboards that have that key, anyway. At any rate, it&#39;d be nice to learn how AltGr works on Windows — I know that while it&#39;s conceptually similar to the Option key on the Mac, I don&#39;t know if AltGr users have preexisting expectations on what keys should do what. At any rate, there are quite a few keyboard layouts already buried in the Files section of this group, and — speaking as a keyboard-layout creator — get some feedback on what one non-experimental layout I should focus most of my time on.</li><li>Track down all the authors of all the Quikscript fonts that&#39;re out there and get them to clarify their license terms — ideally, with an explicit public domain dedication. The term &quot;freeware&quot;&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gnu.org/philosophy/categories.html#freeware\">is ambiguous</a>, and I&#39;d rather not allocate my time to playing in someone else&#39;s sandbox. As for Kingsley — tracking down &quot;tinyallen&quot; shouldn&#39;t be difficult since he&#39;s been active on the list over the past couple days, but I don&#39;t know about Messrs. Stephen Bartok and Oliver Langan. At any rate, the copyright field says &quot;Typeface copyright High-Logic. 1999, 2002. All Rights Reserved&quot;, but the license field says &quot;This is a freeware font.&quot;. Since High-Logic is a company that makes font-making software, I&#39;d suspect that it was inserted without the original author&#39;s intent — but I&#39;m not sure. At any rate, getting them to publish their font sources — as a&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"http://unifiedfontobject.org/\">UFO</a>, say — would be great.</li><li>Figure out, collectively, a&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"https://en.wikipedia.org/wiki/NATO_phonetic_alphabet\">NATO alphabet</a>&nbsp;for Quikscript (this echoes Tim Rice&#39;s call for better names). Ideally, all letters should start with the sound that they&#39;re for, not be anything that needs a name dot (i.e. no proper names), and be obvious to everyone what each is even when shouted over a bad cell-phone connection with significant amounts of background noise. This doesn&#39;t need to be the work of one person; Google Spreadsheets sounds like the sort of thing that could be used to collaborate on all this. This would help me out personally, because &quot;ah&quot; and &quot;awe&quot; are homophones to my ears, and distinguishing between .Ah/.Awe/.Ox is difficult.</li><li>Make a nice chart, ideally in HTML using codepoints in the Private Use Area, that shows all the letter combinations one might reasonably make in Quikscript. This is useful for testing kerning and alternate letterforms (does .Utter.Low actually get turned into .UtterAlt.Low?) Don&#39;t forget Senior Quikscript abbreviations like .Thaw.Ing for &quot;thing&quot;. (Part of) the hard part would be designing a layout that&#39;s nice and systematic.</li><li>Develop a pangram or three that uses every letter in the Quikscript alphabet. The closest I&#39;ve come was &quot;What is the price of a foot-bath kit? A goose in a dress near North Square thought it would cure jelly ankle. The goat nurse suggested palm oil in the mouth or wrapped around the ankle with a cloth.&quot; — which is still missing the following sounds: S, Z, tS, j, h, W. Oh, and it&#39;s too effing long to fit in my head. The checker I used I&#39;ve posted as&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"https://gist.github.com/adiabatic/5905628\">a gist on GitHub</a>&nbsp;— if there&#39;s demand, I could redo the thing in Javascript and put it out there on my website similar to the&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.frogorbits.com/qs/from-shavian/\">Shavian converter</a>. Again, none of this needs to be done as solitary work — having some back-and-forth with others, in public, on things like this&#39;d be nice.</li></ul><div><br></div></div><div>You could also start a blog in Quikscript, as I&#39;ve done. If you&#39;re having trouble getting it to work right, don&#39;t hesitate to ask on the list. Similarly, if you&#39;re having trouble getting Quikscript to work OK in whatever you&#39;re doing, ask on the list. Making QS less annoying to use on the computer will help adoption, but I don&#39;t know where the usual pain points are, especially for Windows users who aren&#39;t computer nerds.</div><div><br></div><div>Thank you for helping us help you help us all,</div><div><span class=\"ygrps-yiv-918316021Apple-tab-span\" style=\"white-space:pre;\">\t</span>Nathan</div><div><br></div><br><div><div>On Jul 1, 2013, at 12:23 PM, HeyMister &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:booth.g@...\">booth.g@...</a>&gt; wrote:</div><br><blockquote type=\"cite\"><div style=\"font-family:Helvetica;font-size:medium;font-style:normal;font-variant:normal;font-weight:normal;letter-spacing:normal;text-indent:0px;text-transform:none;white-space:normal;word-spacing:0px;\"><div>And now I know why the group is dead. I&#39;m sure I&#39;m not the first person you&#39;ve helped.</div><div><br></div><div>Of course, you are right. It must be documented elsewhere, not that you&#39;d be able to find and post links to such comparative recordings, but no matter.</div><div><br></div><div>Better that there is no activity than wasted activity,eh? I&#39;ll concur.</div></div></blockquote></div><br><div><br class=\"ygrps-yiv-918316021webkit-block-placeholder\"></div>\n\n    </div>\n     \n\n    \n\n</div>\n\n\n\n\n\n</blockquote></div><br></div></html></div>",
  "specialLinks": [],
  "rawEmail": "Return-Path: &lt;booth.g@...&gt;\r\nX-Sender: booth.g@...\r\nX-Apparently-To: Read_Alphabet@yahoogroups.com\r\nX-Received: (qmail 80813 invoked from network); 2 Jul 2013 00:08:26 -0000\r\nX-Received: from unknown (98.137.63.212)\n  by m1.grp.sp2.yahoo.com with QMQP; 2 Jul 2013 00:08:26 -0000\r\nX-Received: from unknown (HELO mail-yh0-f53.google.com) (209.85.213.53)\n  by mtaq2.grp.sp2.yahoo.com with SMTP; 2 Jul 2013 00:08:26 -0000\r\nX-Received: by mail-yh0-f53.google.com with SMTP id a41so2814143yho.26\n        for &lt;Read_Alphabet@yahoogroups.com&gt;; Mon, 01 Jul 2013 17:08:25 -0700 (PDT)\r\nX-Received: by 10.236.192.225 with SMTP id i61mr13597373yhn.13.1372723705836;\n        Mon, 01 Jul 2013 17:08:25 -0700 (PDT)\r\nReturn-Path: &lt;booth.g@...&gt;\r\nX-Received: from 174-126-97-250.cpe.cableone.net (174-126-97-250.cpe.cableone.net. [174.126.97.250])\n        by mx.google.com with ESMTPSA id d91sm36563843yhq.16.2013.07.01.17.08.24\n        for &lt;Read_Alphabet@yahoogroups.com&gt;\n        (version=TLSv1 cipher=ECDHE-RSA-RC4-SHA bits=128/128);\n        Mon, 01 Jul 2013 17:08:25 -0700 (PDT)\r\nContent-Type: multipart/alternative; boundary=&quot;Apple-Mail=_298C9576-D03E-4363-A091-9067D2FD576B&quot;\r\nMessage-Id: &lt;0EDECD0B-424F-48E8-AE79-B76BD7F6D752@...&gt;\r\nMime-Version: 1.0 (Mac OS X Mail 6.5 &#92;(1508&#92;))\r\nDate: Mon, 1 Jul 2013 19:08:24 -0500\r\nReferences: &lt;kqrj4i+nmqi@...&gt; &lt;917189B7-68DC-4D08-84FC-AE9AE0728D6F@...&gt; &lt;850158CD-5403-4DFC-830E-F00146F3F0BF@...&gt; &lt;462E7D24-A23F-4DBE-B79D-131DC6D19DD5@...&gt;\r\nTo: Read_Alphabet@yahoogroups.com\r\nIn-Reply-To: &lt;462E7D24-A23F-4DBE-B79D-131DC6D19DD5@...&gt;\r\nX-Mailer: Apple Mail (2.1508)\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: HeyMister &lt;booth.g@...&gt;\r\nSubject: Re: Injecting new life into the Quikscript community\r\nX-Yahoo-Group-Post: member; u=473227320; y=a0Ah8QosWEMwCuvwphEWEZ0K331WO8zjHReXuQ5jTxiaGsg_fbDfTElN\r\nX-Yahoo-Profile: panecclesiastes\r\n\r\n\r\n--Apple-Mail=_298C9576-D03E-4363-A091-9067D2FD576B\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/plain;\n\tcharset=windows-1252\r\n\r\nI think you&#39;ve conveyed this in a way that is impossible to misunderstand.\n=\r\n\nI am not yours to command, and you have confirmed what I read the first ti=\r\nme:\n\nNo activity is better than a wasted activity, eh?\n\nI&#39;ll concur.\n\n\nOn J=\r\nul 1, 2013, at 7:00 PM, Nathan Sharfi &lt;bonusfrogs@...&gt; wrote:\n\n&gt; \n&gt; F=\r\nrom what I gather, I didn&#39;t convey tone in a way that would have been impos=\r\nsible to misunderstand =97 I was simply puzzled why someone would need our =\r\nvoice samples as opposed to something that&#39;s a bit more nationally represen=\r\ntative. If you&#39;ve been following the posts John Cowan and I have been sendi=\r\nng back and forth, you&#39;d have noticed that our speech isn&#39;t necessarily rep=\r\nresentative of where we&#39;re from/in, so sampling us would&#39;ve been of limited=\r\n utility. Plus there&#39;re other things that require Quikscript expertise=85\n&gt;=\r\n \n&gt; If you&#39;re looking to inject some life into the community, here&#39;re a few=\r\n things that I&#39;d like to do, but haven&#39;t quite had the time/inclination for=\r\n:\n&gt; \n&gt; Design a largely QWERTY-compatible keyboard layout for Quikscript th=\r\nat disunifies parentheses from angle parentheses, omits half-letters (use O=\r\npenType substitution for that), and doesn&#39;t throw away any useful other pun=\r\nctuation.\n&gt; Hold a nice, public discussion on what can be safely thrown awa=\r\ny on a Quikscript keyboard ought to be useful =97 King Kong&#39;s supported pun=\r\nctuation is a strict superset of what&#39;s on a normal US keyboard, but this m=\r\night not be strictly necessary =97 and I&#39;m kinda fuzzy on how AltGr is supp=\r\nosed to work on keyboards that have that key, anyway. At any rate, it&#39;d be =\r\nnice to learn how AltGr works on Windows =97 I know that while it&#39;s concept=\r\nually similar to the Option key on the Mac, I don&#39;t know if AltGr users hav=\r\ne preexisting expectations on what keys should do what. At any rate, there =\r\nare quite a few keyboard layouts already buried in the Files section of thi=\r\ns group, and =97 speaking as a keyboard-layout creator =97 get some feedbac=\r\nk on what one non-experimental layout I should focus most of my time on.\n&gt; =\r\nTrack down all the authors of all the Quikscript fonts that&#39;re out there an=\r\nd get them to clarify their license terms =97 ideally, with an explicit pub=\r\nlic domain dedication. The term &quot;freeware&quot; is ambiguous, and I&#39;d rather not=\r\n allocate my time to playing in someone else&#39;s sandbox. As for Kingsley =97=\r\n tracking down &quot;tinyallen&quot; shouldn&#39;t be difficult since he&#39;s been active on=\r\n the list over the past couple days, but I don&#39;t know about Messrs. Stephen=\r\n Bartok and Oliver Langan. At any rate, the copyright field says &quot;Typeface =\r\ncopyright High-Logic. 1999, 2002. All Rights Reserved&quot;, but the license fie=\r\nld says &quot;This is a freeware font.&quot;. Since High-Logic is a company that make=\r\ns font-making software, I&#39;d suspect that it was inserted without the origin=\r\nal author&#39;s intent =97 but I&#39;m not sure. At any rate, getting them to publi=\r\nsh their font sources =97 as a UFO, say =97 would be great.\n&gt; Figure out, c=\r\nollectively, a NATO alphabet for Quikscript (this echoes Tim Rice&#39;s call fo=\r\nr better names). Ideally, all letters should start with the sound that they=\r\n&#39;re for, not be anything that needs a name dot (i.e. no proper names), and =\r\nbe obvious to everyone what each is even when shouted over a bad cell-phone=\r\n connection with significant amounts of background noise. This doesn&#39;t need=\r\n to be the work of one person; Google Spreadsheets sounds like the sort of =\r\nthing that could be used to collaborate on all this. This would help me out=\r\n personally, because &quot;ah&quot; and &quot;awe&quot; are homophones to my ears, and distingu=\r\nishing between .Ah/.Awe/.Ox is difficult.\n&gt; Make a nice chart, ideally in H=\r\nTML using codepoints in the Private Use Area, that shows all the letter com=\r\nbinations one might reasonably make in Quikscript. This is useful for testi=\r\nng kerning and alternate letterforms (does .Utter.Low actually get turned i=\r\nnto .UtterAlt.Low?) Don&#39;t forget Senior Quikscript abbreviations like .Thaw=\r\n.Ing for &quot;thing&quot;. (Part of) the hard part would be designing a layout that&#39;=\r\ns nice and systematic.\n&gt; Develop a pangram or three that uses every letter =\r\nin the Quikscript alphabet. The closest I&#39;ve come was &quot;What is the price of=\r\n a foot-bath kit? A goose in a dress near North Square thought it would cur=\r\ne jelly ankle. The goat nurse suggested palm oil in the mouth or wrapped ar=\r\nound the ankle with a cloth.&quot; =97 which is still missing the following soun=\r\nds: S, Z, tS, j, h, W. Oh, and it&#39;s too effing long to fit in my head. The =\r\nchecker I used I&#39;ve posted as a gist on GitHub =97 if there&#39;s demand, I cou=\r\nld redo the thing in Javascript and put it out there on my website similar =\r\nto the Shavian converter. Again, none of this needs to be done as solitary =\r\nwork =97 having some back-and-forth with others, in public, on things like =\r\nthis&#39;d be nice.\n&gt; \n&gt; You could also start a blog in Quikscript, as I&#39;ve don=\r\ne. If you&#39;re having trouble getting it to work right, don&#39;t hesitate to ask=\r\n on the list. Similarly, if you&#39;re having trouble getting Quikscript to wor=\r\nk OK in whatever you&#39;re doing, ask on the list. Making QS less annoying to =\r\nuse on the computer will help adoption, but I don&#39;t know where the usual pa=\r\nin points are, especially for Windows users who aren&#39;t computer nerds.\n&gt; \n&gt;=\r\n Thank you for helping us help you help us all,\n&gt; \tNathan\n&gt; \n&gt; \n&gt; On Jul 1,=\r\n 2013, at 12:23 PM, HeyMister &lt;booth.g@...&gt; wrote:\n&gt; \n&gt;&gt; And now I kn=\r\now why the group is dead. I&#39;m sure I&#39;m not the first person you&#39;ve helped.\n=\r\n&gt;&gt; \n&gt;&gt; Of course, you are right. It must be documented elsewhere, not that =\r\nyou&#39;d be able to find and post links to such comparative recordings, but no=\r\n matter.\n&gt;&gt; \n&gt;&gt; Better that there is no activity than wasted activity,eh? I=\r\n&#39;ll concur.\n&gt; \n&gt; \n&gt; \n\n\r\n--Apple-Mail=_298C9576-D03E-4363-A091-9067D2FD576B\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/html;\n\tcharset=windows-1252\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;meta http-equiv=3D&quot;Content-Type&quot; content=3D&quot;text/html charset=\r\n=3Dwindows-1252&quot;&gt;&lt;/head&gt;&lt;body style=3D&quot;word-wrap: break-word; -webkit-nbsp-=\r\nmode: space; -webkit-line-break: after-white-space; &quot;&gt;I think you&#39;ve convey=\r\ned this in a way that is impossible to misunderstand.&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;I =\r\nam not yours to command, and you have confirmed what I read the first time:=\r\n&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;No activity is better than a wasted activity, eh?=\r\n&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;I&#39;ll concur.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;=\r\ndiv&gt;&lt;div&gt;&lt;div&gt;On Jul 1, 2013, at 7:00 PM, Nathan Sharfi &lt;&lt;a href=3D&quot;mail=\r\nto:bonusfrogs@...&quot;&gt;bonusfrogs@...&lt;/a&gt;&gt; wrote:&lt;/div&gt;&lt;br class=\r\n=3D&quot;Apple-interchange-newline&quot;&gt;&lt;blockquote type=3D&quot;cite&quot;&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n\n&lt;div=\r\n style=3D&quot;background-color: #fff;&quot;&gt;\n&lt;span style=3D&quot;display:none&quot;&gt;&nbsp;&lt;/sp=\r\nan&gt;\n\n\n\n    &lt;div id=3D&quot;ygrp-text&quot;&gt;&lt;div&gt;&lt;br class=3D&quot;webkit-block-placeholder=\r\n&quot;&gt;&lt;/div&gt;&lt;div&gt;From what I gather, I didn&#39;t convey tone in a way that would h=\r\nave been impossible to misunderstand =97 I was simply puzzled why someone w=\r\nould need &lt;b&gt;our&lt;/b&gt; voice samples as opposed to something that&#39;s a bit mor=\r\ne nationally representative. If you&#39;ve been following the posts John Cowan =\r\nand I have been sending back and forth, you&#39;d have noticed that our speech =\r\nisn&#39;t necessarily representative of where we&#39;re from/in, so sampling &lt;b&gt;us&lt;=\r\n/b&gt; would&#39;ve been of limited utility. Plus there&#39;re other things that requi=\r\nre &lt;b&gt;Quikscript&lt;/b&gt; expertise=85&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;If you&#39;re lookin=\r\ng to inject some life into the community, here&#39;re a few things that I&#39;d lik=\r\ne to do, but haven&#39;t quite had the time/inclination for:&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/di=\r\nv&gt;&lt;div&gt;&lt;ul class=3D&quot;MailOutline&quot;&gt;&lt;li&gt;Design a largely QWERTY-compatible key=\r\nboard layout for Quikscript that disunifies parentheses from angle parenthe=\r\nses, omits half-letters (use OpenType substitution for that), and doesn&#39;t t=\r\nhrow away any useful other punctuation.&lt;/li&gt;&lt;li&gt;Hold a nice, public discuss=\r\nion on what can be safely thrown away on a Quikscript keyboard ought to be =\r\nuseful =97&nbsp;&lt;a href=3D&quot;https://github.com/adiabatic/king-kong&quot;&gt;King Kon=\r\ng&lt;/a&gt;&#39;s supported punctuation is a strict superset of what&#39;s on a normal US=\r\n keyboard, but this might not be strictly necessary =97 and I&#39;m kinda fuzzy=\r\n on how AltGr is supposed to work on keyboards that have that key, anyway. =\r\nAt any rate, it&#39;d be nice to learn how AltGr works on Windows =97 I know th=\r\nat while it&#39;s conceptually similar to the Option key on the Mac, I don&#39;t kn=\r\now if AltGr users have preexisting expectations on what keys should do what=\r\n. At any rate, there are quite a few keyboard layouts already buried in the=\r\n Files section of this group, and =97 speaking as a keyboard-layout creator=\r\n =97 get some feedback on what one non-experimental layout I should focus m=\r\nost of my time on.&lt;/li&gt;&lt;li&gt;Track down all the authors of all the Quikscript=\r\n fonts that&#39;re out there and get them to clarify their license terms =97 id=\r\neally, with an explicit public domain dedication. The term &quot;freeware&quot;&nbsp;=\r\n&lt;a href=3D&quot;http://www.gnu.org/philosophy/categories.html#freeware&quot;&gt;is ambig=\r\nuous&lt;/a&gt;, and I&#39;d rather not allocate my time to playing in someone else&#39;s =\r\nsandbox. As for Kingsley =97 tracking down &quot;tinyallen&quot; shouldn&#39;t be difficu=\r\nlt since he&#39;s been active on the list over the past couple days, but I don&#39;=\r\nt know about Messrs. Stephen Bartok and Oliver Langan. At any rate, the cop=\r\nyright field says &quot;Typeface copyright High-Logic. 1999, 2002. All Rights Re=\r\nserved&quot;, but the license field says &quot;This is a freeware font.&quot;. Since High-=\r\nLogic is a company that makes font-making software, I&#39;d suspect that it was=\r\n inserted without the original author&#39;s intent =97 but I&#39;m not sure. At any=\r\n rate, getting them to publish their font sources =97 as a&nbsp;&lt;a href=3D&quot;=\r\nhttp://unifiedfontobject.org/&quot;&gt;UFO&lt;/a&gt;, say =97 would be great.&lt;/li&gt;&lt;li&gt;Fig=\r\nure out, collectively, a&nbsp;&lt;a href=3D&quot;https://en.wikipedia.org/wiki/NATO=\r\n_phonetic_alphabet&quot;&gt;NATO alphabet&lt;/a&gt;&nbsp;for Quikscript (this echoes Tim =\r\nRice&#39;s call for better names). Ideally, all letters should start with the s=\r\nound that they&#39;re for, not be anything that needs a name dot (i.e. no prope=\r\nr names), and be obvious to everyone what each is even when shouted over a =\r\nbad cell-phone connection with significant amounts of background noise. Thi=\r\ns doesn&#39;t need to be the work of one person; Google Spreadsheets sounds lik=\r\ne the sort of thing that could be used to collaborate on all this. This wou=\r\nld help me out personally, because &quot;ah&quot; and &quot;awe&quot; are homophones to my ears=\r\n, and distinguishing between .Ah/.Awe/.Ox is difficult.&lt;/li&gt;&lt;li&gt;Make a nice=\r\n chart, ideally in HTML using codepoints in the Private Use Area, that show=\r\ns all the letter combinations one might reasonably make in Quikscript. This=\r\n is useful for testing kerning and alternate letterforms (does .Utter.Low a=\r\nctually get turned into .UtterAlt.Low?) Don&#39;t forget Senior Quikscript abbr=\r\neviations like .Thaw.Ing for &quot;thing&quot;. (Part of) the hard part would be desi=\r\ngning a layout that&#39;s nice and systematic.&lt;/li&gt;&lt;li&gt;Develop a pangram or thr=\r\nee that uses every letter in the Quikscript alphabet. The closest I&#39;ve come=\r\n was &quot;What is the price of a foot-bath kit? A goose in a dress near North S=\r\nquare thought it would cure jelly ankle. The goat nurse suggested palm oil =\r\nin the mouth or wrapped around the ankle with a cloth.&quot; =97 which is still =\r\nmissing the following sounds: S, Z, tS, j, h, W. Oh, and it&#39;s too effing lo=\r\nng to fit in my head. The checker I used I&#39;ve posted as&nbsp;&lt;a href=3D&quot;htt=\r\nps://gist.github.com/adiabatic/5905628&quot;&gt;a gist on GitHub&lt;/a&gt;&nbsp;=97 if th=\r\nere&#39;s demand, I could redo the thing in Javascript and put it out there on =\r\nmy website similar to the&nbsp;&lt;a href=3D&quot;http://www.frogorbits.com/qs/from=\r\n-shavian/&quot;&gt;Shavian converter&lt;/a&gt;. Again, none of this needs to be done as s=\r\nolitary work =97 having some back-and-forth with others, in public, on thin=\r\ngs like this&#39;d be nice.&lt;/li&gt;&lt;/ul&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;&lt;div&gt;You could also s=\r\ntart a blog in Quikscript, as I&#39;ve done. If you&#39;re having trouble getting i=\r\nt to work right, don&#39;t hesitate to ask on the list. Similarly, if you&#39;re ha=\r\nving trouble getting Quikscript to work OK in whatever you&#39;re doing, ask on=\r\n the list. Making QS less annoying to use on the computer will help adoptio=\r\nn, but I don&#39;t know where the usual pain points are, especially for Windows=\r\n users who aren&#39;t computer nerds.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Thank you for he=\r\nlping us help you help us all,&lt;/div&gt;&lt;div&gt;&lt;span class=3D&quot;Apple-tab-span&quot; sty=\r\nle=3D&quot;white-space:pre;&quot;&gt;\t&lt;/span&gt;Nathan&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;br&gt;&lt;div&gt;&lt;div&gt;On=\r\n Jul 1, 2013, at 12:23 PM, HeyMister &lt;&lt;a href=3D&quot;mailto:booth.g@...=\r\nm&quot;&gt;booth.g@...&lt;/a&gt;&gt; wrote:&lt;/div&gt;&lt;br&gt;&lt;blockquote type=3D&quot;cite&quot;&gt;&lt;div=\r\n dir=3D&quot;auto&quot; style=3D&quot;font-family: Helvetica;font-size: medium;font-style:=\r\n normal;font-variant: normal;font-weight: normal;letter-spacing: normal;tex=\r\nt-indent: 0px;text-transform: none;white-space: normal;word-spacing: 0px;&quot;&gt;=\r\n&lt;div&gt;And now I know why the group is dead. I&#39;m sure I&#39;m not the first perso=\r\nn you&#39;ve helped.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Of course, you are right. It must=\r\n be documented elsewhere, not that you&#39;d be able to find and post links to =\r\nsuch comparative recordings, but no matter.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Better=\r\n that there is no activity than wasted activity,eh? I&#39;ll concur.&lt;/div&gt;&lt;/div=\r\n&gt;&lt;/blockquote&gt;&lt;/div&gt;&lt;br&gt;&lt;div&gt;&lt;br class=3D&quot;webkit-block-placeholder&quot;&gt;&lt;/div&gt;\n=\r\n\n    &lt;/div&gt;\n     \n\n    \n\n&lt;/div&gt;\n\n\n\n&lt;!-- end group email --&gt;\n\n&lt;/blockquote&gt;&lt;=\r\n/div&gt;&lt;br&gt;&lt;/div&gt;&lt;/body&gt;&lt;/html&gt;\r\n--Apple-Mail=_298C9576-D03E-4363-A091-9067D2FD576B--\r\n\n"
}