{
  "userId": 0,
  "authorName": "Paige Gabhart",
  "from": "Paige Gabhart &lt;pgabhart@...&gt;",
  "replyTo": "LIST",
  "senderId": "nR6XmE7tOQQY77OeucuzD9f5pBACKeyFOAe4SCYUnYQf3PG16zktEa934patIk2ZYZXj6_UU-ve3ug7gT7ZOTlSMUt05uvgklWAQHA",
  "spamInfo": {
    "isSpam": false,
    "reason": "0"
  },
  "subject": "Re: [Read_Alphabet] Re: Shaws Script and Esperanto  and Penpal",
  "postDate": "982520912",
  "msgId": 37,
  "canDelete": false,
  "contentTrasformed": false,
  "systemMessage": false,
  "headers": {
    "messageIdInHeader": "PDUuMC4yLjEuMC4yMDAxMDIxODEyMTYwMi4wMDllZTA0MEBwZ2FiaGFydEBtYWlsLmNvcmVjb21tLm5ldD4=",
    "inReplyToHeader": "PDk2bXF0Mys3c3Y5QGVHcm91cHMuY29tPg==",
    "referencesHeader": "PExQQkJLSkZPR05GTkpLSUJES0dOR0VHR0NCQUEuc29zb3N0cmlzQGJkZy5jZW50cmluLm5ldC5pZD4="
  },
  "prevInTopic": 36,
  "nextInTopic": 38,
  "prevInTime": 36,
  "nextInTime": 38,
  "topicId": 27,
  "numMessagesInTopic": 9,
  "msgSnippet": "Sid: Good to hear from you.  You wrote me a letter in quikscript several months, and I have been a poor correspondent, in that I have not found time to write",
  "messageBody": "<div id=\"ygrps-yiv-676705231\"><html>\nSid:<br>\n<br>\nGood to hear from you.&nbsp; You wrote me a letter in quikscript several\nmonths, and I have been a poor correspondent, in that I have not found\ntime to write back.&nbsp; I will correct that as soon as I can.&nbsp; I\nalso received a quikscript letter from Jon Zuck so I will try to write\nboth of you back at the same time.<br>\n<br>\nAt 09:36 PM 2/17/01 +0000, you wrote:<br>\n<blockquote><span title=\"qreply\"> <blockquote type=\"cite\" class=\"ygrps-yiv-676705231cite\" cite><tt>Many years ago I&nbsp; taught\nthe Shaw&#39;s alphabet to Japanese English students. The response was rather\nnegative since most of them already knew the international phonetic\nalphabet.&nbsp; </tt></blockquote><br>\nI would suggest this was an unusal situation.&nbsp; Your students already\nhad a tool sufficient for their purposes (IPA) so it does not surprise me\nthey expressed the very human reluctance to learning something they\nundoubtedly viewed as superfluous.&nbsp; However, I would not anticipate\nthat most foreign students interested in learning English would already\nknow the IPA so your experience, I posit, is not typical of the majority\nof foreign students.<br>\n<br>\n<blockquote type=\"cite\" class=\"ygrps-yiv-676705231cite\" cite><tt>&nbsp;Due to the amount of time\nnecessary to learn Shaw, I don&#39;t think it is suitable for learning a\nlanguage.&nbsp; A mild reform of the international phonetic script would\nprobably be more easier for foreign students.</tt></blockquote><br>\nI think the preceding has as an underlying assumption that the roman\nalphabet is more widely known than it really is.&nbsp; I cannot believe\nthe symbols used in quikscript are more difficult to learn than the roman\nalphabet.&nbsp; First, there is no lower and upper case to be bothered\nwith.&nbsp; Secondly, the symbols are actually simpler than the roman\nalphabet.&nbsp; That alphabet, however, is so ubiquitous in the western\nworld that those of us who use it do so constantly, with the result that\nwe are probably poor judges in gauging its ease of learning.&nbsp;&nbsp;\nIf we take the world as a whole, including Asia, India and the middle\neast, obviously significant portions of mankind use alphabets with\nabsolutely no relationship (or a very distant relationship) to the roman\nalphabet.&nbsp; Those people would have to learn a new alphabet in any\nevent.&nbsp; Why shouldn&#39;t they learn an alphabet that effectively deals\nwith the phonemes of English, even if, at this time, it were just to be\nconsidered a teaching alphabet.&nbsp; I suspect many immigrants to the\nU.S. become more or less fluent in English by learning English from the\nspeech of those around them.&nbsp; I think it is common that many of\nthese people make little progress in learning to read and write English,\nand the blame for that can be laid at the door of the roman\nalphabet.&nbsp; I recently had a client from Mexico, who has been in the\nU.S. for about twelve years.&nbsp; His English is strongly accented, but\nunderstandable.&nbsp; However, the man has absolutely no confidence he\ncan spell anything &quot;correctly&quot; in English.<br>\n<br>\n<blockquote type=\"cite\" class=\"ygrps-yiv-676705231cite\" cite><tt>Someone mentioned\nEsperanto.&nbsp; I am fluent in that language.&nbsp; The reason it is not\naccepted is that nationalists feel it a threat to their own\nlanguage.</tt></blockquote><br>\nI won&#39;t disagree with that.&nbsp; However, I would also suggest that it\nsuffers from the same bootstrap problem that Shavian or Quikscript\nsuffers from.&nbsp; When I studied Esperanto myself, its logic and\nsimplicity appealed to me.&nbsp; After awhile I found myself thinking\nthat if and when I became fluent in it, I would be able to speak to,\nperhaps, a million or two million (maybe even the ten million its\nadherents claim) people in the world.&nbsp; But if I learn Spanish, for\nexample, most of South America is opened to me with hundreds of millions\nof people I could communicate with.&nbsp; Which has more\npracticality?&nbsp; Other than on this website or the Shavian site, I\ndon&#39;t know that I have ever come into contact with anyone fluent in\nEsperanto.&nbsp; You certainly don&#39;t need it in the U.S.&nbsp; But every\nEnglish speaker could benefit from Quikscript.&nbsp; (those who know the\nroman alphabet would reap the time benefit from using Q.S.&nbsp; Those\nlearning English would benefit even more.)<br>\nThe situation brings to mind how difficult it must have been to sell the\nfirst few telephones in a town.&nbsp; Who would want one when there was\nno one else to call?&nbsp; Of course, you didn&#39;t have to study to learn\nto use a telephone so the bootstrap problem was much less severe for\nBell.&nbsp; For Quikscript to grow, we have to show the public that it\ncan be useful in their lives immediately.<br>\n<br>\n<blockquote type=\"cite\" class=\"ygrps-yiv-676705231cite\" cite><tt>Secondly, there are a number of\ncountries in which people can&#39;t even read and write their own\nlanguage.&nbsp; </tt></blockquote><br>\nObviously, countries with high illiteracy rates are not going to attempt\nto teach their citizens Esperanto before they learn to read and write\ntheir own language, but I am not sure what that has to do with the\nadoption of Esperanto as a second language for many people around the\nworld.<br>\n<br>\n<blockquote type=\"cite\" class=\"ygrps-yiv-676705231cite\" cite><tt>Thirdly, the governments of the\nworld would have to agree to this language and yet the supersigns of\nEsperanto I believe have deterred it from being\ninternational.</tt></blockquote><br>\nI am not sure about this.&nbsp; Many languages use supersigns.&nbsp;\nFrench, Spanish and German do.&nbsp; The age of the typewriter is about\ndead, but obviously, typewriters in use in the countries where the\npreceding languages are spoken had keys for those supersigns.&nbsp;\nAlthough I have no experience with this, I can only assume that a\nFrenchman does not have to go to a lot of trouble to place supersigns\nover what he writes.&nbsp; By the way, the League of Nations, I believe,\nhad agreed for Esperanto to be one of its official languages, but it was\ntoo short-lived for anything to come of it.&nbsp; Meanwhile, the U.N\nspends millions every year translating everything they do into multiple\nlanguages.&nbsp; I have read the new European Union is even worse -- they\ntranslate everything into even more languages than the U.N. does.&nbsp;\nInsanity!&nbsp; Diplomats and bureaucrats could learn Esperanto easily,\nand it would make perfect sense for them.<br>\n<br>\nPaige<br>\n</span></blockquote></html>\n</div>",
  "specialLinks": [],
  "rawEmail": "Return-Path: &lt;pgabhart@...&gt;\r\nX-Sender: pgabhart@...\r\nX-Apparently-To: Read_Alphabet@yahoogroups.com\r\nReceived: (EGP: mail-7_0_3); 18 Feb 2001 18:28:00 -0000\r\nReceived: (qmail 21655 invoked from network); 18 Feb 2001 18:27:59 -0000\r\nReceived: from unknown (10.1.10.27) by l10.egroups.com with QMQP; 18 Feb 2001 18:27:59 -0000\r\nReceived: from unknown (HELO mail3.mx.voyager.net) (216.93.66.202) by mta2 with SMTP; 18 Feb 2001 18:27:59 -0000\r\nReceived: from authoriu.corecomm.net (max1-109.louisville.corecomm.net [209.81.192.237]) by mail3.mx.voyager.net (8.10.2/8.10.2) with ESMTP id f1IIRr139825 for &lt;Read_Alphabet@yahoogroups.com&gt;; Sun, 18 Feb 2001 13:27:54 -0500 (EST)\r\nMessage-Id: &lt;5.0.2.1.0.20010218121602.009ee040@pgabhart@...&gt;\r\nX-Sender: pgabhart@pgabhart@...\r\nX-Mailer: QUALCOMM Windows Eudora Version 5.0.2\r\nDate: Sun, 18 Feb 2001 13:28:32 -0500\r\nTo: Read_Alphabet@yahoogroups.com\r\nSubject: Re: [Read_Alphabet] Re: Shaws Script and Esperanto  and Penpal\r\nIn-Reply-To: &lt;96mqt3+7sv9@...&gt;\r\nReferences: &lt;LPBBKJFOGNFNJKIBDKGNGEGGCBAA.sosostris@...&gt;\r\nMime-Version: 1.0\r\nContent-Type: multipart/alternative; boundary=&quot;=====================_439876255==_.ALT&quot;\r\nFrom: Paige Gabhart &lt;pgabhart@...&gt;\r\n\r\n\r\n--=====================_439876255==_.ALT\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;; format=flowed\r\n\r\nSid:\n\nGood to hear from you.  You wrote me a letter in quikscript several months, \nand I have been a poor correspondent, in that I have not found time to \nwrite back.  I will correct that as soon as I can.  I also received a \nquikscript letter from Jon Zuck so I will try to write both of you back at \nthe same time.\n\nAt 09:36 PM 2/17/01 +0000, you wrote:\n&gt;Many years ago I  taught the Shaw&#39;s alphabet to Japanese English students. \n&gt;The response was rather negative since most of them already knew the \n&gt;international phonetic alphabet.\n\nI would suggest this was an unusal situation.  Your students already had a \ntool sufficient for their purposes (IPA) so it does not surprise me they \nexpressed the very human reluctance to learning something they undoubtedly \nviewed as superfluous.  However, I would not anticipate that most foreign \nstudents interested in learning English would already know the IPA so your \nexperience, I posit, is not typical of the majority of foreign students.\n\n&gt;  Due to the amount of time necessary to learn Shaw, I don&#39;t think it is \n&gt; suitable for learning a language.  A mild reform of the international \n&gt; phonetic script would probably be more easier for foreign students.\n\nI think the preceding has as an underlying assumption that the roman \nalphabet is more widely known than it really is.  I cannot believe the \nsymbols used in quikscript are more difficult to learn than the roman \nalphabet.  First, there is no lower and upper case to be bothered \nwith.  Secondly, the symbols are actually simpler than the roman \nalphabet.  That alphabet, however, is so ubiquitous in the western world \nthat those of us who use it do so constantly, with the result that we are \nprobably poor judges in gauging its ease of learning.   If we take the \nworld as a whole, including Asia, India and the middle east, obviously \nsignificant portions of mankind use alphabets with absolutely no \nrelationship (or a very distant relationship) to the roman alphabet.  Those \npeople would have to learn a new alphabet in any event.  Why shouldn&#39;t they \nlearn an alphabet that effectively deals with the phonemes of English, even \nif, at this time, it were just to be considered a teaching alphabet.  I \nsuspect many immigrants to the U.S. become more or less fluent in English \nby learning English from the speech of those around them.  I think it is \ncommon that many of these people make little progress in learning to read \nand write English, and the blame for that can be laid at the door of the \nroman alphabet.  I recently had a client from Mexico, who has been in the \nU.S. for about twelve years.  His English is strongly accented, but \nunderstandable.  However, the man has absolutely no confidence he can spell \nanything &quot;correctly&quot; in English.\n\n&gt;Someone mentioned Esperanto.  I am fluent in that language.  The reason it \n&gt;is not accepted is that nationalists feel it a threat to their own language.\n\nI won&#39;t disagree with that.  However, I would also suggest that it suffers \nfrom the same bootstrap problem that Shavian or Quikscript suffers \nfrom.  When I studied Esperanto myself, its logic and simplicity appealed \nto me.  After awhile I found myself thinking that if and when I became \nfluent in it, I would be able to speak to, perhaps, a million or two \nmillion (maybe even the ten million its adherents claim) people in the \nworld.  But if I learn Spanish, for example, most of South America is \nopened to me with hundreds of millions of people I could communicate \nwith.  Which has more practicality?  Other than on this website or the \nShavian site, I don&#39;t know that I have ever come into contact with anyone \nfluent in Esperanto.  You certainly don&#39;t need it in the U.S.  But every \nEnglish speaker could benefit from Quikscript.  (those who know the roman \nalphabet would reap the time benefit from using Q.S.  Those learning \nEnglish would benefit even more.)\nThe situation brings to mind how difficult it must have been to sell the \nfirst few telephones in a town.  Who would want one when there was no one \nelse to call?  Of course, you didn&#39;t have to study to learn to use a \ntelephone so the bootstrap problem was much less severe for Bell.  For \nQuikscript to grow, we have to show the public that it can be useful in \ntheir lives immediately.\n\n&gt;Secondly, there are a number of countries in which people can&#39;t even read \n&gt;and write their own language.\n\nObviously, countries with high illiteracy rates are not going to attempt to \nteach their citizens Esperanto before they learn to read and write their \nown language, but I am not sure what that has to do with the adoption of \nEsperanto as a second language for many people around the world.\n\n&gt;Thirdly, the governments of the world would have to agree to this language \n&gt;and yet the supersigns of Esperanto I believe have deterred it from being \n&gt;international.\n\nI am not sure about this.  Many languages use supersigns.  French, Spanish \nand German do.  The age of the typewriter is about dead, but obviously, \ntypewriters in use in the countries where the preceding languages are \nspoken had keys for those supersigns.  Although I have no experience with \nthis, I can only assume that a Frenchman does not have to go to a lot of \ntrouble to place supersigns over what he writes.  By the way, the League of \nNations, I believe, had agreed for Esperanto to be one of its official \nlanguages, but it was too short-lived for anything to come of \nit.  Meanwhile, the U.N spends millions every year translating everything \nthey do into multiple languages.  I have read the new European Union is \neven worse -- they translate everything into even more languages than the \nU.N. does.  Insanity!  Diplomats and bureaucrats could learn Esperanto \neasily, and it would make perfect sense for them.\n\nPaige\n\r\n--=====================_439876255==_.ALT\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;html&gt;\nSid:&lt;br&gt;\n&lt;br&gt;\nGood to hear from you.&nbsp; You wrote me a letter in =\r\nquikscript several\nmonths, and I have been a poor correspondent, in that I =\r\nhave not found\ntime to write back.&nbsp; I will correct that as soon as I c=\r\nan.&nbsp; I\nalso received a quikscript letter from Jon Zuck so I will try t=\r\no write\nboth of you back at the same time.&lt;br&gt;\n&lt;br&gt;\nAt 09:36 PM 2/17/01 +00=\r\n00, you wrote:&lt;br&gt;\n&lt;blockquote type=3Dcite class=3Dcite cite&gt;&lt;tt&gt;Many years=\r\n ago I&nbsp; taught\nthe Shaw&#39;s alphabet to Japanese English students. The r=\r\nesponse was rather\nnegative since most of them already knew the internation=\r\nal phonetic\nalphabet.&nbsp; &lt;/tt&gt;&lt;/blockquote&gt;&lt;br&gt;\nI would suggest this was=\r\n an unusal situation.&nbsp; Your students already\nhad a tool sufficient for=\r\n their purposes (IPA) so it does not surprise me\nthey expressed the very hu=\r\nman reluctance to learning something they\nundoubtedly viewed as superfluous=\r\n.&nbsp; However, I would not anticipate\nthat most foreign students interest=\r\ned in learning English would already\nknow the IPA so your experience, I pos=\r\nit, is not typical of the majority\nof foreign students.&lt;br&gt;\n&lt;br&gt;\n&lt;blockquot=\r\ne type=3Dcite class=3Dcite cite&gt;&lt;tt&gt;&nbsp;Due to the amount of time\nnecessa=\r\nry to learn Shaw, I don&#39;t think it is suitable for learning a\nlanguage.&nbs=\r\np; A mild reform of the international phonetic script would\nprobably be mor=\r\ne easier for foreign students.&lt;/tt&gt;&lt;/blockquote&gt;&lt;br&gt;\nI think the preceding =\r\nhas as an underlying assumption that the roman\nalphabet is more widely know=\r\nn than it really is.&nbsp; I cannot believe\nthe symbols used in quikscript =\r\nare more difficult to learn than the roman\nalphabet.&nbsp; First, there is =\r\nno lower and upper case to be bothered\nwith.&nbsp; Secondly, the symbols ar=\r\ne actually simpler than the roman\nalphabet.&nbsp; That alphabet, however, i=\r\ns so ubiquitous in the western\nworld that those of us who use it do so cons=\r\ntantly, with the result that\nwe are probably poor judges in gauging its eas=\r\ne of learning.&nbsp;&nbsp;\nIf we take the world as a whole, including Asia,=\r\n India and the middle\neast, obviously significant portions of mankind use a=\r\nlphabets with\nabsolutely no relationship (or a very distant relationship) t=\r\no the roman\nalphabet.&nbsp; Those people would have to learn a new alphabet=\r\n in any\nevent.&nbsp; Why shouldn&#39;t they learn an alphabet that effectively =\r\ndeals\nwith the phonemes of English, even if, at this time, it were just to =\r\nbe\nconsidered a teaching alphabet.&nbsp; I suspect many immigrants to the\nU=\r\n.S. become more or less fluent in English by learning English from the\nspee=\r\nch of those around them.&nbsp; I think it is common that many of\nthese peop=\r\nle make little progress in learning to read and write English,\nand the blam=\r\ne for that can be laid at the door of the roman\nalphabet.&nbsp; I recently =\r\nhad a client from Mexico, who has been in the\nU.S. for about twelve years.&=\r\nnbsp; His English is strongly accented, but\nunderstandable.&nbsp; However, =\r\nthe man has absolutely no confidence he\ncan spell anything &quot;correctly&=\r\nquot; in English.&lt;br&gt;\n&lt;br&gt;\n&lt;blockquote type=3Dcite class=3Dcite cite&gt;&lt;tt&gt;So=\r\nmeone mentioned\nEsperanto.&nbsp; I am fluent in that language.&nbsp; The re=\r\nason it is not\naccepted is that nationalists feel it a threat to their own\n=\r\nlanguage.&lt;/tt&gt;&lt;/blockquote&gt;&lt;br&gt;\nI won&#39;t disagree with that.&nbsp; However, =\r\nI would also suggest that it\nsuffers from the same bootstrap problem that S=\r\nhavian or Quikscript\nsuffers from.&nbsp; When I studied Esperanto myself, i=\r\nts logic and\nsimplicity appealed to me.&nbsp; After awhile I found myself t=\r\nhinking\nthat if and when I became fluent in it, I would be able to speak to=\r\n,\nperhaps, a million or two million (maybe even the ten million its\nadheren=\r\nts claim) people in the world.&nbsp; But if I learn Spanish, for\nexample, m=\r\nost of South America is opened to me with hundreds of millions\nof people I =\r\ncould communicate with.&nbsp; Which has more\npracticality?&nbsp; Other than=\r\n on this website or the Shavian site, I\ndon&#39;t know that I have ever come in=\r\nto contact with anyone fluent in\nEsperanto.&nbsp; You certainly don&#39;t need =\r\nit in the U.S.&nbsp; But every\nEnglish speaker could benefit from Quikscrip=\r\nt.&nbsp; (those who know the\nroman alphabet would reap the time benefit fro=\r\nm using Q.S.&nbsp; Those\nlearning English would benefit even more.)&lt;br&gt;\nThe=\r\n situation brings to mind how difficult it must have been to sell the\nfirst=\r\n few telephones in a town.&nbsp; Who would want one when there was\nno one e=\r\nlse to call?&nbsp; Of course, you didn&#39;t have to study to learn\nto use a te=\r\nlephone so the bootstrap problem was much less severe for\nBell.&nbsp; For Q=\r\nuikscript to grow, we have to show the public that it\ncan be useful in thei=\r\nr lives immediately.&lt;br&gt;\n&lt;br&gt;\n&lt;blockquote type=3Dcite class=3Dcite cite&gt;&lt;tt=\r\n&gt;Secondly, there are a number of\ncountries in which people can&#39;t even read =\r\nand write their own\nlanguage.&nbsp; &lt;/tt&gt;&lt;/blockquote&gt;&lt;br&gt;\nObviously, count=\r\nries with high illiteracy rates are not going to attempt\nto teach their cit=\r\nizens Esperanto before they learn to read and write\ntheir own language, but=\r\n I am not sure what that has to do with the\nadoption of Esperanto as a seco=\r\nnd language for many people around the\nworld.&lt;br&gt;\n&lt;br&gt;\n&lt;blockquote type=3Dc=\r\nite class=3Dcite cite&gt;&lt;tt&gt;Thirdly, the governments of the\nworld would have =\r\nto agree to this language and yet the supersigns of\nEsperanto I believe hav=\r\ne deterred it from being\ninternational.&lt;/tt&gt;&lt;/blockquote&gt;&lt;br&gt;\nI am not sure=\r\n about this.&nbsp; Many languages use supersigns.&nbsp;\nFrench, Spanish and=\r\n German do.&nbsp; The age of the typewriter is about\ndead, but obviously, t=\r\nypewriters in use in the countries where the\npreceding languages are spoken=\r\n had keys for those supersigns.&nbsp;\nAlthough I have no experience with th=\r\nis, I can only assume that a\nFrenchman does not have to go to a lot of trou=\r\nble to place supersigns\nover what he writes.&nbsp; By the way, the League o=\r\nf Nations, I believe,\nhad agreed for Esperanto to be one of its official la=\r\nnguages, but it was\ntoo short-lived for anything to come of it.&nbsp; Meanw=\r\nhile, the U.N\nspends millions every year translating everything they do int=\r\no multiple\nlanguages.&nbsp; I have read the new European Union is even wors=\r\ne -- they\ntranslate everything into even more languages than the U.N. does.=\r\n&nbsp;\nInsanity!&nbsp; Diplomats and bureaucrats could learn Esperanto easi=\r\nly,\nand it would make perfect sense for them.&lt;br&gt;\n&lt;br&gt;\nPaige&lt;br&gt;\n&lt;/html&gt;\n\r\n--=====================_439876255==_.ALT--\r\n\n"
}