{
  "userId": 168229681,
  "authorName": "oliver langan",
  "from": "&quot;oliver langan&quot; &lt;oliverlangan@...&gt;",
  "profile": "oliverlangan",
  "replyTo": "LIST",
  "senderId": "BFmWUrRd7aigqNpWaap7ceNohTvPrghanC7uD7zSBKesBTzqRzugaZzXEr1ZKj9DdituqPbHyfqEmHE8mB6hGBZoNVaEGQmqUdZ8UxBzpdrGEw",
  "spamInfo": {
    "isSpam": false,
    "reason": "12"
  },
  "subject": "Re: [Read_Alphabet] Quickscript Unicode Proposal",
  "postDate": "1144913889",
  "msgId": 720,
  "canDelete": false,
  "contentTrasformed": false,
  "systemMessage": false,
  "headers": {
    "messageIdInHeader": "PGUxa3Y1MSthdGVjQGVHcm91cHMuY29tPg=="
  },
  "prevInTopic": 719,
  "nextInTopic": 722,
  "prevInTime": 719,
  "nextInTime": 721,
  "topicId": 706,
  "numMessagesInTopic": 16,
  "msgSnippet": "Hi Paige, no offense was taken at all, I hope it didn t seem so. (In re-reading this before sending, it appears I am repeating some of what Joseph just said.",
  "messageBody": "<div id=\"ygrps-yiv-1936692148\">Hi Paige, no offense was taken at all, I hope it didn&#39;t seem so.<br/>\n<br/>\n(In re-reading this before sending, it appears I am repeating some of what Joseph just <br/>\nsaid.  Just a bit more long-winded.)<br/>\n<br/>\nLet me explain a little more what I mean about &#39;avoiding separate glyphs for diphthongs.&#39; I <br/>\nthink I did not describe it well before, and it actually relates quite a bit to your other item <br/>\non a half-ye.  (I agree, btw, that a half-ye is a good addition).  Given its design, a given <br/>\nletter in Quickscript can have several different forms.  Many of the tall letters, as you point <br/>\nout, can be written as half-letters, top only, and some of the deep letters can also be <br/>\nwritten bottom only.  Likewise, many letters can be combined to a greater extent.  The <br/>\n&#39;standard&#39; ligatures in the Quickscript manual, you and air and the like, are really two <br/>\nseparate letters that are drawn together.<br/>\n<br/>\nI am sure you all know this, I don&#39;t mean to be pedantic.  However, when Shavian was put <br/>\ninto Unicode, for some reason several of these combined letters were included in the <br/>\nencoding.  Specifically, encodings 10477 through 1047F: are (a combination of ah and <br/>\nroar), or (awe and roar), air, err, array, ear, ian, and yew.  According to the Unicode <br/>\nproposals page (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unicode.org/pending/proposals.html)\">http://www.unicode.org/pending/proposals.html)</a>, &quot;Often a proposed <br/>\ncharacter can be expressed as a sequence of one or more existing Unicode characters. <br/>\nEncoding the proposed character would be a duplicate representation, and is thus not <br/>\nsuitable for encoding.&quot;  I would argue that these combined character representation are <br/>\njust that, sequences of one or more existing characters (from the rest of the Shavian <br/>\nencoding block).<br/>\n<br/>\nI think my original message was a misstatement in two ways: I misused the word <br/>\n&quot;diphthong,&quot; which really means combined vowels, to mean combines sequences of <br/>\nletters.  (Shavian and Quickscript both code several diphthongs as single characters, which <br/>\nis reasonable given their prevalence in English.)  Secondly, I misused the word &quot;glyph,&quot; <br/>\nwhich in Unicode parlance means &quot;a way of drawing a character or sequence of <br/>\ncharacters.&quot;  In fact, we should have multiple glyphs for the tall tea and the half-tea, but <br/>\nboth glyphs should represent the same encoding.  The Wikipedia entry on Unicode (http://<br/>\nen.wikipedia.org/wiki/Unicode) set me straight on this terminology.<br/>\n<br/>\nHere is where my own knowledge of Unicode and font rendering systems fails.  The <br/>\nproposal page mentioned above also says &quot;If the proposed characters exhibit shaping <br/>\nbehavior (contextual shaping, ligatures, conjuncts, or stacking), provide a description of <br/>\nthat behavior,  preferably with glyph examples. It should be sufficient so that software <br/>\nengineers can produce a minimally acceptable rendering of the characters.&quot;  This seems to <br/>\nindicate to me that there can be multiple representations for a single encoding: multiple <br/>\nglyphs per character.  Indeed, the &quot;Where is my Character?&quot; page on the Unicode site <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unicode.org/standard/where/)\">http://www.unicode.org/standard/where/)</a> makes this very clear.  See &quot;variant shapes.&quot;<br/>\n<br/>\nWhat does this all mean?  Well, one effect of only having a single encoding per letter will <br/>\nbe that, at first, each character will only have one single form and thus the fonts will <br/>\nprobably look like Junior Quickscript rather than Senior.  However, as Quickscript becomes <br/>\nmore accepted and popular, font designers will be able to create more complex fonts <br/>\nwhich are able to combine sequences of characters into something more closely <br/>\nrepresenting Senior Quickscript.  But when that happens, older texts (i.e., those encoded <br/>\nin Unicode, but before the complex fonts were created) will not have to be re-encoded, <br/>\nbecause the only thing that will change is how the characters are represented.  See the <br/>\n&quot;Ready-made versus composite characters&quot; section of the Wikipedia article, above.<br/>\n<br/>\nEdward brings up a good suggestion of using the ConScript Unicode Registry as a test-bed <br/>\nfor Quickscript encoding.  I have looked at it before, and am hesitant only because it <br/>\nappears to not have been updated in recent years.  However, Michael Everson is known to <br/>\nhave gotten several alternate scripts (including Shavian) into the Unicode standard, and <br/>\nsome of those started in the ConScript registry.<br/>\n<br/>\nIf someone wants to take a stab at it, perhaps we can move forward with converting an <br/>\nexisting Quickscript font to Unicode within the Conscript block.  I propose using the <br/>\ncharacter range U+E650 through U+E67F, which follows immediately after the &quot;Seussian <br/>\nLatin Extensions&quot; range in the ConScript (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.evertype.com/standards/csur/\">http://www.evertype.com/standards/csur/</a><br/>\nseuss.html).  To convert an existing font, one may wish to try the tool FontForge (http://<br/>\nfontforge.sourceforge.net/).  It is an excellent free font editing tool which (with a little bit <br/>\nof work) can be installed on Windows (requires cygwin), Mac OS X (requires X11), or Linux.  <br/>\nI should point out that some characters in these fonts should NOT be moved to new <br/>\nlocations.  All numbers and punctuation should be left where they are, as they are already <br/>\nin their correct Unicode placement.  Only the letters should be moved.  Once we have an <br/>\nexample font in place, we can register it with the conscript (though exactly how I am not <br/>\nsure), and also start the &#39;real&#39; Unicode proposal process.  In the meantime, we will be able <br/>\nto start playing with mixed Quickscript/standard orthography messages.<br/>\n<br/>\nI will try to do the font editing exercise myself... but not tonight.  My wife is already giving <br/>\nme the evil eye to get off of the damned machine.<br/>\n<br/>\noliver</div>",
  "specialLinks": [],
  "rawEmail": "Return-Path: &lt;oliverlangan@...&gt;\r\nX-Sender: oliverlangan@...\r\nX-Apparently-To: Read_Alphabet@yahoogroups.com\r\nReceived: (qmail 42951 invoked from network); 13 Apr 2006 07:40:02 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m30.grp.scd.yahoo.com with QMQP; 13 Apr 2006 07:40:02 -0000\r\nReceived: from unknown (HELO n31a.bullet.scd.yahoo.com) (209.73.160.90)\n  by mta1.grp.scd.yahoo.com with SMTP; 13 Apr 2006 07:40:00 -0000\r\nComment: DomainKeys? See http://antispam.yahoo.com/domainkeys\r\nReceived: from [66.218.69.3] by n31.bullet.scd.yahoo.com with NNFMP; 13 Apr 2006 07:38:09 -0000\r\nReceived: from [66.218.66.92] by t3.bullet.scd.yahoo.com with NNFMP; 13 Apr 2006 07:38:09 -0000\r\nDate: Thu, 13 Apr 2006 07:38:09 -0000\r\nTo: Read_Alphabet@yahoogroups.com\r\nMessage-ID: &lt;e1kv51+atec@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: &quot;oliver langan&quot; &lt;oliverlangan@...&gt;\r\nSubject: Re: [Read_Alphabet] Quickscript Unicode Proposal\r\nX-Yahoo-Group-Post: member; u=168229681; y=42Mlw-7O2RPGuWz_qznhnP-a1KqTt-lfV20tnMY19xeQS3hJT7AL\r\nX-Yahoo-Profile: oliverlangan\r\n\r\nHi Paige, no offense was taken at all, I hope it didn&#39;t seem so.\n\n(In re-re=\r\nading this before sending, it appears I am repeating some of what Joseph ju=\r\nst \nsaid.  Just a bit more long-winded.)\n\nLet me explain a little more what=\r\n I mean about &#39;avoiding separate glyphs for diphthongs.&#39; I \nthink I did not=\r\n describe it well before, and it actually relates quite a bit to your other=\r\n item \non a half-ye.  (I agree, btw, that a half-ye is a good addition).  G=\r\niven its design, a given \nletter in Quickscript can have several different =\r\nforms.  Many of the tall letters, as you point \nout, can be written as half=\r\n-letters, top only, and some of the deep letters can also be \nwritten botto=\r\nm only.  Likewise, many letters can be combined to a greater extent.  The \n=\r\n&#39;standard&#39; ligatures in the Quickscript manual, you and air and the like, a=\r\nre really two \nseparate letters that are drawn together.\n\nI am sure you all=\r\n know this, I don&#39;t mean to be pedantic.  However, when Shavian was put \nin=\r\nto Unicode, for some reason several of these combined letters were included=\r\n in the \nencoding.  Specifically, encodings 10477 through 1047F: are (a com=\r\nbination of ah and \nroar), or (awe and roar), air, err, array, ear, ian, an=\r\nd yew.  According to the Unicode \nproposals page (http://www.unicode.org/pe=\r\nnding/proposals.html), &quot;Often a proposed \ncharacter can be expressed as a s=\r\nequence of one or more existing Unicode characters. \nEncoding the proposed =\r\ncharacter would be a duplicate representation, and is thus not \nsuitable fo=\r\nr encoding.&quot;  I would argue that these combined character representation ar=\r\ne \njust that, sequences of one or more existing characters (from the rest o=\r\nf the Shavian \nencoding block).\n\nI think my original message was a misstate=\r\nment in two ways: I misused the word \n&quot;diphthong,&quot; which really means combi=\r\nned vowels, to mean combines sequences of \nletters.  (Shavian and Quickscri=\r\npt both code several diphthongs as single characters, which \nis reasonable =\r\ngiven their prevalence in English.)  Secondly, I misused the word &quot;glyph,&quot; =\r\n\nwhich in Unicode parlance means &quot;a way of drawing a character or sequence =\r\nof \ncharacters.&quot;  In fact, we should have multiple glyphs for the tall tea =\r\nand the half-tea, but \nboth glyphs should represent the same encoding.  The=\r\n Wikipedia entry on Unicode (http://\nen.wikipedia.org/wiki/Unicode) set me =\r\nstraight on this terminology.\n\nHere is where my own knowledge of Unicode an=\r\nd font rendering systems fails.  The \nproposal page mentioned above also sa=\r\nys &quot;If the proposed characters exhibit shaping \nbehavior (contextual shapin=\r\ng, ligatures, conjuncts, or stacking), provide a description of \nthat behav=\r\nior,  preferably with glyph examples. It should be sufficient so that softw=\r\nare \nengineers can produce a minimally acceptable rendering of the characte=\r\nrs.&quot;  This seems to \nindicate to me that there can be multiple representati=\r\nons for a single encoding: multiple \nglyphs per character.  Indeed, the &quot;Wh=\r\nere is my Character?&quot; page on the Unicode site \n(http://www.unicode.org/sta=\r\nndard/where/) makes this very clear.  See &quot;variant shapes.&quot;\n\nWhat does this=\r\n all mean?  Well, one effect of only having a single encoding per letter wi=\r\nll \nbe that, at first, each character will only have one single form and th=\r\nus the fonts will \nprobably look like Junior Quickscript rather than Senior=\r\n.  However, as Quickscript becomes \nmore accepted and popular, font designe=\r\nrs will be able to create more complex fonts \nwhich are able to combine seq=\r\nuences of characters into something more closely \nrepresenting Senior Quick=\r\nscript.  But when that happens, older texts (i.e., those encoded \nin Unicod=\r\ne, but before the complex fonts were created) will not have to be re-encode=\r\nd, \nbecause the only thing that will change is how the characters are repre=\r\nsented.  See the \n&quot;Ready-made versus composite characters&quot; section of the W=\r\nikipedia article, above.\n\nEdward brings up a good suggestion of using the C=\r\nonScript Unicode Registry as a test-bed \nfor Quickscript encoding.  I have =\r\nlooked at it before, and am hesitant only because it \nappears to not have b=\r\neen updated in recent years.  However, Michael Everson is known to \nhave go=\r\ntten several alternate scripts (including Shavian) into the Unicode standar=\r\nd, and \nsome of those started in the ConScript registry.\n\nIf someone wants =\r\nto take a stab at it, perhaps we can move forward with converting an \nexist=\r\ning Quickscript font to Unicode within the Conscript block.  I propose usin=\r\ng the \ncharacter range U+E650 through U+E67F, which follows immediately aft=\r\ner the &quot;Seussian \nLatin Extensions&quot; range in the ConScript (http://www.ever=\r\ntype.com/standards/csur/\nseuss.html).  To convert an existing font, one may=\r\n wish to try the tool FontForge (http://\nfontforge.sourceforge.net/).  It i=\r\ns an excellent free font editing tool which (with a little bit \nof work) ca=\r\nn be installed on Windows (requires cygwin), Mac OS X (requires X11), or Li=\r\nnux.  \nI should point out that some characters in these fonts should NOT be=\r\n moved to new \nlocations.  All numbers and punctuation should be left where=\r\n they are, as they are already \nin their correct Unicode placement.  Only t=\r\nhe letters should be moved.  Once we have an \nexample font in place, we can=\r\n register it with the conscript (though exactly how I am not \nsure), and al=\r\nso start the &#39;real&#39; Unicode proposal process.  In the meantime, we will be =\r\nable \nto start playing with mixed Quickscript/standard orthography messages=\r\n.\n\nI will try to do the font editing exercise myself... but not tonight.  M=\r\ny wife is already giving \nme the evil eye to get off of the damned machine.=\r\n\n\noliver\n\n\n\n\n\n"
}