{
  "userId": 168229681,
  "authorName": "oliver langan",
  "from": "oliver langan &lt;oliverlangan@...&gt;",
  "profile": "oliverlangan",
  "replyTo": "LIST",
  "senderId": "mNJbIX50Bfy8NV8tX76W7_fZCW1sKnVUKny0bDsUZQiq_U7X2JtDBOi_Cd2IPXYLA1v1kr-5U5aHIRIEQuVB1wcA3OhcpdResbr8fiJZcjI",
  "spamInfo": {
    "isSpam": false,
    "reason": "12"
  },
  "subject": "Re: [Read_Alphabet] Re: Quickscript Unicode Proposal",
  "postDate": "1144914372",
  "msgId": 722,
  "canDelete": false,
  "contentTrasformed": false,
  "systemMessage": false,
  "headers": {
    "messageIdInHeader": "PDUyMzk2NUMwLUM1NzYtNEE5My04RDFCLUZCMkJBMDk0ODU4OEB5YWhvby5jb20uc2c+",
    "inReplyToHeader": "PGUxanJlZithdmEwQGVHcm91cHMuY29tPg==",
    "referencesHeader": "PGUxanJlZithdmEwQGVHcm91cHMuY29tPg=="
  },
  "prevInTopic": 720,
  "nextInTopic": 724,
  "prevInTime": 721,
  "nextInTime": 723,
  "topicId": 706,
  "numMessagesInTopic": 16,
  "msgSnippet": "Hi Paige, no offense was taken at all, I hope it didn t seem so. (In re-reading this before sending, it appears I am repeating some of what Joseph just said.",
  "messageBody": "<div id=\"ygrps-yiv-2003834188\"><html>Hi Paige, no offense was taken at all, I hope it didn&#39;t seem so.<div><br class=\"ygrps-yiv-2003834188khtml-block-placeholder\"></div><div>(In re-reading this before sending, it appears I am repeating some of what Joseph just said.  Just a bit more long-winded.)</div><div><br class=\"ygrps-yiv-2003834188khtml-block-placeholder\"></div><div>(And in re-re-reading this after sending it the first time, it looks like the Yahoo editor has once again mangled my post.  Let me try to re-send through a real email client.)<div><br class=\"ygrps-yiv-2003834188khtml-block-placeholder\"></div><div><span class=\"ygrps-yiv-2003834188Apple-style-span\">Let me explain a little more what I mean about &#39;avoiding separate glyphs for diphthongs.&#39; I think I did not describe it well before, and it actually relates quite a bit to your other item on a half-ye.  (I agree, btw, that a half-ye is a good addition).  Given its design, a given <i>letter</i> in Quickscript can have several different <i>forms</i>.  Many of the tall letters, as you point out, can be written as half-letters, top only, and some of the deep letters can also be written bottom only.  Likewise, many letters can be combined to a greater extent.  The &#39;standard&#39; ligatures in the Quickscript manual, <i>you</i> and <i>air</i> and the like, are really two separate letters that are drawn together.</span></div><div><br class=\"ygrps-yiv-2003834188khtml-block-placeholder\"></div><div><span class=\"ygrps-yiv-2003834188Apple-style-span\">I am sure you all know this, I don&#39;t mean to be pedantic.  However, when Shavian was put into Unicode, for some reason several of these combined letters were included in the encoding.  Specifically, encodings 10477 through 1047F: <i>are</i> (a combination of <i>ah</i> and <i>roar</i>), <i>or</i> (<i>awe</i> and <i>roar</i>), <i>air</i>, <i>err</i>, <i>array</i>, <i>ear</i>, <i>ian</i>, and <i>yew</i>.  According to the Unicode proposals page (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unicode.org/pending/proposals.html\">http://www.unicode.org/pending/proposals.html</a>), &quot;Often a proposed character can be expressed as a sequence of one or more existing Unicode characters. Encoding the proposed character would be a duplicate representation, and is thus not suitable for encoding.&quot;  I would argue that these combined character representation are just that, sequences of one or more existing characters (from the rest of the Shavian encoding block).</span></div><div><br class=\"ygrps-yiv-2003834188khtml-block-placeholder\"></div><div><span class=\"ygrps-yiv-2003834188Apple-style-span\">I think my original message was a misstatement in two ways: I misused the word &quot;diphthong,&quot; which really means combined vowels, to mean combines sequences of letters.  (Shavian and Quickscript both code several diphthongs as single characters, which is reasonable given their prevalence in English.)  Secondly, I misused the word &quot;glyph,&quot; which in Unicode parlance means &quot;a way of drawing a character or sequence of characters.&quot;  In fact, we <i>should</i> have multiple glyphs for the tall <i>tea</i> and the half-<i>tea</i>, but both glyphs should represent the same encoding.  The Wikipedia entry on Unicode (<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Unicode\">http://en.wikipedia.org/wiki/Unicode</a>) set me straight on this terminology.</span></div><div><br class=\"ygrps-yiv-2003834188khtml-block-placeholder\"></div><div>Here is where my own knowledge of Unicode and font rendering systems fails.  The proposal page mentioned above also says &quot;If the proposed characters exhibit shaping behavior (contextual shaping, ligatures, conjuncts, or stacking), provide a description of that behavior,  preferably with glyph examples. It should be sufficient so that software engineers can produce a minimally acceptable rendering of the characters.&quot;  This seems to indicate to me that there can be multiple representations for a single encoding: multiple glyphs per character.  Indeed, the &quot;Where is my Character?&quot; page on the Unicode site (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unicode.org/standard/where/\">http://www.unicode.org/standard/where/</a>) makes this very clear.  See &quot;variant shapes.&quot;</div><div><br class=\"ygrps-yiv-2003834188khtml-block-placeholder\"></div><div><span class=\"ygrps-yiv-2003834188Apple-style-span\">What does this all mean?  Well, one effect of only having a single encoding per letter will be that, at first, each character will only have one single form and thus the fonts will probably look like Junior Quickscript rather than Senior.  However, as Quickscript becomes more accepted and popular, font designers will be able to create more complex fonts which are able to combine sequences of characters into something more closely representing Senior Quickscript.  But when that happens, older texts (i.e., those encoded in Unicode, but before the complex fonts were created) will <b><i>not</i><span class=\"ygrps-yiv-2003834188Apple-style-span\" style=\"font-weight:normal;\"> have to be re-encoded, because the only thing that will change is how the characters are represented.  See the &quot;Ready-made versus composite characters&quot; section of the Wikipedia article, above.</span></b></span></div><div><br class=\"ygrps-yiv-2003834188khtml-block-placeholder\"></div><div>Edward brings up a good suggestion of using the ConScript Unicode Registry as a test-bed for Quickscript encoding.  I have looked at it before, and am hesitant only because it appears to not have been updated in recent years.  However, Michael Everson is known to have gotten several alternate scripts (including Shavian) into the Unicode standard, and some of those started in the ConScript registry.</div><div><br class=\"ygrps-yiv-2003834188khtml-block-placeholder\"></div><div>If someone wants to take a stab at it, perhaps we can move forward with converting an existing Quickscript font to Unicode within the Conscript block.  I propose using the character range U+E650 through U+E67F, which follows immediately after the &quot;Seussian Latin Extensions&quot; range in the ConScript (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.evertype.com/standards/csur/seuss.html\">http://www.evertype.com/standards/csur/seuss.html</a>).  To convert an existing font, one may wish to try the tool FontForge (<a rel=\"nofollow\" target=\"_blank\" href=\"http://fontforge.sourceforge.net\">http://fontforge.sourceforge.net</a>/).  It is an excellent free font editing tool which (with a little bit of work) can be installed on Windows (requires cygwin), Mac OS X (requires X11), or Linux.  I should point out that some characters in these fonts should NOT be moved to new locations.  All numbers and punctuation should be left where they are, as they are already in their correct Unicode placement.  Only the letters (in the QS Unicode proposal) should be moved; and the ligatures can be removed entirely.  Once we have an example font in place, we can register it with the conscript (though exactly how I am not sure), and also start the &#39;real&#39; Unicode proposal process.  In the meantime, we will be able to start playing with mixed Quickscript/standard orthography messages.</div><div><br class=\"ygrps-yiv-2003834188khtml-block-placeholder\"></div><div>I will try to do the font editing exercise myself... but not tonight.  My wife is already giving me the evil eye to get off of the damned machine.</div><div><br class=\"ygrps-yiv-2003834188khtml-block-placeholder\"></div><div>oliver<tt><br></tt></div><div><br class=\"ygrps-yiv-2003834188khtml-block-placeholder\"></div><div><span class=\"ygrps-yiv-2003834188Apple-style-span\"><div></div></span></div></div></html></div>",
  "specialLinks": [],
  "rawEmail": "Return-Path: &lt;oliverlangan@...&gt;\r\nX-Sender: oliverlangan@...\r\nX-Apparently-To: Read_Alphabet@yahoogroups.com\r\nReceived: (qmail 96959 invoked from network); 13 Apr 2006 09:16:21 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m29.grp.scd.yahoo.com with QMQP; 13 Apr 2006 09:16:21 -0000\r\nReceived: from unknown (HELO smtp110.mail.mud.yahoo.com) (209.191.85.220)\n  by mta6.grp.scd.yahoo.com with SMTP; 13 Apr 2006 09:16:21 -0000\r\nReceived: (qmail 19863 invoked from network); 13 Apr 2006 07:46:17 -0000\r\nReceived: from unknown (HELO ?192.168.0.7?) (oliverlangan@66.126.248.140 with plain)\n  by smtp110.mail.mud.yahoo.com with SMTP; 13 Apr 2006 07:46:15 -0000\r\nMime-Version: 1.0 (Apple Message framework v749.3)\r\nIn-Reply-To: &lt;e1jref+ava0@...&gt;\r\nReferences: &lt;e1jref+ava0@...&gt;\r\nContent-Type: multipart/alternative; boundary=Apple-Mail-2--896551597\r\nMessage-Id: &lt;523965C0-C576-4A93-8D1B-FB2BA0948588@...&gt;\r\nDate: Thu, 13 Apr 2006 00:46:12 -0700\r\nTo: Read_Alphabet@yahoogroups.com\r\nX-Mailer: Apple Mail (2.749.3)\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: oliver langan &lt;oliverlangan@...&gt;\r\nSubject: Re: [Read_Alphabet] Re: Quickscript Unicode Proposal\r\nX-Yahoo-Group-Post: member; u=168229681; y=exL7IB0HUUKlSz79bzpCD5MPWQMKeamxTy7c0MrEXe91B6z-LZR-\r\nX-Yahoo-Profile: oliverlangan\r\n\r\n\r\n--Apple-Mail-2--896551597\r\nContent-Transfer-Encoding: 7bit\r\nContent-Type: text/plain;\n\tcharset=US-ASCII;\n\tdelsp=yes;\n\tformat=flowed\r\n\r\nHi Paige, no offense was taken at all, I hope it didn&#39;t seem so.\n\n(In re-reading this before sending, it appears I am repeating some of  \nwhat Joseph just said.  Just a bit more long-winded.)\n\n(And in re-re-reading this after sending it the first time, it looks  \nlike the Yahoo editor has once again mangled my post.  Let me try to  \nre-send through a real email client.)\n\nLet me explain a little more what I mean about &#39;avoiding separate  \nglyphs for diphthongs.&#39; I think I did not describe it well before,  \nand it actually relates quite a bit to your other item on a half-ye.   \n(I agree, btw, that a half-ye is a good addition).  Given its design,  \na given letter in Quickscript can have several different forms.  Many  \nof the tall letters, as you point out, can be written as half- \nletters, top only, and some of the deep letters can also be written  \nbottom only.  Likewise, many letters can be combined to a greater  \nextent.  The &#39;standard&#39; ligatures in the Quickscript manual, you and  \nair and the like, are really two separate letters that are drawn  \ntogether.\n\nI am sure you all know this, I don&#39;t mean to be pedantic.  However,  \nwhen Shavian was put into Unicode, for some reason several of these  \ncombined letters were included in the encoding.  Specifically,  \nencodings 10477 through 1047F: are (a combination of ah and roar), or  \n(awe and roar), air, err, array, ear, ian, and yew.  According to the  \nUnicode proposals page (http://www.unicode.org/pending/ \nproposals.html), &quot;Often a proposed character can be expressed as a  \nsequence of one or more existing Unicode characters. Encoding the  \nproposed character would be a duplicate representation, and is thus  \nnot suitable for encoding.&quot;  I would argue that these combined  \ncharacter representation are just that, sequences of one or more  \nexisting characters (from the rest of the Shavian encoding block).\n\nI think my original message was a misstatement in two ways: I misused  \nthe word &quot;diphthong,&quot; which really means combined vowels, to mean  \ncombines sequences of letters.  (Shavian and Quickscript both code  \nseveral diphthongs as single characters, which is reasonable given  \ntheir prevalence in English.)  Secondly, I misused the word &quot;glyph,&quot;  \nwhich in Unicode parlance means &quot;a way of drawing a character or  \nsequence of characters.&quot;  In fact, we should have multiple glyphs for  \nthe tall tea and the half-tea, but both glyphs should represent the  \nsame encoding.  The Wikipedia entry on Unicode (http:// \nen.wikipedia.org/wiki/Unicode) set me straight on this terminology.\n\nHere is where my own knowledge of Unicode and font rendering systems  \nfails.  The proposal page mentioned above also says &quot;If the proposed  \ncharacters exhibit shaping behavior (contextual shaping, ligatures,  \nconjuncts, or stacking), provide a description of that behavior,   \npreferably with glyph examples. It should be sufficient so that  \nsoftware engineers can produce a minimally acceptable rendering of  \nthe characters.&quot;  This seems to indicate to me that there can be  \nmultiple representations for a single encoding: multiple glyphs per  \ncharacter.  Indeed, the &quot;Where is my Character?&quot; page on the Unicode  \nsite (http://www.unicode.org/standard/where/) makes this very clear.   \nSee &quot;variant shapes.&quot;\n\nWhat does this all mean?  Well, one effect of only having a single  \nencoding per letter will be that, at first, each character will only  \nhave one single form and thus the fonts will probably look like  \nJunior Quickscript rather than Senior.  However, as Quickscript  \nbecomes more accepted and popular, font designers will be able to  \ncreate more complex fonts which are able to combine sequences of  \ncharacters into something more closely representing Senior  \nQuickscript.  But when that happens, older texts (i.e., those encoded  \nin Unicode, but before the complex fonts were created) will not have  \nto be re-encoded, because the only thing that will change is how the  \ncharacters are represented.  See the &quot;Ready-made versus composite  \ncharacters&quot; section of the Wikipedia article, above.\n\nEdward brings up a good suggestion of using the ConScript Unicode  \nRegistry as a test-bed for Quickscript encoding.  I have looked at it  \nbefore, and am hesitant only because it appears to not have been  \nupdated in recent years.  However, Michael Everson is known to have  \ngotten several alternate scripts (including Shavian) into the Unicode  \nstandard, and some of those started in the ConScript registry.\n\nIf someone wants to take a stab at it, perhaps we can move forward  \nwith converting an existing Quickscript font to Unicode within the  \nConscript block.  I propose using the character range U+E650 through U \n+E67F, which follows immediately after the &quot;Seussian Latin  \nExtensions&quot; range in the ConScript (http://www.evertype.com/standards/ \ncsur/seuss.html).  To convert an existing font, one may wish to try  \nthe tool FontForge (http://fontforge.sourceforge.net/).  It is an  \nexcellent free font editing tool which (with a little bit of work)  \ncan be installed on Windows (requires cygwin), Mac OS X (requires  \nX11), or Linux.  I should point out that some characters in these  \nfonts should NOT be moved to new locations.  All numbers and  \npunctuation should be left where they are, as they are already in  \ntheir correct Unicode placement.  Only the letters (in the QS Unicode  \nproposal) should be moved; and the ligatures can be removed  \nentirely.  Once we have an example font in place, we can register it  \nwith the conscript (though exactly how I am not sure), and also start  \nthe &#39;real&#39; Unicode proposal process.  In the meantime, we will be  \nable to start playing with mixed Quickscript/standard orthography  \nmessages.\n\nI will try to do the font editing exercise myself... but not  \ntonight.  My wife is already giving me the evil eye to get off of the  \ndamned machine.\n\noliver\n\n\r\n--Apple-Mail-2--896551597\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/html;\n\tcharset=ISO-8859-1\r\n\r\n&lt;HTML&gt;&lt;BODY style=3D&quot;word-wrap: break-word; -khtml-nbsp-mode: space; -khtml=\r\n-line-break: after-white-space; &quot;&gt;Hi Paige, no offense was taken at all, I =\r\nhope it didn&#39;t seem so.&lt;DIV&gt;&lt;BR class=3D&quot;khtml-block-placeholder&quot;&gt;&lt;/DIV&gt;&lt;DI=\r\nV&gt;(In re-reading this before sending, it appears I am repeating some of wha=\r\nt Joseph just said.=A0 Just a bit more long-winded.)&lt;/DIV&gt;&lt;DIV&gt;&lt;BR class=3D=\r\n&quot;khtml-block-placeholder&quot;&gt;&lt;/DIV&gt;&lt;DIV&gt;(And in re-re-reading this after sendi=\r\nng it the first time, it looks like the Yahoo editor has once again mangled=\r\n my post.=A0 Let me try to re-send through a real email client.)&lt;DIV&gt;&lt;BR cl=\r\nass=3D&quot;khtml-block-placeholder&quot;&gt;&lt;/DIV&gt;&lt;DIV&gt;&lt;SPAN class=3D&quot;Apple-style-span&quot;=\r\n&gt;Let me explain a little more what I mean about &#39;avoiding separate glyphs f=\r\nor diphthongs.&#39; I think I did not describe it well before, and it actually =\r\nrelates quite a bit to your other item on a half-ye.=A0 (I agree, btw, that=\r\n a half-ye is a good addition).=A0 Given its design, a given &lt;I&gt;letter&lt;/I&gt;=\r\n=A0in Quickscript can have several different &lt;I&gt;forms&lt;/I&gt;.=A0 Many of the t=\r\nall letters, as you point out, can be written as half-letters, top only, an=\r\nd some of the deep letters can also be written bottom only.=A0 Likewise, ma=\r\nny letters can be combined to a greater extent.=A0 The &#39;standard&#39; ligatures=\r\n in the Quickscript manual, &lt;I&gt;you&lt;/I&gt;=A0and &lt;I&gt;air&lt;/I&gt;=A0and the like, are=\r\n really two separate letters that are drawn together.&lt;/SPAN&gt;&lt;/DIV&gt;&lt;DIV&gt;&lt;BR =\r\nclass=3D&quot;khtml-block-placeholder&quot;&gt;&lt;/DIV&gt;&lt;DIV&gt;&lt;SPAN class=3D&quot;Apple-style-spa=\r\nn&quot;&gt;I am sure you all know this, I don&#39;t mean to be pedantic.=A0 However, wh=\r\nen Shavian was put into Unicode, for some reason several of these combined =\r\nletters were included in the encoding.=A0 Specifically, encodings 10477 thr=\r\nough 1047F:=A0&lt;I&gt;are&lt;/I&gt;=A0(a combination of &lt;I&gt;ah&lt;/I&gt;=A0and &lt;I&gt;roar&lt;/I&gt;), =\r\n&lt;I&gt;or&lt;/I&gt;=A0(&lt;I&gt;awe&lt;/I&gt;=A0and &lt;I&gt;roar&lt;/I&gt;), &lt;I&gt;air&lt;/I&gt;, &lt;I&gt;err&lt;/I&gt;, &lt;I&gt;arra=\r\ny&lt;/I&gt;, &lt;I&gt;ear&lt;/I&gt;, &lt;I&gt;ian&lt;/I&gt;, and &lt;I&gt;yew&lt;/I&gt;.=A0 According to the Unicode =\r\nproposals page (&lt;A href=3D&quot;http://www.unicode.org/pending/proposals.html&quot;&gt;h=\r\nttp://www.unicode.org/pending/proposals.html&lt;/A&gt;), &quot;Often a proposed charac=\r\nter can be expressed as a sequence of one or more existing Unicode characte=\r\nrs. Encoding the proposed character would be a duplicate representation, an=\r\nd is thus not suitable for encoding.&quot;=A0 I would argue that these combined =\r\ncharacter representation are just that, sequences of one or more existing c=\r\nharacters (from the rest of the Shavian encoding block).&lt;/SPAN&gt;&lt;/DIV&gt;&lt;DIV&gt;&lt;=\r\nBR class=3D&quot;khtml-block-placeholder&quot;&gt;&lt;/DIV&gt;&lt;DIV&gt;&lt;SPAN class=3D&quot;Apple-style-=\r\nspan&quot;&gt;I think my original message was a misstatement in two ways: I misused=\r\n the word &quot;diphthong,&quot; which really means combined vowels, to mean combines=\r\n sequences of letters.=A0 (Shavian and Quickscript both code several diphth=\r\nongs as single characters, which is reasonable given their prevalence in En=\r\nglish.)=A0 Secondly, I misused the word &quot;glyph,&quot; which in Unicode parlance =\r\nmeans &quot;a way of drawing a character or sequence of characters.&quot;=A0 In fact,=\r\n we &lt;I&gt;should&lt;/I&gt;=A0have multiple glyphs for the tall &lt;I&gt;tea&lt;/I&gt;=A0and the =\r\nhalf-&lt;I&gt;tea&lt;/I&gt;, but both glyphs should represent the same encoding.=A0 The=\r\n Wikipedia entry on Unicode (&lt;A href=3D&quot;http://en.wikipedia.org/wiki/Unicod=\r\ne&quot;&gt;http://en.wikipedia.org/wiki/Unicode&lt;/A&gt;) set me straight on this termin=\r\nology.&lt;/SPAN&gt;&lt;/DIV&gt;&lt;DIV&gt;&lt;BR class=3D&quot;khtml-block-placeholder&quot;&gt;&lt;/DIV&gt;&lt;DIV&gt;He=\r\nre is where my own knowledge of Unicode and font rendering systems fails.=\r\n=A0 The proposal page mentioned above also says &quot;If the proposed characters=\r\n exhibit shaping behavior (contextual shaping, ligatures, conjuncts, or sta=\r\ncking), provide a description of that behavior,=A0 preferably with glyph ex=\r\namples. It should be sufficient so that software engineers can produce a mi=\r\nnimally acceptable rendering of the characters.&quot;=A0 This seems to indicate =\r\nto me that there can be multiple representations for a single encoding: mul=\r\ntiple glyphs per character.=A0 Indeed, the &quot;Where is my Character?&quot; page on=\r\n the Unicode site (&lt;A href=3D&quot;http://www.unicode.org/standard/where/&quot;&gt;http:=\r\n//www.unicode.org/standard/where/&lt;/A&gt;) makes this very clear.=A0 See &quot;varia=\r\nnt shapes.&quot;&lt;/DIV&gt;&lt;DIV&gt;&lt;BR class=3D&quot;khtml-block-placeholder&quot;&gt;&lt;/DIV&gt;&lt;DIV&gt;&lt;SPA=\r\nN class=3D&quot;Apple-style-span&quot;&gt;What does this all mean?=A0 Well, one effect o=\r\nf only having a single encoding per letter will be that, at first, each cha=\r\nracter will only have one single form and thus the fonts will probably look=\r\n like Junior Quickscript rather than Senior.=A0 However, as Quickscript bec=\r\nomes more accepted and popular, font designers will be able to create more =\r\ncomplex fonts which are able to combine sequences of characters into someth=\r\ning more closely representing Senior Quickscript.=A0 But when that happens,=\r\n older texts (i.e., those encoded in Unicode, but before the complex fonts =\r\nwere created) will &lt;B&gt;&lt;I&gt;not&lt;/I&gt;&lt;SPAN class=3D&quot;Apple-style-span&quot; style=3D&quot;f=\r\nont-weight: normal;&quot;&gt;=A0have to be re-encoded, because the only thing that =\r\nwill change is how the characters are represented.=A0 See the &quot;Ready-made v=\r\nersus composite characters&quot; section of the Wikipedia article, above.&lt;/SPAN&gt;=\r\n&lt;/B&gt;&lt;/SPAN&gt;&lt;/DIV&gt;&lt;DIV&gt;&lt;BR class=3D&quot;khtml-block-placeholder&quot;&gt;&lt;/DIV&gt;&lt;DIV&gt;Edwa=\r\nrd brings up a good suggestion of using the ConScript Unicode Registry as a=\r\n test-bed for Quickscript encoding.=A0 I have looked at it before, and am h=\r\nesitant only because it appears to not have been updated in recent years.=\r\n=A0 However, Michael Everson is known to have gotten several alternate scri=\r\npts (including Shavian) into the Unicode standard, and some of those starte=\r\nd in the ConScript registry.&lt;/DIV&gt;&lt;DIV&gt;&lt;BR class=3D&quot;khtml-block-placeholder=\r\n&quot;&gt;&lt;/DIV&gt;&lt;DIV&gt;If someone wants to take a stab at it, perhaps we can move for=\r\nward with converting an existing Quickscript font to Unicode within the Con=\r\nscript block.=A0 I propose using the character range U+E650 through U+E67F,=\r\n which follows immediately after the &quot;Seussian Latin Extensions&quot; range in t=\r\nhe ConScript (&lt;A href=3D&quot;http://www.evertype.com/standards/csur/seuss.html&quot;=\r\n&gt;http://www.evertype.com/standards/csur/seuss.html&lt;/A&gt;).=A0 To convert an e=\r\nxisting font, one may wish to try the tool FontForge (&lt;A href=3D&quot;http://fon=\r\ntforge.sourceforge.net&quot;&gt;http://fontforge.sourceforge.net&lt;/A&gt;/).=A0 It is an=\r\n excellent free font editing tool which (with a little bit of work) can be =\r\ninstalled on Windows (requires cygwin), Mac OS X (requires X11), or Linux.=\r\n=A0 I should point out that some characters in these fonts should NOT be mo=\r\nved to new locations.=A0 All numbers and punctuation should be left where t=\r\nhey are, as they are already in their correct Unicode placement.=A0 Only th=\r\ne letters (in the QS Unicode proposal) should be moved; and the ligatures c=\r\nan be removed entirely.=A0=A0Once we have an example font in place, we can =\r\nregister it with the conscript (though exactly how I am not sure), and also=\r\n start the &#39;real&#39; Unicode proposal process.=A0 In the meantime, we will be =\r\nable to start playing with mixed Quickscript/standard orthography messages.=\r\n&lt;/DIV&gt;&lt;DIV&gt;&lt;BR class=3D&quot;khtml-block-placeholder&quot;&gt;&lt;/DIV&gt;&lt;DIV&gt;I will try to d=\r\no the font editing exercise myself... but not tonight.=A0 My wife is alread=\r\ny giving me the evil eye to get off of the damned machine.&lt;/DIV&gt;&lt;DIV&gt;&lt;BR cl=\r\nass=3D&quot;khtml-block-placeholder&quot;&gt;&lt;/DIV&gt;&lt;DIV&gt;oliver&lt;TT&gt;&lt;BR&gt;&lt;/TT&gt;&lt;/DIV&gt;&lt;DIV&gt;&lt;B=\r\nR class=3D&quot;khtml-block-placeholder&quot;&gt;&lt;/DIV&gt;&lt;DIV&gt;&lt;SPAN class=3D&quot;Apple-style-s=\r\npan&quot;&gt;&lt;DIV&gt;&lt;/DIV&gt;&lt;/SPAN&gt;&lt;/DIV&gt;&lt;/DIV&gt;&lt;/BODY&gt;&lt;/HTML&gt;\r\n--Apple-Mail-2--896551597--\r\n\n"
}