{
  "userId": 3379436,
  "authorName": "C. Paige Gabhart",
  "from": "&quot;C. Paige Gabhart&quot; &lt;pgabhart@...&gt;",
  "profile": "pgabhart",
  "replyTo": "LIST",
  "senderId": "dpGeVAweYZ2NIDnyY88p8w2FPUrLsRzx2cFGzSw6ZSd4A4om-KcapHmzAPPV2l6NN0C-QoRyRa2ER0-OpcgQGxPeGipViM7HtZQhK-E5rdLX",
  "spamInfo": {
    "isSpam": false,
    "reason": "0"
  },
  "subject": "Re: [Read_Alphabet] Macbeth",
  "postDate": "1014490329",
  "msgId": 73,
  "canDelete": false,
  "contentTrasformed": false,
  "systemMessage": false,
  "headers": {
    "messageIdInHeader": "PDNDNzdFNEQ4LjQ2NkRFNjZEQGNvcmVjb21tLm5ldD4=",
    "referencesHeader": "PDAwNTYwMWMxYmJjYyRlZWZhN2I0MCQwNzA1NjQzZUBiZXJ0aGE+IDwwMDA0MDFjMWJjMGUkMmQ3ZmY4OTAkOTgzMzc4NDFAd2lueHA+"
  },
  "prevInTopic": 72,
  "nextInTopic": 74,
  "prevInTime": 72,
  "nextInTime": 74,
  "topicId": 60,
  "numMessagesInTopic": 30,
  "msgSnippet": "Jon & Ewout: I am not so sure  the idea of a transliterating keyboard driver is a good idea.  It reminds me of training wheels on a bicycle.  When I was five,",
  "messageBody": "<div id=\"ygrps-yiv-1815421638\">\n<html>\nJon&nbsp;&amp; Ewout:\n<p>I am not so sure&nbsp; the idea of a transliterating keyboard driver\nis a good idea.&nbsp; It reminds me of training wheels on a bicycle.&nbsp;\nWhen I was five, I rode my bicycle for a year with training wheels attached\nto the rear wheel.&nbsp; When my father finally took them off, we discovered\nI still did not know how to balance because the training wheels had kept\nme from&nbsp; having to.&nbsp; But after they came off, I learned to ride\nthe same day.\n<p>I don&#39;t want to push this analogy too far, but just in the last few\ndays after posting a few messages and texts in jerome, I have found my\nskill in typing with jerome has advanced&nbsp; fairly quickly.&nbsp; I\nstill have a few letters I have to search for, but it will not take long\nbefore I will be able to type fairly easily in jerome.\n<p>I think it is best to write with Quikscript in mind rather than using\nsome intermediate combination of letters which are then transliterated\nby a driver to produce the symbol you intend.&nbsp;&nbsp; No one thinks\nof a &quot;they&quot; or &quot;thaw&quot; as &quot;dh&quot;, and I feel it adds a needless level of complexity.&nbsp;\nI believe very few people have actually tried to use jerome up to this\npoint so no one has much experience with it.&nbsp; I am a good touch typist\nand never look at the keyboard when I type.&nbsp; I would assume, however,\nthat it is probably more difficult to get used to the jerome keyboard mapping\nfor a person who is not a touch typist since the Quikscript symbols do\nnot appear on the keys.&nbsp; Of course, the way one becomes a touch typist\nis by practice and watching the screen as one types.&nbsp; So I believe\nanyone who is motivated can, with a moderate amount of practice, learn\nto type using the current jerome mapping.\n<p>Of course, in any touch typing, one should use the proper fingers on\nthe appropriate keys, which requires the use of all eight fingers and one\nthumb.&nbsp; I believe the average self-taught typist only uses three or\nfour fingers so their hands are moving all over the keyboard, which makes\nit impossible to type quickly.&nbsp; But there are innumerable typing programs,\nwhich can break them of this improper technique.&nbsp; (I know:&nbsp; it\nwill difficult to tell someone to learn to type first, and then learn jerome\ntouch typing.)&nbsp; I am just voicing my opinion that it is better to\ntouch type in jerome than it is to learn a series of alternate letter combinations\nrepresenting one symbol, and the production of such a driver may lead to\npeople not thinking with Quikscript in mind as they type.&nbsp; And how\nwill that affect how they handwrite in Quikscript in their own daily lives.&nbsp;\nMy concern is that the production of such a driver may actually be a shortcut\nthat is detrimental to these individuals learning and utilizing Quikscript\nin the long run and, thus, will be detrimental to the spread of Quikscript.\n<p>Note:&nbsp; As an interesting historical aside, we have been stuck with\nthe Qwerty keyboard since the early days of typewriters.&nbsp; I read that\nthis ordering of keys was decided upon due to the poor mechanisms of those\ntypewriters:&nbsp; if you activated two keys next to each other too frequently,\nthe mechanism tended to jam.&nbsp; The Qwerty keyboard is actually poorly\ndesigned for fast typing as the vowels, with the exception of &quot;a&quot; are not\non the home key row.&nbsp; Obviously, this makes no sense as the vowels\nare the most used letters and moving your fingers off the home row takes\nmore time.&nbsp; There is an alternative keyboard, Dvorak, which is designed\nmore scientifically.&nbsp; After a touch typist makes the transition to\nDvorak, their typing speed increases approximately 20% just from the improved\nkey positions.&nbsp;&nbsp; Since touch typing involves a connection between\nthe mind and the appropraite finger position on the keyboard, one cannot\nuse both the Qwerty and Dvorak keyboard depending on which is present on\na particular machine.&nbsp; In tests it took approximately two weeks for\na secretary to make the transition to Dvorak.&nbsp; Once she had, she was\nno longer able to type quickly on a Qwerty keyboard.&nbsp; This, coupled\nwith the natural conservatism of businesses and people in general, explains\nthe absolute dominance of Qwerty.&nbsp; The inertia of the mass of people\nwho touch type using Qwerty because that is what has always been available\nhave prevented Dvorak from making any inroads on Qwerty.\n<p>Moving to another point:&nbsp; the problem I see with the present keyboard\nmapping for jerome is that Jon set it up to match the present Shavian mapping\non the theory, I believe, that some of the people interested in Shavian\nwho had already learned the existing Shavian mapping would make the shift\nto Quikscript.&nbsp; I do not see any evidence of that happening on any\nsignificant scale, and the current mapping is not as felicitous for jerome\nas it could be.\n<p>The letters which jerome shares with roman should be set up for the\nsame keys as much as possible to aid the shift from roman to Quikscript&nbsp;&nbsp;\nThere are twenty-six letters on the keyboard,and with the use of the shift\nkey, this gives us fifty-two positions for letters.&nbsp; I believe we\nshould avoid the use of keys currently used for punctuation and other symbols\nunless absolutely necessary.&nbsp; As an example, &quot;wholewheat&quot; is currently\nmapped on the &quot;tilde&quot; key.&nbsp;&nbsp; This is a long stretch for the left\nlittle finger and does not aid fast typing.&nbsp; Because it is a key little\nused in roman typing, it forces me to look at the keyboard, which a touch\ntypist does not want to do.\n<p>Shavian has no half-letters so the Shavian mapping did not have to take\nthat issue into account.&nbsp; Since Quikscript does use half-letters,\nit would make sense to me that those letters should be produced by using\nthe shift key along with the same key that produces the whole letter.&nbsp;\nExample:&nbsp; &quot;peep&quot; mapped to &quot;p&quot;, &quot;half-peep&quot; mapped to shift &quot;p.&quot;&nbsp;\n&quot;Day&quot; and &quot;half-day&quot; to be mapped the same way on &quot;d&quot; and shift &quot;d.&quot;&nbsp;\nAnd so forth.\n<p>Jon, how much trouble would it be to remap a revision of jerome to work\nbetter for Quikscript?&nbsp; I assume that the dificult part in producing\nthe font was setting up the letter shapes and that the key mapping was\na relatively straight forward process.&nbsp; Is this correct?&nbsp; If\nwe made such a revision available on Read_Alphabet, those people prefering\nthe Shavian mapping could continue to use it, and those who prefer an optimized\nQuikscript version could use it.&nbsp; The recepient of a communication\nwill not care how it is mapped.&nbsp;&nbsp; People migrating from the Shavian\ngroup to the Read_Alphabet group could use the mapping they were already\nfamiliar with.&nbsp; Those who are totally new devotees of Quikscript could\nuse the revised mapping.&nbsp; If doing this remapping is not a vast amount\nof trouble, I will work on a remapping scheme to see how the mapping can\nbe improved.&nbsp; I would like to do this before I spend too much more\ntime using the present mapping.\n<p>Aside:&nbsp; I have been working on Hamlet&#39;s soliloquy in Senior Quikscript.&nbsp;\nThe half-letters are working very well.&nbsp; I also believe that some\nof the letters that I thought needed additional work look fine when a 12\npoint font is used.&nbsp; In general, I am very pleased with jerome.\n<p>Sorry this was so long.&nbsp;&nbsp; Sometimes I get started and can&#39;t\nseem to stop.\n<p>All the best to everyone,\n<p>Paige Gabhart\n<br>&nbsp;\n<br>&nbsp;\n<p>Jon Zuck wrote:\n<blockquote><span title=\"qreply\"> <blockquote TYPE=\"CITE\">&nbsp;<tt>Wow, Ewout!&nbsp; This sounds excellent.&nbsp;\nIs there anyone who can create such a</tt>\n<br><tt>driver for us?</tt>\n<p><tt>It sure would make using QS a lot easier.</tt>\n<br>&nbsp;\n<p><tt>Shalom v&#39;Tovah,</tt>\n<p><tt>Jon</tt>\n<br><tt><a rel=\"nofollow\" target=\"_blank\" href=\"http://surf.to/frimmin\">http://surf.to/frimmin</a></tt>\n<br>&nbsp;<tt></tt>\n<p><tt>&gt; If somebody would create a driver, it can be programmed to return\nthe</tt>\n<br><tt>&gt; &#39;they&#39;-symbol when somebody types &#39;dh&#39;. Two letters become one,\nbut it</tt>\n<br><tt>would</tt>\n<br><tt>&gt; indeed NOT require you to learn any keyboard map. You can just\ntype a</tt>\n<br><tt>roman</tt>\n<br><tt>&gt; reform and get proper quikscript returned.</tt>\n<br><tt>&gt;</tt>\n<br><tt>&gt; But someone will have to program this driver first. I certainly\ndon&#39;t have</tt>\n<br><tt>&gt; the time/knowledge (yet) to do so.</tt>\n<br><tt>&gt;</tt>\n<br><tt>&gt; Ewout</tt>\n<br><tt>&gt;&gt;</tt>\n<br>\n<br><tt></tt>&nbsp;</p></blockquote>\n</span></blockquote></html>\n</div>",
  "specialLinks": [],
  "rawEmail": "Return-Path: &lt;pgabhart@...&gt;\r\nX-Sender: pgabhart@...\r\nX-Apparently-To: Read_Alphabet@yahoogroups.com\r\nReceived: (EGP: unknown); 23 Feb 2002 18:42:22 -0000\r\nReceived: (qmail 25114 invoked from network); 23 Feb 2002 18:42:22 -0000\r\nReceived: from unknown (216.115.97.172)\n  by m2.grp.snv.yahoo.com with QMQP; 23 Feb 2002 18:42:22 -0000\r\nReceived: from unknown (HELO mail4.mx.voyager.net) (216.93.66.203)\n  by mta2.grp.snv.yahoo.com with SMTP; 23 Feb 2002 18:42:22 -0000\r\nReceived: from corecomm.net (d58.as0.lsvl.ky.voyager.net [216.127.12.59])\n\tby mail4.mx.voyager.net (8.11.6/8.10.2) with ESMTP id g1NIdPn89529\n\tfor &lt;Read_Alphabet@yahoogroups.com&gt;; Sat, 23 Feb 2002 13:39:25 -0500 (EST)\r\nSender: pgabhart@...\r\nMessage-ID: &lt;3C77E4D8.466DE66D@...&gt;\r\nDate: Sat, 23 Feb 2002 13:52:09 -0500\r\nX-Mailer: Mozilla 4.75 [en] (X11; U; Linux 2.2.16-22 i586)\r\nX-Accept-Language: en\r\nMIME-Version: 1.0\r\nTo: Read_Alphabet@yahoogroups.com\r\nSubject: Re: [Read_Alphabet] Macbeth\r\nReferences: &lt;005601c1bbcc$eefa7b40$0705643e@bertha&gt; &lt;000401c1bc0e$2d7ff890$98337841@winxp&gt;\r\nContent-Type: multipart/alternative;\n boundary=&quot;------------FE54B92142BDE4924B4AD72B&quot;\r\nFrom: &quot;C. Paige Gabhart&quot; &lt;pgabhart@...&gt;\r\nX-Yahoo-Group-Post: member; u=3379436\r\nX-Yahoo-Profile: pgabhart\r\n\r\n\r\n--------------FE54B92142BDE4924B4AD72B\r\nContent-Type: text/plain; charset=us-ascii\r\nContent-Transfer-Encoding: 7bit\r\n\r\nJon & Ewout:\n\nI am not so sure  the idea of a transliterating keyboard driver is a\ngood idea.  It reminds me of training wheels on a bicycle.  When I was\nfive, I rode my bicycle for a year with training wheels attached to the\nrear wheel.  When my father finally took them off, we discovered I still\ndid not know how to balance because the training wheels had kept me\nfrom  having to.  But after they came off, I learned to ride the same\nday.\n\nI don&#39;t want to push this analogy too far, but just in the last few days\nafter posting a few messages and texts in jerome, I have found my skill\nin typing with jerome has advanced  fairly quickly.  I still have a few\nletters I have to search for, but it will not take long before I will be\nable to type fairly easily in jerome.\n\nI think it is best to write with Quikscript in mind rather than using\nsome intermediate combination of letters which are then transliterated\nby a driver to produce the symbol you intend.   No one thinks of a\n&quot;they&quot; or &quot;thaw&quot; as &quot;dh&quot;, and I feel it adds a needless level of\ncomplexity.  I believe very few people have actually tried to use jerome\nup to this point so no one has much experience with it.  I am a good\ntouch typist and never look at the keyboard when I type.  I would\nassume, however, that it is probably more difficult to get used to the\njerome keyboard mapping for a person who is not a touch typist since the\nQuikscript symbols do not appear on the keys.  Of course, the way one\nbecomes a touch typist is by practice and watching the screen as one\ntypes.  So I believe anyone who is motivated can, with a moderate amount\nof practice, learn to type using the current jerome mapping.\n\nOf course, in any touch typing, one should use the proper fingers on the\nappropriate keys, which requires the use of all eight fingers and one\nthumb.  I believe the average self-taught typist only uses three or four\nfingers so their hands are moving all over the keyboard, which makes it\nimpossible to type quickly.  But there are innumerable typing programs,\nwhich can break them of this improper technique.  (I know:  it will\ndifficult to tell someone to learn to type first, and then learn jerome\ntouch typing.)  I am just voicing my opinion that it is better to touch\ntype in jerome than it is to learn a series of alternate letter\ncombinations representing one symbol, and the production of such a\ndriver may lead to people not thinking with Quikscript in mind as they\ntype.  And how will that affect how they handwrite in Quikscript in\ntheir own daily lives.  My concern is that the production of such a\ndriver may actually be a shortcut that is detrimental to these\nindividuals learning and utilizing Quikscript in the long run and, thus,\nwill be detrimental to the spread of Quikscript.\n\nNote:  As an interesting historical aside, we have been stuck with the\nQwerty keyboard since the early days of typewriters.  I read that this\nordering of keys was decided upon due to the poor mechanisms of those\ntypewriters:  if you activated two keys next to each other too\nfrequently, the mechanism tended to jam.  The Qwerty keyboard is\nactually poorly designed for fast typing as the vowels, with the\nexception of &quot;a&quot; are not on the home key row.  Obviously, this makes no\nsense as the vowels are the most used letters and moving your fingers\noff the home row takes more time.  There is an alternative keyboard,\nDvorak, which is designed more scientifically.  After a touch typist\nmakes the transition to Dvorak, their typing speed increases\napproximately 20% just from the improved key positions.   Since touch\ntyping involves a connection between the mind and the appropraite finger\nposition on the keyboard, one cannot use both the Qwerty and Dvorak\nkeyboard depending on which is present on a particular machine.  In\ntests it took approximately two weeks for a secretary to make the\ntransition to Dvorak.  Once she had, she was no longer able to type\nquickly on a Qwerty keyboard.  This, coupled with the natural\nconservatism of businesses and people in general, explains the absolute\ndominance of Qwerty.  The inertia of the mass of people who touch type\nusing Qwerty because that is what has always been available have\nprevented Dvorak from making any inroads on Qwerty.\n\nMoving to another point:  the problem I see with the present keyboard\nmapping for jerome is that Jon set it up to match the present Shavian\nmapping on the theory, I believe, that some of the people interested in\nShavian who had already learned the existing Shavian mapping would make\nthe shift to Quikscript.  I do not see any evidence of that happening on\nany significant scale, and the current mapping is not as felicitous for\njerome as it could be.\n\nThe letters which jerome shares with roman should be set up for the same\nkeys as much as possible to aid the shift from roman to Quikscript\nThere are twenty-six letters on the keyboard,and with the use of the\nshift key, this gives us fifty-two positions for letters.  I believe we\nshould avoid the use of keys currently used for punctuation and other\nsymbols unless absolutely necessary.  As an example, &quot;wholewheat&quot; is\ncurrently mapped on the &quot;tilde&quot; key.   This is a long stretch for the\nleft little finger and does not aid fast typing.  Because it is a key\nlittle used in roman typing, it forces me to look at the keyboard, which\na touch typist does not want to do.\n\nShavian has no half-letters so the Shavian mapping did not have to take\nthat issue into account.  Since Quikscript does use half-letters, it\nwould make sense to me that those letters should be produced by using\nthe shift key along with the same key that produces the whole letter.\nExample:  &quot;peep&quot; mapped to &quot;p&quot;, &quot;half-peep&quot; mapped to shift &quot;p.&quot;  &quot;Day&quot;\nand &quot;half-day&quot; to be mapped the same way on &quot;d&quot; and shift &quot;d.&quot;  And so\nforth.\n\nJon, how much trouble would it be to remap a revision of jerome to work\nbetter for Quikscript?  I assume that the dificult part in producing the\nfont was setting up the letter shapes and that the key mapping was a\nrelatively straight forward process.  Is this correct?  If we made such\na revision available on Read_Alphabet, those people prefering the\nShavian mapping could continue to use it, and those who prefer an\noptimized Quikscript version could use it.  The recepient of a\ncommunication will not care how it is mapped.   People migrating from\nthe Shavian group to the Read_Alphabet group could use the mapping they\nwere already familiar with.  Those who are totally new devotees of\nQuikscript could use the revised mapping.  If doing this remapping is\nnot a vast amount of trouble, I will work on a remapping scheme to see\nhow the mapping can be improved.  I would like to do this before I spend\ntoo much more time using the present mapping.\n\nAside:  I have been working on Hamlet&#39;s soliloquy in Senior Quikscript.\nThe half-letters are working very well.  I also believe that some of the\nletters that I thought needed additional work look fine when a 12 point\nfont is used.  In general, I am very pleased with jerome.\n\nSorry this was so long.   Sometimes I get started and can&#39;t seem to\nstop.\n\nAll the best to everyone,\n\nPaige Gabhart\n\n\n\nJon Zuck wrote:\n\n&gt;  Wow, Ewout!  This sounds excellent.  Is there anyone who can create\n&gt; such a\n&gt; driver for us?\n&gt;\n&gt; It sure would make using QS a lot easier.\n&gt;\n&gt;\n&gt; Shalom v&#39;Tovah,\n&gt;\n&gt; Jon\n&gt; http://surf.to/frimmin\n&gt;\n&gt;\n&gt; &gt; If somebody would create a driver, it can be programmed to return\n&gt; the\n&gt; &gt; &#39;they&#39;-symbol when somebody types &#39;dh&#39;. Two letters become one, but\n&gt; it\n&gt; would\n&gt; &gt; indeed NOT require you to learn any keyboard map. You can just type\n&gt; a\n&gt; roman\n&gt; &gt; reform and get proper quikscript returned.\n&gt; &gt;\n&gt; &gt; But someone will have to program this driver first. I certainly\n&gt; don&#39;t have\n&gt; &gt; the time/knowledge (yet) to do so.\n&gt; &gt;\n&gt; &gt; Ewout\n&gt; &gt;&gt;\n&gt;                    Yahoo! Groups Sponsor\n                        ADVERTISEMENT\n\n\n&gt;\n&gt;\n\r\n--------------FE54B92142BDE4924B4AD72B\r\nContent-Type: multipart/related;\n boundary=&quot;------------31E02C620BAB2903A2DB6232&quot;\r\n\r\n\r\n--------------31E02C620BAB2903A2DB6232\r\nContent-Type: text/html; charset=us-ascii\r\nContent-Transfer-Encoding: 7bit\r\n\r\n&lt;!doctype html public &quot;-//w3c//dtd html 4.0 transitional//en&quot;&gt;\n&lt;html&gt;\nJon&nbsp;&amp; Ewout:\n&lt;p&gt;I am not so sure&nbsp; the idea of a transliterating keyboard driver\nis a good idea.&nbsp; It reminds me of training wheels on a bicycle.&nbsp;\nWhen I was five, I rode my bicycle for a year with training wheels attached\nto the rear wheel.&nbsp; When my father finally took them off, we discovered\nI still did not know how to balance because the training wheels had kept\nme from&nbsp; having to.&nbsp; But after they came off, I learned to ride\nthe same day.\n&lt;p&gt;I don&#39;t want to push this analogy too far, but just in the last few\ndays after posting a few messages and texts in jerome, I have found my\nskill in typing with jerome has advanced&nbsp; fairly quickly.&nbsp; I\nstill have a few letters I have to search for, but it will not take long\nbefore I will be able to type fairly easily in jerome.\n&lt;p&gt;I think it is best to write with Quikscript in mind rather than using\nsome intermediate combination of letters which are then transliterated\nby a driver to produce the symbol you intend.&nbsp;&nbsp; No one thinks\nof a &quot;they&quot; or &quot;thaw&quot; as &quot;dh&quot;, and I feel it adds a needless level of complexity.&nbsp;\nI believe very few people have actually tried to use jerome up to this\npoint so no one has much experience with it.&nbsp; I am a good touch typist\nand never look at the keyboard when I type.&nbsp; I would assume, however,\nthat it is probably more difficult to get used to the jerome keyboard mapping\nfor a person who is not a touch typist since the Quikscript symbols do\nnot appear on the keys.&nbsp; Of course, the way one becomes a touch typist\nis by practice and watching the screen as one types.&nbsp; So I believe\nanyone who is motivated can, with a moderate amount of practice, learn\nto type using the current jerome mapping.\n&lt;p&gt;Of course, in any touch typing, one should use the proper fingers on\nthe appropriate keys, which requires the use of all eight fingers and one\nthumb.&nbsp; I believe the average self-taught typist only uses three or\nfour fingers so their hands are moving all over the keyboard, which makes\nit impossible to type quickly.&nbsp; But there are innumerable typing programs,\nwhich can break them of this improper technique.&nbsp; (I know:&nbsp; it\nwill difficult to tell someone to learn to type first, and then learn jerome\ntouch typing.)&nbsp; I am just voicing my opinion that it is better to\ntouch type in jerome than it is to learn a series of alternate letter combinations\nrepresenting one symbol, and the production of such a driver may lead to\npeople not thinking with Quikscript in mind as they type.&nbsp; And how\nwill that affect how they handwrite in Quikscript in their own daily lives.&nbsp;\nMy concern is that the production of such a driver may actually be a shortcut\nthat is detrimental to these individuals learning and utilizing Quikscript\nin the long run and, thus, will be detrimental to the spread of Quikscript.\n&lt;p&gt;Note:&nbsp; As an interesting historical aside, we have been stuck with\nthe Qwerty keyboard since the early days of typewriters.&nbsp; I read that\nthis ordering of keys was decided upon due to the poor mechanisms of those\ntypewriters:&nbsp; if you activated two keys next to each other too frequently,\nthe mechanism tended to jam.&nbsp; The Qwerty keyboard is actually poorly\ndesigned for fast typing as the vowels, with the exception of &quot;a&quot; are not\non the home key row.&nbsp; Obviously, this makes no sense as the vowels\nare the most used letters and moving your fingers off the home row takes\nmore time.&nbsp; There is an alternative keyboard, Dvorak, which is designed\nmore scientifically.&nbsp; After a touch typist makes the transition to\nDvorak, their typing speed increases approximately 20% just from the improved\nkey positions.&nbsp;&nbsp; Since touch typing involves a connection between\nthe mind and the appropraite finger position on the keyboard, one cannot\nuse both the Qwerty and Dvorak keyboard depending on which is present on\na particular machine.&nbsp; In tests it took approximately two weeks for\na secretary to make the transition to Dvorak.&nbsp; Once she had, she was\nno longer able to type quickly on a Qwerty keyboard.&nbsp; This, coupled\nwith the natural conservatism of businesses and people in general, explains\nthe absolute dominance of Qwerty.&nbsp; The inertia of the mass of people\nwho touch type using Qwerty because that is what has always been available\nhave prevented Dvorak from making any inroads on Qwerty.\n&lt;p&gt;Moving to another point:&nbsp; the problem I see with the present keyboard\nmapping for jerome is that Jon set it up to match the present Shavian mapping\non the theory, I believe, that some of the people interested in Shavian\nwho had already learned the existing Shavian mapping would make the shift\nto Quikscript.&nbsp; I do not see any evidence of that happening on any\nsignificant scale, and the current mapping is not as felicitous for jerome\nas it could be.\n&lt;p&gt;The letters which jerome shares with roman should be set up for the\nsame keys as much as possible to aid the shift from roman to Quikscript&nbsp;&nbsp;\nThere are twenty-six letters on the keyboard,and with the use of the shift\nkey, this gives us fifty-two positions for letters.&nbsp; I believe we\nshould avoid the use of keys currently used for punctuation and other symbols\nunless absolutely necessary.&nbsp; As an example, &quot;wholewheat&quot; is currently\nmapped on the &quot;tilde&quot; key.&nbsp;&nbsp; This is a long stretch for the left\nlittle finger and does not aid fast typing.&nbsp; Because it is a key little\nused in roman typing, it forces me to look at the keyboard, which a touch\ntypist does not want to do.\n&lt;p&gt;Shavian has no half-letters so the Shavian mapping did not have to take\nthat issue into account.&nbsp; Since Quikscript does use half-letters,\nit would make sense to me that those letters should be produced by using\nthe shift key along with the same key that produces the whole letter.&nbsp;\nExample:&nbsp; &quot;peep&quot; mapped to &quot;p&quot;, &quot;half-peep&quot; mapped to shift &quot;p.&quot;&nbsp;\n&quot;Day&quot; and &quot;half-day&quot; to be mapped the same way on &quot;d&quot; and shift &quot;d.&quot;&nbsp;\nAnd so forth.\n&lt;p&gt;Jon, how much trouble would it be to remap a revision of jerome to work\nbetter for Quikscript?&nbsp; I assume that the dificult part in producing\nthe font was setting up the letter shapes and that the key mapping was\na relatively straight forward process.&nbsp; Is this correct?&nbsp; If\nwe made such a revision available on Read_Alphabet, those people prefering\nthe Shavian mapping could continue to use it, and those who prefer an optimized\nQuikscript version could use it.&nbsp; The recepient of a communication\nwill not care how it is mapped.&nbsp;&nbsp; People migrating from the Shavian\ngroup to the Read_Alphabet group could use the mapping they were already\nfamiliar with.&nbsp; Those who are totally new devotees of Quikscript could\nuse the revised mapping.&nbsp; If doing this remapping is not a vast amount\nof trouble, I will work on a remapping scheme to see how the mapping can\nbe improved.&nbsp; I would like to do this before I spend too much more\ntime using the present mapping.\n&lt;p&gt;Aside:&nbsp; I have been working on Hamlet&#39;s soliloquy in Senior Quikscript.&nbsp;\nThe half-letters are working very well.&nbsp; I also believe that some\nof the letters that I thought needed additional work look fine when a 12\npoint font is used.&nbsp; In general, I am very pleased with jerome.\n&lt;p&gt;Sorry this was so long.&nbsp;&nbsp; Sometimes I get started and can&#39;t\nseem to stop.\n&lt;p&gt;All the best to everyone,\n&lt;p&gt;Paige Gabhart\n&lt;br&gt;&nbsp;\n&lt;br&gt;&nbsp;\n&lt;p&gt;Jon Zuck wrote:\n&lt;blockquote TYPE=CITE&gt;&nbsp;&lt;tt&gt;Wow, Ewout!&nbsp; This sounds excellent.&nbsp;\nIs there anyone who can create such a&lt;/tt&gt;\n&lt;br&gt;&lt;tt&gt;driver for us?&lt;/tt&gt;\n&lt;p&gt;&lt;tt&gt;It sure would make using QS a lot easier.&lt;/tt&gt;\n&lt;br&gt;&nbsp;\n&lt;p&gt;&lt;tt&gt;Shalom v&#39;Tovah,&lt;/tt&gt;\n&lt;p&gt;&lt;tt&gt;Jon&lt;/tt&gt;\n&lt;br&gt;&lt;tt&gt;&lt;a href=&quot;http://surf.to/frimmin&quot;&gt;http://surf.to/frimmin&lt;/a&gt;&lt;/tt&gt;\n&lt;br&gt;&nbsp;&lt;tt&gt;&lt;/tt&gt;\n&lt;p&gt;&lt;tt&gt;&gt; If somebody would create a driver, it can be programmed to return\nthe&lt;/tt&gt;\n&lt;br&gt;&lt;tt&gt;&gt; &#39;they&#39;-symbol when somebody types &#39;dh&#39;. Two letters become one,\nbut it&lt;/tt&gt;\n&lt;br&gt;&lt;tt&gt;would&lt;/tt&gt;\n&lt;br&gt;&lt;tt&gt;&gt; indeed NOT require you to learn any keyboard map. You can just\ntype a&lt;/tt&gt;\n&lt;br&gt;&lt;tt&gt;roman&lt;/tt&gt;\n&lt;br&gt;&lt;tt&gt;&gt; reform and get proper quikscript returned.&lt;/tt&gt;\n&lt;br&gt;&lt;tt&gt;&gt;&lt;/tt&gt;\n&lt;br&gt;&lt;tt&gt;&gt; But someone will have to program this driver first. I certainly\ndon&#39;t have&lt;/tt&gt;\n&lt;br&gt;&lt;tt&gt;&gt; the time/knowledge (yet) to do so.&lt;/tt&gt;\n&lt;br&gt;&lt;tt&gt;&gt;&lt;/tt&gt;\n&lt;br&gt;&lt;tt&gt;&gt; Ewout&lt;/tt&gt;\n&lt;br&gt;&lt;tt&gt;&gt;&gt;&lt;/tt&gt;\n&lt;br&gt;\n&lt;br&gt;&lt;tt&gt;&lt;/tt&gt;&nbsp;&lt;/blockquote&gt;\n&lt;/html&gt;\n\r\n--------------31E02C620BAB2903A2DB6232\r\nContent-Type: image/gif\r\nContent-ID: &lt;part1.3C77E4D8.E43FF147@...&gt;\r\nContent-Disposition: inline; filename=&quot;/tmp/nsmail3C77E4D806C3464.gif&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--------------31E02C620BAB2903A2DB6232\r\nContent-Type: image/gif\r\nContent-ID: &lt;part2.3C77E4D8.E43FF147@...&gt;\r\nContent-Disposition: inline; filename=&quot;/tmp/nsmail3C77E4D806D3464.gif&quot;\r\n\r\n[ Attachment content not displayed ]\r\n--------------31E02C620BAB2903A2DB6232--\r\n\n\r\n--------------FE54B92142BDE4924B4AD72B--\r\n\n"
}