{
  "userId": 833140,
  "authorName": "Jon Zuck",
  "from": "&quot;Jon Zuck&quot; &lt;frimmin@...&gt;",
  "profile": "frimmin",
  "replyTo": "LIST",
  "senderId": "s-Lodux-zHwS9jXhfpqi9_Aom0toPd_EvcmxIYmu9eodxcY7OseCX1Uw5asI2q5ujCE8WIpkVgWhyvP-wX6l5IyNyNg",
  "spamInfo": {
    "isSpam": false,
    "reason": "0"
  },
  "subject": "Re: [Read_Alphabet] Macbeth",
  "postDate": "1014577309",
  "msgId": 74,
  "canDelete": false,
  "contentTrasformed": false,
  "systemMessage": false,
  "headers": {
    "messageIdInHeader": "PDAwNTgwMWMxYmQ2NSRlNGYyZDJiMCQ2YTMzNzg0MUB3aW54cD4=",
    "referencesHeader": "PDAwNTYwMWMxYmJjYyRlZWZhN2I0MCQwNzA1NjQzZUBiZXJ0aGE+IDwwMDA0MDFjMWJjMGUkMmQ3ZmY4OTAkOTgzMzc4NDFAd2lueHA+IDwzQzc3RTREOC40NjZERTY2REBjb3JlY29tbS5uZXQ+"
  },
  "prevInTopic": 73,
  "nextInTopic": 75,
  "prevInTime": 73,
  "nextInTime": 75,
  "topicId": 60,
  "numMessagesInTopic": 30,
  "msgSnippet": "Thanks for your thoughts, Paige. I m afraid that I have to disagree about the virtues of a transliterating keyboard driver:  It is not optional, it is",
  "messageBody": "<div id=\"ygrps-yiv-15145075\">\n<html><head>\n \n \n<style></style>\n</head>\n \n<div><font face=\"Arial\" size=\"2\">Thanks for your <font\n face=\"DotumChe\">thoughts</font>, Paige.</font></div>\n<div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\">I&#39;m afraid that I have to disagree about the \nvirtues of a transliterating keyboard driver:&nbsp; It is not optional, \n<strong>it is essential!</strong>&nbsp; Even if you say that you are able to \ntype &quot;fairly quickly&quot; in Jerome, I doubt you could do it well enough to be hired \nas an administrative assistant for a Read Alphabet-based office!&nbsp; I&#39;m \nthinking like&nbsp;a good 40-55 words per minute;&nbsp;This isn&#39;t attainable, \nbecause too many keys are on capitals.&nbsp;Forget the word &quot;transliterating.&quot; \n</font><font face=\"Arial\" size=\"2\">The&nbsp;keyboard driver is simply the way \nkeyboard must work in any language.&nbsp;Consider the fact that with upper case, \nwe use 52 letters in English on 26 keys- our keyboard drivers interpret SHIFT + \n(letter) as a signal to put down a completely different symbol.&nbsp; And in the \nmany countries of the world, where there are far more characters than keys, \nE.g., China, Japan, Thailand, India, etc.,&nbsp;several keystrokes are used to \ncreate a single complete character.&nbsp;This is always the case in Chinese and \nJapanese, where the elements of the radical characters are specified by single \nkeystrokes, and drivers recognize combinations&nbsp;to create&nbsp;radical and \nmore complex characters.&nbsp;Some of those languages, like Thai and Hindi, can \npresent a trucated form of the writing&nbsp;(for example, omitting vowels, which \nare integrated into the shape of the complete character) by using simple \nkeystrokes, but the <em>full </em>script must use multiple keys to create \ncomplete characters with the loops and flourishes which indicate vowels.&nbsp; \nSemitic languages, like Hebrew and Arabic are a bit better off, since they \nnormally <em>are</em> written without vowels, but the inclusion of the vowel of \ncourse, requires another letter keystroke.&nbsp; Nearly half of the world&#39;s \npopulation uses non-Roman-based writing systems.&nbsp; You can bet that if \nthey&#39;re not hitting alt, shift, control all the time, they&#39;re hitting other \ncombinations of characters a lot to flesh out the writing.&nbsp; Even many \nEuropean languages had to use backspace + (accent) on the typewriter to get all \nof their letters to appear correctly, since some Slavic languages can put an \naccent over almost every character.&nbsp; The computer keyboard eliminates some \nof that awkwardness, you can keep going forward, and the keyboard can recognize \na letter combination a signifying an accented letter. Esperantists usually use \nan x or an h to signify the accent, with h being the easier combination to \ntype.</font></div>\n<div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\">Or consider it this way: Stop thinking of the \ncapital letters as &quot;places&quot; on the keyboard, and think about the actions that \nare required to produce a letter.&nbsp; With only 26 letter keys, multiple \nkeystrokes are going to be needed to&nbsp;produce most of the characters in a \n62-character alphabet.&nbsp; We&#39;re using the &quot;Shift +&quot; combination to do almost \neverything, when a simpler solution, not requiring the poor lil&#39; ol pinky to do \nthat work would be to simply type a logical character \ncombination.&nbsp;</font></div>\n<div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\">Re Dvorak:&nbsp; I&#39;m the only person I know who \nactually tried it, and that was twice, as a matter of fact.&nbsp; The second \ntime was last year, and I converted my Windows systems both at home and work to \nthe Dvorak schema.&nbsp; I liked the more logical arrangement of the keys, and I \ndefinitely did get up to &quot;fairly quick&quot; typing with it, in the neighborhood of \n30 words per minute.&nbsp; But I abandoned it after about six months because I \ncouldn&#39;t break that barrier, and on Qwerty, I can do 55 wpm easily.&nbsp; I \nfigured 6 months was adequate time for a trial! Dvorak has its own illogical \nparts too, like R and L being under the weakest fingers, and A being under a \nweak finger while U gets the prime real estate.&nbsp; After my two shots at it, \nI think that in a non-Qwerty-biased world, it would be a&nbsp;superior \nalternative for someone who is just learning to type or one who has never \nachieved good speed with Qwerty.</font></div>\n<div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n<blockquote><span title=\"ireply\"> <div>&gt;No one thinks of a &quot;they&quot; or &quot;thaw&quot; as &quot;dh&quot;, and I feel it adds a \n </div></span></blockquote>needless level of complexity.&nbsp;\n<div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\">Since in Senior QS we have the blessing(?) of THREE \n&quot;th&#39;s&quot; Thoth, Thither, and Other <font face=\"jerome\">(T, H, K),&nbsp; </font><font\n face=\"Arial\">I think the easily remembered digraphs of <strong>th</strong>, \n<strong>dh</strong>, and&nbsp;<strong>xdh</strong> would greatly simplify \nmatters.&nbsp; It seems a lot more sensible to me than Shift+T, Shift+H, and \nShift +K, which we have now. It would be a slight&nbsp;exaggeration to say that \nI think in terms of&nbsp; &quot;dh&quot; sounds, but as soon as one begins learning the \nsounds of the language, th and dh is a fairly common way of differentiating \nbetween the Thoth and Thither sounds in Roman letters. And the less unnecessary \nuse of the Shift key, the faster and easier it goes for everyone. Another \npossible benefit of the transliterating driver would be that we could put the \nslash back where it belongs, and have the driver intelligently print a namer dot \nwhen it encounters a initial capital letter.&nbsp; Thus, we could actually write \nthings like and/or again without having to remember where the slash went, and \nthe Shift key goes back to it&#39;s reasons for living--indicating capitals and \npunctuation, not letters.&nbsp; Let letters and letter-combinations create \nletters, and Shift do punctuation selection, not letter \nselection.</font></font></div>\n<div><font face=\"Arial\" size=\"2\"><font face=\"Arial\"></font></font>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\"><font face=\"Arial\"></font></font>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\"><font face=\"Arial\">That way, NO&nbsp;Read characters \nwould have to be mapped onto punctuation keys, capitalization comes from natural \nuse of the Shift key, and no punctuation marks are eliminated or even \nmoved.&nbsp; </font></font></div>\n<div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\">Shush, Zhivago, Thoth, Thither and Church can be \ntyped very naturally as <strong>sh, zh, th, dh, ch</strong>, which should be \nsignificantly easier to remember, and much easier to type than&nbsp;Cap S, Cap \nZ, Cap T, Cap H, small c!&nbsp; They&nbsp;all occur in English except \nfor&nbsp;dh, which once learned, won&#39;t be confused for anything else, and is \nquite intuitive.&nbsp; Th is to dh, as t is to d, as tall is to deep, \nas&nbsp;unvoiced is to voiced.&nbsp;Inkling is usually represented in Roman by \n<strong>ng, </strong>which will do nicely.&nbsp; The&nbsp;alternate \nforms,&nbsp;Noon, Up, and Other, could be designated by an x, which would be \nimpossible to confuse in Shavian letters with any other meaning. Thus, \n<strong>xn,</strong> <strong>xa, xdh, </strong>or something similar.&nbsp;Again, \neasily remembered, x signifying&nbsp;&quot;alternative form.&quot;&nbsp;The half-letters \ncould be flagged by something else: say an initial h, which would give \n<strong>hw, hwh, hd, hz, ht, hp, hy, hh. </strong>Easily remembed: The \nhalf-letters are flagged by an initial h, for &quot;half&quot;.</font></div>\n<div><font face=\"Arial\" size=\"2\"></font><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\">Finally, I heartily agree that the keyboard mapping \ncan be improved.&nbsp; It shouldn&#39;t be too difficult for me to create something \na little more logical.&nbsp; And I COMPLETELY agree that Read characters \nshouldn&#39;t be displacing punctuation symbols, no matter how infrequently \nused.&nbsp; The problem is simple: 62 characters vs. an overwhelmed 26 letter \nkeys.&nbsp; As long as one is stuck with a mapping paradigm, the more letters, \nthe more illogical placements (I really didn&#39;t WANT to put Other on Cap \nK!)</font></div>\n<div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\">Although I love them, In QS,&nbsp;the ligatures are \nnot necessary. eliminating them brings us down to 55 characters, still&nbsp;3 \nover the letter key and SHIFT + letter key maximum.&nbsp; The namer dot must \nstay on a key until we can get a Shavian driver to input it logically. Even \nthen, it would be desirable to have a true place for it, to indicate it out of \ncontext, as a symbol per se.. The two most logical candidates to go&nbsp;are \nRead&#39;s Gaelic letters, which are a concession to Scottish, not English. One more \nmust go.&nbsp; What to do, what to do!</font></div>\n<div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\">I won&#39;t ask you to part&nbsp;with half-Yo and \nhalf-wheat, Paige; you brilliantly extended Read&#39;s own logic here.&nbsp; While \nRead seems to want to include the X&#39;s, I think one at least with have to go. You \ndon&#39;t like them, I do, but we&#39;ve got to make some room somewhere.&nbsp; I&#39;ll \nsacrifice them--maybe put them into somewhere in the extended character set, \nlike ALT + 0244 or something.&nbsp; </font></div>\n<div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\">There, we&#39;ve got the room now, but the vowels will \nnever make sense, sinse there&#39;s 15 unique Shavian letters for vowels and 5 \nappropriate keys.&nbsp; I&#39;ll do the best I can, and it&nbsp;WILL be better than \nwhat we&#39;ve had, but I consider this only a Band-Aid solution before a keyboard \ndriver for the alphabet can be created.&nbsp; Give me a few weeks, OK?&nbsp; \nI&#39;ve got a lot of pans in the fire, right now, a lot!</font></div>\n<div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n<div>Shalom v&#39;Tovah,</div>\n<div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n<div>Jon &nbsp;<br><a rel=\"nofollow\"\n target=\"_blank\" href=\"http://surf.to/frimmin\">http://surf.to/frimmin</a></div>\n<div>&nbsp;</div>\n<div>It is more necessary to love much than to think much;<br>always do that \nwhich impels you most to love.</div>\n<div>&nbsp;</div>\n<div>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; --St. Teresa of Avila, The \nInterior Castle</div>\n<blockquote><span title=\"qreply\"> <blockquote dir=\"ltr\"\n style=\"PADDING-RIGHT:0px;PADDING-LEFT:5px;MARGIN-LEFT:5px;BORDER-LEFT:#000000 2px solid;MARGIN-RIGHT:0px;\">\n  <div style=\"FONT:10pt arial;\">----- Original Message ----- </div>\n  <div\n style=\"BACKGROUND:#e4e4e4;FONT:10pt arial;\"><b>From:</b> \n  <a rel=\"nofollow\" title=\"pgabhart@...\" target=\"_blank\" href=\"mailto:pgabhart@...\">C. Paige \n  Gabhart</a> </div>\n  <div style=\"FONT:10pt arial;\"><b>To:</b> <a rel=\"nofollow\"\n title=\"Read_Alphabet@yahoogroups.com\"\n target=\"_blank\" href=\"mailto:Read_Alphabet@yahoogroups.com\">Read_Alphabet@yahoogroups.com</a> \n  </div>\n  <div style=\"FONT:10pt arial;\"><b>Sent:</b> Saturday, February 23, 2002 1:52 \n  PM</div>\n  <div style=\"FONT:10pt arial;\"><b>Subject:</b> Re: [Read_Alphabet] \nMacbeth</div>\n  <div><br></div>Jon&nbsp;&amp; Ewout: \n  <p>I am not so sure&nbsp; the idea of a transliterating keyboard driver is a \n  good idea.&nbsp; It reminds me of training wheels on a bicycle.&nbsp; When I \n  was five, I rode my bicycle for a year with training wheels attached to the \n  rear wheel.&nbsp; When my father finally took them off, we discovered I still \n  did not know how to balance because the training wheels had kept me from&nbsp; \n  having to.&nbsp; But after they came off, I learned to ride the same day. \n  <p>I don&#39;t want to push this analogy too far, but just in the last few days \n  after posting a few messages and texts in jerome, I have found my skill in \n  typing with jerome has advanced&nbsp; fairly quickly.&nbsp; I still have a few \n  letters I have to search for, but it will not take long before I will be able \n  to type fairly easily in jerome. \n  <p>I think it is best to write with Quikscript in mind rather than using some \n  intermediate combination of letters which are then transliterated by a driver \n  to produce the symbol you intend.&nbsp;&nbsp;&nbsp; I believe very few people \n  have actually tried to use jerome up to this point so no one has much \n  experience with it.&nbsp; I am a good touch typist and never look at the \n  keyboard when I type.&nbsp; I would assume, however, that it is probably more \n  difficult to get used to the jerome keyboard mapping for a person who is not a \n  touch typist since the Quikscript symbols do not appear on the keys.&nbsp; Of \n  course, the way one becomes a touch typist is by practice and watching the \n  screen as one types.&nbsp; So I believe anyone who is motivated can, with a \n  moderate amount of practice, learn to type using the current jerome mapping. \n  <p>Of course, in any touch typing, one should use the proper fingers on the \n  appropriate keys, which requires the use of all eight fingers and one \n  thumb.&nbsp; I believe the average self-taught typist only uses three or four \n  fingers so their hands are moving all over the keyboard, which makes it \n  impossible to type quickly.&nbsp; But there are innumerable typing programs, \n  which can break them of this improper technique.&nbsp; (I know:&nbsp; it will \n  difficult to tell someone to learn to type first, and then learn jerome touch \n  typing.)&nbsp; I am just voicing my opinion that it is better to touch type in \n  jerome than it is to learn a series of alternate letter combinations \n  representing one symbol, and the production of such a driver may lead to \n  people not thinking with Quikscript in mind as they type.&nbsp; And how will \n  that affect how they handwrite in Quikscript in their own daily lives.&nbsp; \n  My concern is that the production of such a driver may actually be a shortcut \n  that is detrimental to these individuals learning and utilizing Quikscript in \n  the long run and, thus, will be detrimental to the spread of Quikscript. \n  <p>Note:&nbsp; As an interesting historical aside, we have been stuck with the \n  Qwerty keyboard since the early days of typewriters.&nbsp; I read that this \n  ordering of keys was decided upon due to the poor mechanisms of those \n  typewriters:&nbsp; if you activated two keys next to each other too \n  frequently, the mechanism tended to jam.&nbsp; The Qwerty keyboard is actually \n  poorly designed for fast typing as the vowels, with the exception of &quot;a&quot; are \n  not on the home key row.&nbsp; Obviously, this makes no sense as the vowels \n  are the most used letters and moving your fingers off the home row takes more \n  time.&nbsp; There is an alternative keyboard, Dvorak, which is designed more \n  scientifically.&nbsp; After a touch typist makes the transition to Dvorak, \n  their typing speed increases approximately 20% just from the improved key \n  positions.&nbsp;&nbsp; Since touch typing involves a connection between the \n  mind and the appropraite finger position on the keyboard, one cannot use both \n  the Qwerty and Dvorak keyboard depending on which is present on a particular \n  machine.&nbsp; In tests it took approximately two weeks for a secretary to \n  make the transition to Dvorak.&nbsp; Once she had, she was no longer able to \n  type quickly on a Qwerty keyboard.&nbsp; This, coupled with the natural \n  conservatism of businesses and people in general, explains the absolute \n  dominance of Qwerty.&nbsp; The inertia of the mass of people who touch type \n  using Qwerty because that is what has always been available have prevented \n  Dvorak from making any inroads on Qwerty. \n  <p>Moving to another point:&nbsp; the problem I see with the present keyboard \n  mapping for jerome is that Jon set it up to match the present Shavian mapping \n  on the theory, I believe, that some of the people interested in Shavian who \n  had already learned the existing Shavian mapping would make the shift to \n  Quikscript.&nbsp; I do not see any evidence of that happening on any \n  significant scale, and the current mapping is not as felicitous for jerome as \n  it could be. \n  <p>The letters which jerome shares with roman should be set up for the same \n  keys as much as possible to aid the shift from roman to Quikscript&nbsp;&nbsp; \n  There are twenty-six letters on the keyboard,and with the use of the shift \n  key, this gives us fifty-two positions for letters.&nbsp; I believe we should \n  avoid the use of keys currently used for punctuation and other symbols unless \n  absolutely necessary.&nbsp; As an example, &quot;wholewheat&quot; is currently mapped on \n  the &quot;tilde&quot; key.&nbsp;&nbsp; This is a long stretch for the left little finger \n  and does not aid fast typing.&nbsp; Because it is a key little used in roman \n  typing, it forces me to look at the keyboard, which a touch typist does not \n  want to do. \n  <p>Shavian has no half-letters so the Shavian mapping did not have to take \n  that issue into account.&nbsp; Since Quikscript does use half-letters, it \n  would make sense to me that those letters should be produced by using the \n  shift key along with the same key that produces the whole letter.&nbsp; \n  Example:&nbsp; &quot;peep&quot; mapped to &quot;p&quot;, &quot;half-peep&quot; mapped to shift &quot;p.&quot;&nbsp; \n  &quot;Day&quot; and &quot;half-day&quot; to be mapped the same way on &quot;d&quot; and shift &quot;d.&quot;&nbsp; And \n  so forth. \n  <p>Jon, how much trouble would it be to remap a revision of jerome to work \n  better for Quikscript?&nbsp; I assume that the dificult part in producing the \n  font was setting up the letter shapes and that the key mapping was a \n  relatively straight forward process.&nbsp; Is this correct?&nbsp; If we made \n  such a revision available on Read_Alphabet, those people prefering the Shavian \n  mapping could continue to use it, and those who prefer an optimized Quikscript \n  version could use it.&nbsp; The recepient of a communication will not care how \n  it is mapped.&nbsp;&nbsp; People migrating from the Shavian group to the \n  Read_Alphabet group could use the mapping they were already familiar \n  with.&nbsp; Those who are totally new devotees of Quikscript could use the \n  revised mapping.&nbsp; If doing this remapping is not a vast amount of \n  trouble, I will work on a remapping scheme to see how the mapping can be \n  improved.&nbsp; I would like to do this before I spend too much more time \n  using the present mapping. \n  <p>Aside:&nbsp; I have been working on Hamlet&#39;s soliloquy in Senior \n  Quikscript.&nbsp; The half-letters are working very well.&nbsp; I also believe \n  that some of the letters that I thought needed additional work look fine when \n  a 12 point font is used.&nbsp; In general, I am very pleased with jerome. \n  <p>Sorry this was so long.&nbsp;&nbsp; Sometimes I get started and can&#39;t seem \n  to stop. \n  <p>All the best to everyone, \n  <p>Paige Gabhart <br>&nbsp; <br>&nbsp; \n  <p>Jon Zuck wrote: \n  <blockquote TYPE=\"CITE\">&nbsp;<tt>Wow, Ewout!&nbsp; This sounds \n    excellent.&nbsp; Is there anyone who can create such a</tt> <br><tt>driver \n    for us?</tt> \n    <p><tt>It sure would make using QS a lot easier.</tt> <br>&nbsp; \n    <p><tt>Shalom v&#39;Tovah,</tt> \n    <p><tt>Jon</tt> <br><tt><a rel=\"nofollow\"\n target=\"_blank\" href=\"http://surf.to/frimmin\">http://surf.to/frimmin</a></tt> \n    <br>&nbsp;<tt></tt> \n    <p><tt>&gt; If somebody would create a driver, it can be programmed to \n    return the</tt> <br><tt>&gt; &#39;they&#39;-symbol when somebody types &#39;dh&#39;. Two \n    letters become one, but it</tt> <br><tt>would</tt> <br><tt>&gt; indeed NOT \n    require you to learn any keyboard map. You can just type a</tt> \n    <br><tt>roman</tt> <br><tt>&gt; reform and get proper quikscript \n    returned.</tt> <br><tt>&gt;</tt> <br><tt>&gt; But someone will have to \n    program this driver first. I certainly don&#39;t have</tt> <br><tt>&gt; the \n    time/knowledge (yet) to do so.</tt> <br><tt>&gt;</tt> <br><tt>&gt; \n    Ewout</tt> <br><tt>&gt;&gt;</tt> \n<br><br><tt></tt>&nbsp;</p></blockquote></blockquote></span></blockquote></html> \n</div>",
  "specialLinks": [],
  "rawEmail": "Return-Path: &lt;frimmin@...&gt;\r\nX-Sender: frimmin@...\r\nX-Apparently-To: Read_Alphabet@yahoogroups.com\r\nReceived: (EGP: unknown); 24 Feb 2002 19:03:22 -0000\r\nReceived: (qmail 43070 invoked from network); 24 Feb 2002 19:03:22 -0000\r\nReceived: from unknown (216.115.97.171)\n  by m11.grp.snv.yahoo.com with QMQP; 24 Feb 2002 19:03:22 -0000\r\nReceived: from unknown (HELO marlin.exis.net) (65.120.48.2)\n  by mta3.grp.snv.yahoo.com with SMTP; 24 Feb 2002 19:03:21 -0000\r\nReceived: from winxp (digital-2-106.exis.net [65.120.51.106])\n\tby marlin.exis.net (8.11.2/8.11.0) with SMTP id g1OJ3BC16268\n\tfor &lt;Read_Alphabet@yahoogroups.com&gt;; Sun, 24 Feb 2002 14:03:11 -0500\r\nMessage-ID: &lt;005801c1bd65$e4f2d2b0$6a337841@winxp&gt;\r\nTo: &lt;Read_Alphabet@yahoogroups.com&gt;\r\nReferences: &lt;005601c1bbcc$eefa7b40$0705643e@bertha&gt; &lt;000401c1bc0e$2d7ff890$98337841@winxp&gt; &lt;3C77E4D8.466DE66D@...&gt;\r\nSubject: Re: [Read_Alphabet] Macbeth\r\nDate: Sun, 24 Feb 2002 14:01:49 -0500\r\nMIME-Version: 1.0\r\nContent-Type: multipart/alternative;\n\tboundary=&quot;----=_NextPart_000_0055_01C1BD3B.CDE45D20&quot;\r\nX-Priority: 3\r\nX-MSMail-Priority: Normal\r\nX-Mailer: Microsoft Outlook Express 6.00.2600.0000\r\nX-MimeOLE: Produced By Microsoft MimeOLE V6.00.2600.0000\r\nFrom: &quot;Jon Zuck&quot; &lt;frimmin@...&gt;\r\nX-Yahoo-Group-Post: member; u=833140\r\nX-Yahoo-Profile: frimmin\r\n\r\n\r\n------=_NextPart_000_0055_01C1BD3B.CDE45D20\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nThanks for your thoughts, Paige.\n\nI&#39;m afraid that I have to disagree about =\r\nthe virtues of a transliterating keyboard driver:  It is not optional, it i=\r\ns essential!  Even if you say that you are able to type &quot;fairly quickly&quot; in=\r\n Jerome, I doubt you could do it well enough to be hired as an administrati=\r\nve assistant for a Read Alphabet-based office!  I&#39;m thinking like a good 40=\r\n-55 words per minute; This isn&#39;t attainable, because too many keys are on c=\r\napitals. Forget the word &quot;transliterating.&quot; The keyboard driver is simply t=\r\nhe way keyboard must work in any language. Consider the fact that with uppe=\r\nr case, we use 52 letters in English on 26 keys- our keyboard drivers inter=\r\npret SHIFT + (letter) as a signal to put down a completely different symbol=\r\n.  And in the many countries of the world, where there are far more charact=\r\ners than keys, E.g., China, Japan, Thailand, India, etc., several keystroke=\r\ns are used to create a single complete character. This is always the case i=\r\nn Chinese and Japanese, where the elements of the radical characters are sp=\r\necified by single keystrokes, and drivers recognize combinations to create =\r\nradical and more complex characters. Some of those languages, like Thai and=\r\n Hindi, can present a trucated form of the writing (for example, omitting v=\r\nowels, which are integrated into the shape of the complete character) by us=\r\ning simple keystrokes, but the full script must use multiple keys to create=\r\n complete characters with the loops and flourishes which indicate vowels.  =\r\nSemitic languages, like Hebrew and Arabic are a bit better off, since they =\r\nnormally are written without vowels, but the inclusion of the vowel of cour=\r\nse, requires another letter keystroke.  Nearly half of the world&#39;s populati=\r\non uses non-Roman-based writing systems.  You can bet that if they&#39;re not h=\r\nitting alt, shift, control all the time, they&#39;re hitting other combinations=\r\n of characters a lot to flesh out the writing.  Even many European language=\r\ns had to use backspace + (accent) on the typewriter to get all of their let=\r\nters to appear correctly, since some Slavic languages can put an accent ove=\r\nr almost every character.  The computer keyboard eliminates some of that aw=\r\nkwardness, you can keep going forward, and the keyboard can recognize a let=\r\nter combination a signifying an accented letter. Esperantists usually use a=\r\nn x or an h to signify the accent, with h being the easier combination to t=\r\nype.\n\nOr consider it this way: Stop thinking of the capital letters as &quot;pla=\r\nces&quot; on the keyboard, and think about the actions that are required to prod=\r\nuce a letter.  With only 26 letter keys, multiple keystrokes are going to b=\r\ne needed to produce most of the characters in a 62-character alphabet.  We&#39;=\r\nre using the &quot;Shift +&quot; combination to do almost everything, when a simpler =\r\nsolution, not requiring the poor lil&#39; ol pinky to do that work would be to =\r\nsimply type a logical character combination. \n\nRe Dvorak:  I&#39;m the only per=\r\nson I know who actually tried it, and that was twice, as a matter of fact. =\r\n The second time was last year, and I converted my Windows systems both at =\r\nhome and work to the Dvorak schema.  I liked the more logical arrangement o=\r\nf the keys, and I definitely did get up to &quot;fairly quick&quot; typing with it, i=\r\nn the neighborhood of 30 words per minute.  But I abandoned it after about =\r\nsix months because I couldn&#39;t break that barrier, and on Qwerty, I can do 5=\r\n5 wpm easily.  I figured 6 months was adequate time for a trial! Dvorak has=\r\n its own illogical parts too, like R and L being under the weakest fingers,=\r\n and A being under a weak finger while U gets the prime real estate.  After=\r\n my two shots at it, I think that in a non-Qwerty-biased world, it would be=\r\n a superior alternative for someone who is just learning to type or one who=\r\n has never achieved good speed with Qwerty.\n\n&gt;No one thinks of a &quot;they&quot; or =\r\n&quot;thaw&quot; as &quot;dh&quot;, and I feel it adds a needless level of complexity. \n\nSince =\r\nin Senior QS we have the blessing(?) of THREE &quot;th&#39;s&quot; Thoth, Thither, and Ot=\r\nher (T, H, K),  I think the easily remembered digraphs of th, dh, and xdh w=\r\nould greatly simplify matters.  It seems a lot more sensible to me than Shi=\r\nft+T, Shift+H, and Shift +K, which we have now. It would be a slight exagge=\r\nration to say that I think in terms of  &quot;dh&quot; sounds, but as soon as one beg=\r\nins learning the sounds of the language, th and dh is a fairly common way o=\r\nf differentiating between the Thoth and Thither sounds in Roman letters. An=\r\nd the less unnecessary use of the Shift key, the faster and easier it goes =\r\nfor everyone. Another possible benefit of the transliterating driver would =\r\nbe that we could put the slash back where it belongs, and have the driver i=\r\nntelligently print a namer dot when it encounters a initial capital letter.=\r\n  Thus, we could actually write things like and/or again without having to =\r\nremember where the slash went, and the Shift key goes back to it&#39;s reasons =\r\nfor living--indicating capitals and punctuation, not letters.  Let letters =\r\nand letter-combinations create letters, and Shift do punctuation selection,=\r\n not letter selection.\n\n\nThat way, NO Read characters would have to be mapp=\r\ned onto punctuation keys, capitalization comes from natural use of the Shif=\r\nt key, and no punctuation marks are eliminated or even moved.  \n\nShush, Zhi=\r\nvago, Thoth, Thither and Church can be typed very naturally as sh, zh, th, =\r\ndh, ch, which should be significantly easier to remember, and much easier t=\r\no type than Cap S, Cap Z, Cap T, Cap H, small c!  They all occur in English=\r\n except for dh, which once learned, won&#39;t be confused for anything else, an=\r\nd is quite intuitive.  Th is to dh, as t is to d, as tall is to deep, as un=\r\nvoiced is to voiced. Inkling is usually represented in Roman by ng, which w=\r\nill do nicely.  The alternate forms, Noon, Up, and Other, could be designat=\r\ned by an x, which would be impossible to confuse in Shavian letters with an=\r\ny other meaning. Thus, xn, xa, xdh, or something similar. Again, easily rem=\r\nembered, x signifying &quot;alternative form.&quot; The half-letters could be flagged=\r\n by something else: say an initial h, which would give hw, hwh, hd, hz, ht,=\r\n hp, hy, hh. Easily remembed: The half-letters are flagged by an initial h,=\r\n for &quot;half&quot;.\n\nFinally, I heartily agree that the keyboard mapping can be im=\r\nproved.  It shouldn&#39;t be too difficult for me to create something a little =\r\nmore logical.  And I COMPLETELY agree that Read characters shouldn&#39;t be dis=\r\nplacing punctuation symbols, no matter how infrequently used.  The problem =\r\nis simple: 62 characters vs. an overwhelmed 26 letter keys.  As long as one=\r\n is stuck with a mapping paradigm, the more letters, the more illogical pla=\r\ncements (I really didn&#39;t WANT to put Other on Cap K!)\n\nAlthough I love them=\r\n, In QS, the ligatures are not necessary. eliminating them brings us down t=\r\no 55 characters, still 3 over the letter key and SHIFT + letter key maximum=\r\n.  The namer dot must stay on a key until we can get a Shavian driver to in=\r\nput it logically. Even then, it would be desirable to have a true place for=\r\n it, to indicate it out of context, as a symbol per se.. The two most logic=\r\nal candidates to go are Read&#39;s Gaelic letters, which are a concession to Sc=\r\nottish, not English. One more must go.  What to do, what to do!\n\nI won&#39;t as=\r\nk you to part with half-Yo and half-wheat, Paige; you brilliantly extended =\r\nRead&#39;s own logic here.  While Read seems to want to include the X&#39;s, I thin=\r\nk one at least with have to go. You don&#39;t like them, I do, but we&#39;ve got to=\r\n make some room somewhere.  I&#39;ll sacrifice them--maybe put them into somewh=\r\nere in the extended character set, like ALT + 0244 or something.  \n\nThere, =\r\nwe&#39;ve got the room now, but the vowels will never make sense, sinse there&#39;s=\r\n 15 unique Shavian letters for vowels and 5 appropriate keys.  I&#39;ll do the =\r\nbest I can, and it WILL be better than what we&#39;ve had, but I consider this =\r\nonly a Band-Aid solution before a keyboard driver for the alphabet can be c=\r\nreated.  Give me a few weeks, OK?  I&#39;ve got a lot of pans in the fire, righ=\r\nt now, a lot!\n\nShalom v&#39;Tovah,\n\nJon  \nhttp://surf.to/frimmin\n\nIt is more ne=\r\ncessary to love much than to think much;\nalways do that which impels you mo=\r\nst to love.\n\n        --St. Teresa of Avila, The Interior Castle\n  ----- Ori=\r\nginal Message ----- \n  From: C. Paige Gabhart \n  To: Read_Alphabet@yahoogro=\r\nups.com \n  Sent: Saturday, February 23, 2002 1:52 PM\n  Subject: Re: [Read_A=\r\nlphabet] Macbeth\n\n\n  Jon & Ewout: \n  I am not so sure  the idea of a transl=\r\niterating keyboard driver is a good idea.  It reminds me of training wheels=\r\n on a bicycle.  When I was five, I rode my bicycle for a year with training=\r\n wheels attached to the rear wheel.  When my father finally took them off, =\r\nwe discovered I still did not know how to balance because the training whee=\r\nls had kept me from  having to.  But after they came off, I learned to ride=\r\n the same day. \n\n  I don&#39;t want to push this analogy too far, but just in t=\r\nhe last few days after posting a few messages and texts in jerome, I have f=\r\nound my skill in typing with jerome has advanced  fairly quickly.  I still =\r\nhave a few letters I have to search for, but it will not take long before I=\r\n will be able to type fairly easily in jerome. \n\n  I think it is best to wr=\r\nite with Quikscript in mind rather than using some intermediate combination=\r\n of letters which are then transliterated by a driver to produce the symbol=\r\n you intend.    I believe very few people have actually tried to use jerome=\r\n up to this point so no one has much experience with it.  I am a good touch=\r\n typist and never look at the keyboard when I type.  I would assume, howeve=\r\nr, that it is probably more difficult to get used to the jerome keyboard ma=\r\npping for a person who is not a touch typist since the Quikscript symbols d=\r\no not appear on the keys.  Of course, the way one becomes a touch typist is=\r\n by practice and watching the screen as one types.  So I believe anyone who=\r\n is motivated can, with a moderate amount of practice, learn to type using =\r\nthe current jerome mapping. \n\n  Of course, in any touch typing, one should =\r\nuse the proper fingers on the appropriate keys, which requires the use of a=\r\nll eight fingers and one thumb.  I believe the average self-taught typist o=\r\nnly uses three or four fingers so their hands are moving all over the keybo=\r\nard, which makes it impossible to type quickly.  But there are innumerable =\r\ntyping programs, which can break them of this improper technique.  (I know:=\r\n  it will difficult to tell someone to learn to type first, and then learn =\r\njerome touch typing.)  I am just voicing my opinion that it is better to to=\r\nuch type in jerome than it is to learn a series of alternate letter combina=\r\ntions representing one symbol, and the production of such a driver may lead=\r\n to people not thinking with Quikscript in mind as they type.  And how will=\r\n that affect how they handwrite in Quikscript in their own daily lives.  My=\r\n concern is that the production of such a driver may actually be a shortcut=\r\n that is detrimental to these individuals learning and utilizing Quikscript=\r\n in the long run and, thus, will be detrimental to the spread of Quikscript=\r\n. \n\n  Note:  As an interesting historical aside, we have been stuck with th=\r\ne Qwerty keyboard since the early days of typewriters.  I read that this or=\r\ndering of keys was decided upon due to the poor mechanisms of those typewri=\r\nters:  if you activated two keys next to each other too frequently, the mec=\r\nhanism tended to jam.  The Qwerty keyboard is actually poorly designed for =\r\nfast typing as the vowels, with the exception of &quot;a&quot; are not on the home ke=\r\ny row.  Obviously, this makes no sense as the vowels are the most used lett=\r\ners and moving your fingers off the home row takes more time.  There is an =\r\nalternative keyboard, Dvorak, which is designed more scientifically.  After=\r\n a touch typist makes the transition to Dvorak, their typing speed increase=\r\ns approximately 20% just from the improved key positions.   Since touch typ=\r\ning involves a connection between the mind and the appropraite finger posit=\r\nion on the keyboard, one cannot use both the Qwerty and Dvorak keyboard dep=\r\nending on which is present on a particular machine.  In tests it took appro=\r\nximately two weeks for a secretary to make the transition to Dvorak.  Once =\r\nshe had, she was no longer able to type quickly on a Qwerty keyboard.  This=\r\n, coupled with the natural conservatism of businesses and people in general=\r\n, explains the absolute dominance of Qwerty.  The inertia of the mass of pe=\r\nople who touch type using Qwerty because that is what has always been avail=\r\nable have prevented Dvorak from making any inroads on Qwerty. \n\n  Moving to=\r\n another point:  the problem I see with the present keyboard mapping for je=\r\nrome is that Jon set it up to match the present Shavian mapping on the theo=\r\nry, I believe, that some of the people interested in Shavian who had alread=\r\ny learned the existing Shavian mapping would make the shift to Quikscript. =\r\n I do not see any evidence of that happening on any significant scale, and =\r\nthe current mapping is not as felicitous for jerome as it could be. \n\n  The=\r\n letters which jerome shares with roman should be set up for the same keys =\r\nas much as possible to aid the shift from roman to Quikscript   There are t=\r\nwenty-six letters on the keyboard,and with the use of the shift key, this g=\r\nives us fifty-two positions for letters.  I believe we should avoid the use=\r\n of keys currently used for punctuation and other symbols unless absolutely=\r\n necessary.  As an example, &quot;wholewheat&quot; is currently mapped on the &quot;tilde&quot;=\r\n key.   This is a long stretch for the left little finger and does not aid =\r\nfast typing.  Because it is a key little used in roman typing, it forces me=\r\n to look at the keyboard, which a touch typist does not want to do. \n\n  Sha=\r\nvian has no half-letters so the Shavian mapping did not have to take that i=\r\nssue into account.  Since Quikscript does use half-letters, it would make s=\r\nense to me that those letters should be produced by using the shift key alo=\r\nng with the same key that produces the whole letter.  Example:  &quot;peep&quot; mapp=\r\ned to &quot;p&quot;, &quot;half-peep&quot; mapped to shift &quot;p.&quot;  &quot;Day&quot; and &quot;half-day&quot; to be map=\r\nped the same way on &quot;d&quot; and shift &quot;d.&quot;  And so forth. \n\n  Jon, how much tro=\r\nuble would it be to remap a revision of jerome to work better for Quikscrip=\r\nt?  I assume that the dificult part in producing the font was setting up th=\r\ne letter shapes and that the key mapping was a relatively straight forward =\r\nprocess.  Is this correct?  If we made such a revision available on Read_Al=\r\nphabet, those people prefering the Shavian mapping could continue to use it=\r\n, and those who prefer an optimized Quikscript version could use it.  The r=\r\necepient of a communication will not care how it is mapped.   People migrat=\r\ning from the Shavian group to the Read_Alphabet group could use the mapping=\r\n they were already familiar with.  Those who are totally new devotees of Qu=\r\nikscript could use the revised mapping.  If doing this remapping is not a v=\r\nast amount of trouble, I will work on a remapping scheme to see how the map=\r\nping can be improved.  I would like to do this before I spend too much more=\r\n time using the present mapping. \n\n  Aside:  I have been working on Hamlet&#39;=\r\ns soliloquy in Senior Quikscript.  The half-letters are working very well. =\r\n I also believe that some of the letters that I thought needed additional w=\r\nork look fine when a 12 point font is used.  In general, I am very pleased =\r\nwith jerome. \n\n  Sorry this was so long.   Sometimes I get started and can&#39;=\r\nt seem to stop. \n\n  All the best to everyone, \n\n  Paige Gabhart \n    \n    \n=\r\n\n  Jon Zuck wrote: \n\n     Wow, Ewout!  This sounds excellent.  Is there any=\r\none who can create such a \n    driver for us? \n    It sure would make using=\r\n QS a lot easier. \n      \n\n    Shalom v&#39;Tovah, \n\n    Jon \n    http://surf.t=\r\no/frimmin \n      \n\n    &gt; If somebody would create a driver, it can be progr=\r\nammed to return the \n    &gt; &#39;they&#39;-symbol when somebody types &#39;dh&#39;. Two lett=\r\ners become one, but it \n    would \n    &gt; indeed NOT require you to learn an=\r\ny keyboard map. You can just type a \n    roman \n    &gt; reform and get proper=\r\n quikscript returned. \n    &gt; \n    &gt; But someone will have to program this d=\r\nriver first. I certainly don&#39;t have \n    &gt; the time/knowledge (yet) to do s=\r\no. \n    &gt; \n    &gt; Ewout \n    &gt;&gt; \n\n     \n\n\r\n------=_NextPart_000_0055_01C1BD3B.CDE45D20\r\nContent-Type: text/html;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Transitional//EN&quot;&gt;\n&lt;HTML&gt;&lt;HEAD&gt;=\r\n\n&lt;META http-equiv=3DContent-Type content=3D&quot;text/html; charset=3Diso-8859-1=\r\n&quot;&gt;\n&lt;META content=3D&quot;MSHTML 6.00.2713.1100&quot; name=3DGENERATOR&gt;\n&lt;STYLE&gt;&lt;/STYLE=\r\n&gt;\n&lt;/HEAD&gt;\n&lt;BODY bgColor=3D#ffffff&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;Thanks =\r\nfor your &lt;FONT \nface=3DDotumChe&gt;thoughts&lt;/FONT&gt;, Paige.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;=\r\nFONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=\r\n=3D2&gt;I&#39;m afraid that I have to disagree about the \nvirtues of a translitera=\r\nting keyboard driver:&nbsp; It is not optional, \n&lt;STRONG&gt;it is essential!&lt;/=\r\nSTRONG&gt;&nbsp; Even if you say that you are able to \ntype &quot;fairly quickly&quot; i=\r\nn Jerome, I doubt you could do it well enough to be hired \nas an administra=\r\ntive assistant for a Read Alphabet-based office!&nbsp; I&#39;m \nthinking like&n=\r\nbsp;a good 40-55 words per minute;&nbsp;This isn&#39;t attainable, \nbecause too=\r\n many keys are on capitals.&nbsp;Forget the word &quot;transliterating.&quot; \n&lt;/FONT=\r\n&gt;&lt;FONT face=3DArial size=3D2&gt;The&nbsp;keyboard driver is simply the way \nke=\r\nyboard must work in any language.&nbsp;Consider the fact that with upper ca=\r\nse, \nwe use 52 letters in English on 26 keys- our keyboard drivers interpre=\r\nt SHIFT + \n(letter) as a signal to put down a completely different symbol.&=\r\nnbsp; And in the \nmany countries of the world, where there are far more cha=\r\nracters than keys, \nE.g., China, Japan, Thailand, India, etc.,&nbsp;several=\r\n keystrokes are used to \ncreate a single complete character.&nbsp;This is a=\r\nlways the case in Chinese and \nJapanese, where the elements of the radical =\r\ncharacters are specified by single \nkeystrokes, and drivers recognize combi=\r\nnations&nbsp;to create&nbsp;radical and \nmore complex characters.&nbsp;Some=\r\n of those languages, like Thai and Hindi, can \npresent a trucated form of t=\r\nhe writing&nbsp;(for example, omitting vowels, which \nare integrated into t=\r\nhe shape of the complete character) by using simple \nkeystrokes, but the &lt;E=\r\nM&gt;full &lt;/EM&gt;script must use multiple keys to create \ncomplete characters wi=\r\nth the loops and flourishes which indicate vowels.&nbsp; \nSemitic languages=\r\n, like Hebrew and Arabic are a bit better off, since they \nnormally &lt;EM&gt;are=\r\n&lt;/EM&gt; written without vowels, but the inclusion of the vowel of \ncourse, re=\r\nquires another letter keystroke.&nbsp; Nearly half of the world&#39;s \npopulati=\r\non uses non-Roman-based writing systems.&nbsp; You can bet that if \nthey&#39;re=\r\n not hitting alt, shift, control all the time, they&#39;re hitting other \ncombi=\r\nnations of characters a lot to flesh out the writing.&nbsp; Even many \nEuro=\r\npean languages had to use backspace + (accent) on the typewriter to get all=\r\n \nof their letters to appear correctly, since some Slavic languages can put=\r\n an \naccent over almost every character.&nbsp; The computer keyboard elimin=\r\nates some \nof that awkwardness, you can keep going forward, and the keyboar=\r\nd can recognize \na letter combination a signifying an accented letter. Espe=\r\nrantists usually use \nan x or an h to signify the accent, with h being the =\r\neasier combination to \ntype.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;=\r\n&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;Or consider it this wa=\r\ny: Stop thinking of the \ncapital letters as &quot;places&quot; on the keyboard, and t=\r\nhink about the actions that \nare required to produce a letter.&nbsp; With o=\r\nnly 26 letter keys, multiple \nkeystrokes are going to be needed to&nbsp;pro=\r\nduce most of the characters in a \n62-character alphabet.&nbsp; We&#39;re using =\r\nthe &quot;Shift +&quot; combination to do almost \neverything, when a simpler solution=\r\n, not requiring the poor lil&#39; ol pinky to do \nthat work would be to simply =\r\ntype a logical character \ncombination.&nbsp;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=\r\n=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;Re D=\r\nvorak:&nbsp; I&#39;m the only person I know who \nactually tried it, and that wa=\r\ns twice, as a matter of fact.&nbsp; The second \ntime was last year, and I c=\r\nonverted my Windows systems both at home and work to \nthe Dvorak schema.&nb=\r\nsp; I liked the more logical arrangement of the keys, and I \ndefinitely did=\r\n get up to &quot;fairly quick&quot; typing with it, in the neighborhood of \n30 words =\r\nper minute.&nbsp; But I abandoned it after about six months because I \ncoul=\r\ndn&#39;t break that barrier, and on Qwerty, I can do 55 wpm easily.&nbsp; I \nfi=\r\ngured 6 months was adequate time for a trial! Dvorak has its own illogical =\r\n\nparts too, like R and L being under the weakest fingers, and A being under=\r\n a \nweak finger while U gets the prime real estate.&nbsp; After my two shot=\r\ns at it, \nI think that in a non-Qwerty-biased world, it would be a&nbsp;sup=\r\nerior \nalternative for someone who is just learning to type or one who has =\r\nnever \nachieved good speed with Qwerty.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DAria=\r\nl size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&gt;No one thinks of a &quot;they&quot; or &quot;thaw&quot;=\r\n as &quot;dh&quot;, and I feel it adds a \nneedless level of complexity.&nbsp;&lt;/DIV&gt;\n&lt;=\r\nDIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial=\r\n size=3D2&gt;Since in Senior QS we have the blessing(?) of THREE \n&quot;th&#39;s&quot; Thoth=\r\n, Thither, and Other &lt;FONT face=3Djerome&gt;(T, H, K),&nbsp; &lt;/FONT&gt;&lt;FONT \nfac=\r\ne=3DArial&gt;I think the easily remembered digraphs of &lt;STRONG&gt;th&lt;/STRONG&gt;, \n&lt;=\r\nSTRONG&gt;dh&lt;/STRONG&gt;, and&nbsp;&lt;STRONG&gt;xdh&lt;/STRONG&gt; would greatly simplify \nm=\r\natters.&nbsp; It seems a lot more sensible to me than Shift+T, Shift+H, and=\r\n \nShift +K, which we have now. It would be a slight&nbsp;exaggeration to sa=\r\ny that \nI think in terms of&nbsp; &quot;dh&quot; sounds, but as soon as one begins le=\r\narning the \nsounds of the language, th and dh is a fairly common way of dif=\r\nferentiating \nbetween the Thoth and Thither sounds in Roman letters. And th=\r\ne less unnecessary \nuse of the Shift key, the faster and easier it goes for=\r\n everyone. Another \npossible benefit of the transliterating driver would be=\r\n that we could put the \nslash back where it belongs, and have the driver in=\r\ntelligently print a namer dot \nwhen it encounters a initial capital letter.=\r\n&nbsp; Thus, we could actually write \nthings like and/or again without havi=\r\nng to remember where the slash went, and \nthe Shift key goes back to it&#39;s r=\r\neasons for living--indicating capitals and \npunctuation, not letters.&nbsp;=\r\n Let letters and letter-combinations create \nletters, and Shift do punctuat=\r\nion selection, not letter \nselection.&lt;/FONT&gt;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=\r\n=3DArial size=3D2&gt;&lt;FONT face=3DArial&gt;&lt;/FONT&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT =\r\nface=3DArial size=3D2&gt;&lt;FONT face=3DArial&gt;&lt;/FONT&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;F=\r\nONT face=3DArial size=3D2&gt;&lt;FONT face=3DArial&gt;That way, NO&nbsp;Read charact=\r\ners \nwould have to be mapped onto punctuation keys, capitalization comes fr=\r\nom natural \nuse of the Shift key, and no punctuation marks are eliminated o=\r\nr even \nmoved.&nbsp; &lt;/FONT&gt;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;=\r\n&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;Shush, Zhivago, Thoth,=\r\n Thither and Church can be \ntyped very naturally as &lt;STRONG&gt;sh, zh, th, dh,=\r\n ch&lt;/STRONG&gt;, which should be \nsignificantly easier to remember, and much e=\r\nasier to type than&nbsp;Cap S, Cap \nZ, Cap T, Cap H, small c!&nbsp; They&nb=\r\nsp;all occur in English except \nfor&nbsp;dh, which once learned, won&#39;t be c=\r\nonfused for anything else, and is \nquite intuitive.&nbsp; Th is to dh, as t=\r\n is to d, as tall is to deep, \nas&nbsp;unvoiced is to voiced.&nbsp;Inkling =\r\nis usually represented in Roman by \n&lt;STRONG&gt;ng, &lt;/STRONG&gt;which will do nice=\r\nly.&nbsp; The&nbsp;alternate \nforms,&nbsp;Noon, Up, and Other, could be des=\r\nignated by an x, which would be \nimpossible to confuse in Shavian letters w=\r\nith any other meaning. Thus, \n&lt;STRONG&gt;xn,&lt;/STRONG&gt; &lt;STRONG&gt;xa, xdh, &lt;/STRON=\r\nG&gt;or something similar.&nbsp;Again, \neasily remembered, x signifying&nbsp;&quot;=\r\nalternative form.&quot;&nbsp;The half-letters \ncould be flagged by something els=\r\ne: say an initial h, which would give \n&lt;STRONG&gt;hw, hwh, hd, hz, ht, hp, hy,=\r\n hh. &lt;/STRONG&gt;Easily remembed: The \nhalf-letters are flagged by an initial =\r\nh, for &quot;half&quot;.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&lt;FONT f=\r\nace=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;F=\r\ninally, I heartily agree that the keyboard mapping \ncan be improved.&nbsp; =\r\nIt shouldn&#39;t be too difficult for me to create something \na little more log=\r\nical.&nbsp; And I COMPLETELY agree that Read characters \nshouldn&#39;t be displ=\r\nacing punctuation symbols, no matter how infrequently \nused.&nbsp; The prob=\r\nlem is simple: 62 characters vs. an overwhelmed 26 letter \nkeys.&nbsp; As l=\r\nong as one is stuck with a mapping paradigm, the more letters, \nthe more il=\r\nlogical placements (I really didn&#39;t WANT to put Other on Cap \nK!)&lt;/FONT&gt;&lt;/D=\r\nIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3D=\r\nArial size=3D2&gt;Although I love them, In QS,&nbsp;the ligatures are \nnot nec=\r\nessary. eliminating them brings us down to 55 characters, still&nbsp;3 \nove=\r\nr the letter key and SHIFT + letter key maximum.&nbsp; The namer dot must \n=\r\nstay on a key until we can get a Shavian driver to input it logically. Even=\r\n \nthen, it would be desirable to have a true place for it, to indicate it o=\r\nut of \ncontext, as a symbol per se.. The two most logical candidates to go&=\r\nnbsp;are \nRead&#39;s Gaelic letters, which are a concession to Scottish, not En=\r\nglish. One more \nmust go.&nbsp; What to do, what to do!&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;=\r\nFONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=\r\n=3D2&gt;I won&#39;t ask you to part&nbsp;with half-Yo and \nhalf-wheat, Paige; you =\r\nbrilliantly extended Read&#39;s own logic here.&nbsp; While \nRead seems to want=\r\n to include the X&#39;s, I think one at least with have to go. You \ndon&#39;t like =\r\nthem, I do, but we&#39;ve got to make some room somewhere.&nbsp; I&#39;ll \nsacrific=\r\ne them--maybe put them into somewhere in the extended character set, \nlike =\r\nALT + 0244 or something.&nbsp; &lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=\r\n=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;There, we&#39;ve got =\r\nthe room now, but the vowels will \nnever make sense, sinse there&#39;s 15 uniqu=\r\ne Shavian letters for vowels and 5 \nappropriate keys.&nbsp; I&#39;ll do the bes=\r\nt I can, and it&nbsp;WILL be better than \nwhat we&#39;ve had, but I consider th=\r\nis only a Band-Aid solution before a keyboard \ndriver for the alphabet can =\r\nbe created.&nbsp; Give me a few weeks, OK?&nbsp; \nI&#39;ve got a lot of pans in=\r\n the fire, right now, a lot!&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;=\r\n&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Shalom v&#39;Tovah,&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=\r\n=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;Jon &nbsp;&lt;BR&gt;&lt;A \nhref=3D&quot;http://surf.to/frim=\r\nmin&quot;&gt;http://surf.to/frimmin&lt;/A&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;It is more nec=\r\nessary to love much than to think much;&lt;BR&gt;always do that \nwhich impels you=\r\n most to love.&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&=\r\nnbsp;&nbsp; --St. Teresa of Avila, The \nInterior Castle&lt;/DIV&gt;\n&lt;BLOCKQUOTE d=\r\nir=3Dltr \nstyle=3D&quot;PADDING-RIGHT: 0px; PADDING-LEFT: 5px; MARGIN-LEFT: 5px;=\r\n BORDER-LEFT: #000000 2px solid; MARGIN-RIGHT: 0px&quot;&gt;\n  &lt;DIV style=3D&quot;FONT: =\r\n10pt arial&quot;&gt;----- Original Message ----- &lt;/DIV&gt;\n  &lt;DIV \n  style=3D&quot;BACKGROU=\r\nND: #e4e4e4; FONT: 10pt arial; font-color: black&quot;&gt;&lt;B&gt;From:&lt;/B&gt; \n  &lt;A title=\r\n=3Dpgabhart@... href=3D&quot;mailto:pgabhart@...&quot;&gt;C. Paige \n  =\r\nGabhart&lt;/A&gt; &lt;/DIV&gt;\n  &lt;DIV style=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;To:&lt;/B&gt; &lt;A \n  title=\r\n=3DRead_Alphabet@yahoogroups.com \n  href=3D&quot;mailto:Read_Alphabet@yahoogroup=\r\ns.com&quot;&gt;Read_Alphabet@yahoogroups.com&lt;/A&gt; \n  &lt;/DIV&gt;\n  &lt;DIV style=3D&quot;FONT: 10=\r\npt arial&quot;&gt;&lt;B&gt;Sent:&lt;/B&gt; Saturday, February 23, 2002 1:52 \n  PM&lt;/DIV&gt;\n  &lt;DIV =\r\nstyle=3D&quot;FONT: 10pt arial&quot;&gt;&lt;B&gt;Subject:&lt;/B&gt; Re: [Read_Alphabet] \nMacbeth&lt;/DI=\r\nV&gt;\n  &lt;DIV&gt;&lt;BR&gt;&lt;/DIV&gt;Jon&nbsp;&amp; Ewout: \n  &lt;P&gt;I am not so sure&nbsp; the =\r\nidea of a transliterating keyboard driver is a \n  good idea.&nbsp; It remin=\r\nds me of training wheels on a bicycle.&nbsp; When I \n  was five, I rode my =\r\nbicycle for a year with training wheels attached to the \n  rear wheel.&nbsp=\r\n; When my father finally took them off, we discovered I still \n  did not kn=\r\now how to balance because the training wheels had kept me from&nbsp; \n  hav=\r\ning to.&nbsp; But after they came off, I learned to ride the same day. \n  &lt;=\r\nP&gt;I don&#39;t want to push this analogy too far, but just in the last few days =\r\n\n  after posting a few messages and texts in jerome, I have found my skill =\r\nin \n  typing with jerome has advanced&nbsp; fairly quickly.&nbsp; I still h=\r\nave a few \n  letters I have to search for, but it will not take long before=\r\n I will be able \n  to type fairly easily in jerome. \n  &lt;P&gt;I think it is bes=\r\nt to write with Quikscript in mind rather than using some \n  intermediate c=\r\nombination of letters which are then transliterated by a driver \n  to produ=\r\nce the symbol you intend.&nbsp;&nbsp;&nbsp; I believe very few people \n  ha=\r\nve actually tried to use jerome up to this point so no one has much \n  expe=\r\nrience with it.&nbsp; I am a good touch typist and never look at the \n  key=\r\nboard when I type.&nbsp; I would assume, however, that it is probably more =\r\n\n  difficult to get used to the jerome keyboard mapping for a person who is=\r\n not a \n  touch typist since the Quikscript symbols do not appear on the ke=\r\nys.&nbsp; Of \n  course, the way one becomes a touch typist is by practice a=\r\nnd watching the \n  screen as one types.&nbsp; So I believe anyone who is mo=\r\ntivated can, with a \n  moderate amount of practice, learn to type using the=\r\n current jerome mapping. \n  &lt;P&gt;Of course, in any touch typing, one should u=\r\nse the proper fingers on the \n  appropriate keys, which requires the use of=\r\n all eight fingers and one \n  thumb.&nbsp; I believe the average self-taugh=\r\nt typist only uses three or four \n  fingers so their hands are moving all o=\r\nver the keyboard, which makes it \n  impossible to type quickly.&nbsp; But t=\r\nhere are innumerable typing programs, \n  which can break them of this impro=\r\nper technique.&nbsp; (I know:&nbsp; it will \n  difficult to tell someone to=\r\n learn to type first, and then learn jerome touch \n  typing.)&nbsp; I am ju=\r\nst voicing my opinion that it is better to touch type in \n  jerome than it =\r\nis to learn a series of alternate letter combinations \n  representing one s=\r\nymbol, and the production of such a driver may lead to \n  people not thinki=\r\nng with Quikscript in mind as they type.&nbsp; And how will \n  that affect =\r\nhow they handwrite in Quikscript in their own daily lives.&nbsp; \n  My conc=\r\nern is that the production of such a driver may actually be a shortcut \n  t=\r\nhat is detrimental to these individuals learning and utilizing Quikscript i=\r\nn \n  the long run and, thus, will be detrimental to the spread of Quikscrip=\r\nt. \n  &lt;P&gt;Note:&nbsp; As an interesting historical aside, we have been stuck=\r\n with the \n  Qwerty keyboard since the early days of typewriters.&nbsp; I r=\r\nead that this \n  ordering of keys was decided upon due to the poor mechanis=\r\nms of those \n  typewriters:&nbsp; if you activated two keys next to each ot=\r\nher too \n  frequently, the mechanism tended to jam.&nbsp; The Qwerty keyboa=\r\nrd is actually \n  poorly designed for fast typing as the vowels, with the e=\r\nxception of &quot;a&quot; are \n  not on the home key row.&nbsp; Obviously, this makes=\r\n no sense as the vowels \n  are the most used letters and moving your finger=\r\ns off the home row takes more \n  time.&nbsp; There is an alternative keyboa=\r\nrd, Dvorak, which is designed more \n  scientifically.&nbsp; After a touch t=\r\nypist makes the transition to Dvorak, \n  their typing speed increases appro=\r\nximately 20% just from the improved key \n  positions.&nbsp;&nbsp; Since tou=\r\nch typing involves a connection between the \n  mind and the appropraite fin=\r\nger position on the keyboard, one cannot use both \n  the Qwerty and Dvorak =\r\nkeyboard depending on which is present on a particular \n  machine.&nbsp; In=\r\n tests it took approximately two weeks for a secretary to \n  make the trans=\r\nition to Dvorak.&nbsp; Once she had, she was no longer able to \n  type quic=\r\nkly on a Qwerty keyboard.&nbsp; This, coupled with the natural \n  conservat=\r\nism of businesses and people in general, explains the absolute \n  dominance=\r\n of Qwerty.&nbsp; The inertia of the mass of people who touch type \n  using=\r\n Qwerty because that is what has always been available have prevented \n  Dv=\r\norak from making any inroads on Qwerty. \n  &lt;P&gt;Moving to another point:&nbsp=\r\n; the problem I see with the present keyboard \n  mapping for jerome is that=\r\n Jon set it up to match the present Shavian mapping \n  on the theory, I bel=\r\nieve, that some of the people interested in Shavian who \n  had already lear=\r\nned the existing Shavian mapping would make the shift to \n  Quikscript.&nbs=\r\np; I do not see any evidence of that happening on any \n  significant scale,=\r\n and the current mapping is not as felicitous for jerome as \n  it could be.=\r\n \n  &lt;P&gt;The letters which jerome shares with roman should be set up for the =\r\nsame \n  keys as much as possible to aid the shift from roman to Quikscript&=\r\nnbsp;&nbsp; \n  There are twenty-six letters on the keyboard,and with the us=\r\ne of the shift \n  key, this gives us fifty-two positions for letters.&nbsp;=\r\n I believe we should \n  avoid the use of keys currently used for punctuatio=\r\nn and other symbols unless \n  absolutely necessary.&nbsp; As an example, &quot;w=\r\nholewheat&quot; is currently mapped on \n  the &quot;tilde&quot; key.&nbsp;&nbsp; This is a=\r\n long stretch for the left little finger \n  and does not aid fast typing.&n=\r\nbsp; Because it is a key little used in roman \n  typing, it forces me to lo=\r\nok at the keyboard, which a touch typist does not \n  want to do. \n  &lt;P&gt;Shav=\r\nian has no half-letters so the Shavian mapping did not have to take \n  that=\r\n issue into account.&nbsp; Since Quikscript does use half-letters, it \n  wo=\r\nuld make sense to me that those letters should be produced by using the \n  =\r\nshift key along with the same key that produces the whole letter.&nbsp; \n  =\r\nExample:&nbsp; &quot;peep&quot; mapped to &quot;p&quot;, &quot;half-peep&quot; mapped to shift &quot;p.&quot;&nbsp;=\r\n \n  &quot;Day&quot; and &quot;half-day&quot; to be mapped the same way on &quot;d&quot; and shift &quot;d.&quot;&nb=\r\nsp; And \n  so forth. \n  &lt;P&gt;Jon, how much trouble would it be to remap a rev=\r\nision of jerome to work \n  better for Quikscript?&nbsp; I assume that the d=\r\nificult part in producing the \n  font was setting up the letter shapes and =\r\nthat the key mapping was a \n  relatively straight forward process.&nbsp; Is=\r\n this correct?&nbsp; If we made \n  such a revision available on Read_Alphab=\r\net, those people prefering the Shavian \n  mapping could continue to use it,=\r\n and those who prefer an optimized Quikscript \n  version could use it.&nbsp=\r\n; The recepient of a communication will not care how \n  it is mapped.&nbsp;=\r\n&nbsp; People migrating from the Shavian group to the \n  Read_Alphabet grou=\r\np could use the mapping they were already familiar \n  with.&nbsp; Those who=\r\n are totally new devotees of Quikscript could use the \n  revised mapping.&n=\r\nbsp; If doing this remapping is not a vast amount of \n  trouble, I will wor=\r\nk on a remapping scheme to see how the mapping can be \n  improved.&nbsp; I =\r\nwould like to do this before I spend too much more time \n  using the presen=\r\nt mapping. \n  &lt;P&gt;Aside:&nbsp; I have been working on Hamlet&#39;s soliloquy in =\r\nSenior \n  Quikscript.&nbsp; The half-letters are working very well.&nbsp; I=\r\n also believe \n  that some of the letters that I thought needed additional =\r\nwork look fine when \n  a 12 point font is used.&nbsp; In general, I am very=\r\n pleased with jerome. \n  &lt;P&gt;Sorry this was so long.&nbsp;&nbsp; Sometimes I=\r\n get started and can&#39;t seem \n  to stop. \n  &lt;P&gt;All the best to everyone, \n  =\r\n&lt;P&gt;Paige Gabhart &lt;BR&gt;&nbsp; &lt;BR&gt;&nbsp; \n  &lt;P&gt;Jon Zuck wrote: \n  &lt;BLOCKQUOTE=\r\n TYPE=3D&quot;CITE&quot;&gt;&nbsp;&lt;TT&gt;Wow, Ewout!&nbsp; This sounds \n    excellent.&nbsp=\r\n; Is there anyone who can create such a&lt;/TT&gt; &lt;BR&gt;&lt;TT&gt;driver \n    for us?&lt;/T=\r\nT&gt; \n    &lt;P&gt;&lt;TT&gt;It sure would make using QS a lot easier.&lt;/TT&gt; &lt;BR&gt;&nbsp; \n =\r\n   &lt;P&gt;&lt;TT&gt;Shalom v&#39;Tovah,&lt;/TT&gt; \n    &lt;P&gt;&lt;TT&gt;Jon&lt;/TT&gt; &lt;BR&gt;&lt;TT&gt;&lt;A \n    href=3D=\r\n&quot;http://surf.to/frimmin&quot;&gt;http://surf.to/frimmin&lt;/A&gt;&lt;/TT&gt; \n    &lt;BR&gt;&nbsp;&lt;TT=\r\n&gt;&lt;/TT&gt; \n    &lt;P&gt;&lt;TT&gt;&gt; If somebody would create a driver, it can be progra=\r\nmmed to \n    return the&lt;/TT&gt; &lt;BR&gt;&lt;TT&gt;&gt; &#39;they&#39;-symbol when somebody types=\r\n &#39;dh&#39;. Two \n    letters become one, but it&lt;/TT&gt; &lt;BR&gt;&lt;TT&gt;would&lt;/TT&gt; &lt;BR&gt;&lt;TT&gt;=\r\n&gt; indeed NOT \n    require you to learn any keyboard map. You can just ty=\r\npe a&lt;/TT&gt; \n    &lt;BR&gt;&lt;TT&gt;roman&lt;/TT&gt; &lt;BR&gt;&lt;TT&gt;&gt; reform and get proper quiksc=\r\nript \n    returned.&lt;/TT&gt; &lt;BR&gt;&lt;TT&gt;&gt;&lt;/TT&gt; &lt;BR&gt;&lt;TT&gt;&gt; But someone will ha=\r\nve to \n    program this driver first. I certainly don&#39;t have&lt;/TT&gt; &lt;BR&gt;&lt;TT&gt;&=\r\ngt; the \n    time/knowledge (yet) to do so.&lt;/TT&gt; &lt;BR&gt;&lt;TT&gt;&gt;&lt;/TT&gt; &lt;BR&gt;&lt;TT&gt;=\r\n&gt; \n    Ewout&lt;/TT&gt; &lt;BR&gt;&lt;TT&gt;&gt;&gt;&lt;/TT&gt; \n&lt;BR&gt;&lt;BR&gt;&lt;TT&gt;&lt;/TT&gt;&nbsp;&lt;/P&gt;&lt;/BL=\r\nOCKQUOTE&gt;&lt;/BLOCKQUOTE&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n------=_NextPart_000_0055_01C1BD3B.CDE45D20--\r\n\n"
}