{
  "userId": 31034496,
  "authorName": "Ewout Stam",
  "from": "&quot;Ewout Stam&quot; &lt;teraiten@...&gt;",
  "profile": "teraiten",
  "replyTo": "LIST",
  "senderId": "1zjHoWAz6vqSY16_f7zg51N3gvhKBmdupvDpDK7If1B6ecolh7KgUghg0hwBhO39hhUNOHkAdc10rSlXA9sPAeUP_4Fp3aUZ",
  "spamInfo": {
    "isSpam": false,
    "reason": "0"
  },
  "subject": "Re: [Read_Alphabet] Macbeth",
  "postDate": "1015150516",
  "msgId": 90,
  "canDelete": false,
  "contentTrasformed": false,
  "systemMessage": false,
  "headers": {
    "messageIdInHeader": "PDAwMWYwMWMxYzI5YyQ3NGFmMGI0MCQwNTA5NjQzZUBiZXJ0aGE+"
  },
  "prevInTopic": 89,
  "nextInTopic": 95,
  "prevInTime": 89,
  "nextInTime": 91,
  "topicId": 60,
  "numMessagesInTopic": 30,
  "msgSnippet": "... Van: Jon Zuck  Aan: Read_Alphabet@yahoogroups.com  Datum: zondag 24 februari 2002 20:04 Onderwerp: Re:",
  "messageBody": "<div id=\"ygrps-yiv-968292990\">\n<html>\n<head>\n\n \n \n<style></style>\n\n</head>\n \n<div>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\"><b>-----Oorspronkelijk bericht-----</b><br><b>Van: \n</b>Jon Zuck &lt;<a rel=\"nofollow\"\n target=\"_blank\" href=\"mailto:frimmin@...\">frimmin@...</a>&gt;<br><b>Aan: </b><a rel=\"nofollow\"\n target=\"_blank\" href=\"mailto:Read_Alphabet@yahoogroups.com\">Read_Alphabet@yahoogroups.com</a> \n&lt;<a rel=\"nofollow\"\n target=\"_blank\" href=\"mailto:Read_Alphabet@yahoogroups.com\">Read_Alphabet@yahoogroups.com</a>&gt;<br><b>Datum: \n</b>zondag 24 februari 2002 20:04<br><b>Onderwerp: </b>Re: [Read_Alphabet] \nMacbeth<br><br></font></div>\n<blockquote><span title=\"qreply\"> <blockquote><font face=\"Arial\" size=\"2\"></font>\n    <div><font face=\"Arial\" size=\"2\">Thanks for your <font\n face=\"DotumChe\">thoughts</font>, Paige.</font></div>\n    <div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n    <div><font face=\"Arial\" size=\"2\">I&#39;m afraid that I have to disagree about the \n    virtues of a transliterating keyboard driver:&nbsp; It is not optional, \n    <strong>it is essential!</strong>&nbsp; Even if you say that you are able to \n    type &quot;fairly quickly&quot; in Jerome, I doubt you could do it well \n    enough to be hired as an administrative assistant for a Read Alphabet-based \n    office!&nbsp; I&#39;m thinking like&nbsp;a good 40-55 words per \n    minute;&nbsp;This isn&#39;t attainable, because too many keys are on \n    capitals.&nbsp;Forget the word &quot;transliterating.&quot; </font><font\n face=\"Arial\" size=\"2\">The&nbsp;keyboard driver is simply the way keyboard must \n    work in any language.&nbsp;Consider the fact that with upper case, we use 52 \n    letters in English on 26 keys- our keyboard drivers interpret SHIFT + \n    (letter) as a signal to put down a completely different symbol.&nbsp; And in \n    the many countries of the world, where there are far more characters than \n    keys, E.g., China, Japan, Thailand, India, etc.,&nbsp;several keystrokes are \n    used to create a single complete character.&nbsp;This is always the case in \n    Chinese and Japanese, where the elements of the radical characters are \n    specified by single keystrokes, and drivers recognize combinations&nbsp;to \n    create&nbsp;radical and more complex characters.&nbsp;Some of those \n    languages, like Thai and Hindi, can present a trucated form of the \n    writing&nbsp;(for example, omitting vowels, which are integrated into the \n    shape of the complete character) by using simple keystrokes, but the \n    <em>full </em>script must use multiple keys to create complete characters \n    with the loops and flourishes which indicate vowels.&nbsp; Semitic \n    languages, like Hebrew and Arabic are a bit better off, since they normally \n    <em>are</em> written without vowels, but the inclusion of the vowel of \n    course, requires another letter keystroke.&nbsp; Nearly half of the world&#39;s \n    population uses non-Roman-based writing systems.&nbsp; You can bet that if \n    they&#39;re not hitting alt, shift, control all the time, they&#39;re hitting other \n    combinations of characters a lot to flesh out the writing.&nbsp; Even many \n    European languages had to use backspace + (accent) on the typewriter to get \n    all of their letters to appear correctly, since some Slavic languages can \n    put an accent over almost every character.</font></div>\n    <div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div></blockquote>\n<div><font face=\"Arial\" size=\"2\">No, its accent and then the letter. The accent keys \nare a little different from the normal letters. They do produce a character on \nthe paper, but the paper doesn&#39;t move forward, </font></div>\n<blockquote>\n    <div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n    <div><font face=\"Arial\" size=\"2\">The computer keyboard eliminates some of that \n    awkwardness, you can keep going forward, and the keyboard can recognize a \n    letter combination a signifying an accented letter. Esperantists usually use \n    an x or an h to signify the accent, with h being the easier combination to \n    type.</font></div></blockquote>\n<div><font face=\"Arial\" size=\"2\">Being an Esperantist myself, the creator (Zamenhof) \noriginally said that the h should be used when there is no circumflex available. \nComputer users have also invented the x for this purpose. It has two advantages \nover the h. One; the alphabetical order is maintained, circumflexed letters \nalways follow the uncircumflexed one, and Two; it will not lead to confusing \nsituations where there is an uncircumflexed letter that needs to be followed by \nan h, as in the word <em>flughaveno</em> (airport). In the driver this may be a \nvery good idea. If we&#39;d use a non-normal character to change the value of the \nsound. Instead of th we&#39;d type tx or t&#39;. If you&#39;d still want the &#39; key you&#39;d \ntype it twice. The French keyboard works more or less like this.</font></div>\n<blockquote>\n    <div><font face=\"Arial\" size=\"2\">Or consider it this way: Stop thinking of the \n    capital letters as &quot;places&quot; on the keyboard, and think about the \n    actions that are required to produce a letter.&nbsp; With only 26 letter \n    keys, multiple keystrokes are going to be needed to&nbsp;produce most of the \n    characters in a 62-character alphabet.&nbsp; We&#39;re using the &quot;Shift \n    +&quot; combination to do almost everything, when a simpler solution, not \n    requiring the poor lil&#39; ol pinky to do that work would be to simply type a \n    logical character combination.&nbsp;</font></div>\n    <div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n    <div><font face=\"Arial\" size=\"2\">Re Dvorak:&nbsp; I&#39;m the only person I know who \n    actually tried it, and that was twice, as a matter of fact.&nbsp; The second \n    time was last year, and I converted my Windows systems both at home and work \n    to the Dvorak schema.&nbsp; I liked the more logical arrangement of the \n    keys, and I definitely did get up to &quot;fairly quick&quot; typing with \n    it, in the neighborhood of 30 words per minute.&nbsp; But I abandoned it \n    after about six months because I couldn&#39;t break that barrier, and on Qwerty, \n    I can do 55 wpm easily.&nbsp; I figured 6 months was adequate time for a \n    trial! Dvorak has its own illogical parts too, like R and L being under the \n    weakest fingers, and A being under a weak finger while U gets the prime real \n    estate.&nbsp; After my two shots at it, I think that in a non-Qwerty-biased \n    world, it would be a&nbsp;superior alternative for someone who is just \n    learning to type or one who has never achieved good speed with \n    Qwerty.</font></div>\n    <div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n    <div>&gt;No one thinks of a &quot;they&quot; or &quot;thaw&quot; as \n    &quot;dh&quot;, and I feel it adds a needless level of \n    complexity.&nbsp;</div>\n    <div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n    <div><font face=\"Arial\" size=\"2\">Since in Senior QS we have the blessing(?) of \n    THREE &quot;th&#39;s&quot; Thoth, Thither, and Other <font face=\"jerome\">(T, H, \n    K),&nbsp; </font><font face=\"Arial\">I think the easily remembered digraphs of \n    <strong>th</strong>, <strong>dh</strong>, and&nbsp;<strong>xdh</strong> \n    </font></font></div></blockquote>\n<div><font face=\"Arial\" size=\"2\">Perhaps we can just ignore Thither. Other will do \nthe job nicely.</font></div>\n<blockquote>\n    <div><font face=\"Arial\" size=\"2\"><font face=\"Arial\">would greatly simplify \n    matters.&nbsp; It seems a lot more sensible to me than Shift+T, Shift+H, and \n    Shift +K, which we have now. It would be a slight&nbsp;exaggeration to say \n    that I think in terms of&nbsp; &quot;dh&quot; sounds, but as soon as one \n    begins learning the sounds of the language, th and dh is a fairly common way \n    of differentiating between the Thoth and Thither sounds in Roman letters. \n    And the less unnecessary use of the Shift key, the faster and easier it goes \n    for everyone. Another possible benefit of the transliterating driver would \n    be that we could put the slash back where it belongs, and have the driver \n    intelligently print a namer dot when it encounters a initial capital \n    letter.&nbsp; Thus, we could actually write things like and/or again without \n    having to remember where the slash went, and the Shift key goes back to it&#39;s \n    reasons for living--indicating capitals and punctuation, not letters.&nbsp; \n    Let letters and letter-combinations create letters, and Shift do punctuation \n    selection, not letter selection.</font></font></div>\n    <div><font face=\"Arial\" size=\"2\"><font face=\"Arial\"></font></font>&nbsp;</div>\n    <div><font face=\"Arial\" size=\"2\"><font face=\"Arial\">That way, NO&nbsp;Read \n    characters would have to be mapped onto punctuation keys, capitalization \n    comes from natural use of the Shift key, and no punctuation marks are \n    eliminated or even moved.&nbsp; </font></font></div>\n    <div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n    <div><font face=\"Arial\" size=\"2\">Shush, Zhivago, Thoth, Thither and Church can \n    be typed very naturally as <strong>sh, zh, th, dh, ch</strong>, which should \n    be significantly easier to remember, and much easier to type than&nbsp;Cap \n    S, Cap Z, Cap T, Cap H, small c!&nbsp; They&nbsp;all occur in English except \n    for&nbsp;dh, which once learned, won&#39;t be confused for anything else, and is \n    quite intuitive.&nbsp; Th is to dh, as t is to d, as tall is to deep, \n    as&nbsp;unvoiced is to voiced.&nbsp;Inkling is usually represented in Roman \n    by <strong>ng, </strong>which will do nicely.&nbsp; The&nbsp;alternate \n    forms,&nbsp;Noon, Up, and Other, could be designated by an x, which would be \n    impossible to confuse in Shavian letters with any other meaning. Thus, \n    <strong>xn,</strong> <strong>xa, xdh, </strong>or something \n    similar.&nbsp;Again, easily remembered, x signifying&nbsp;&quot;alternative \n    form.&quot;&nbsp;The half-letters could be flagged by something else: say an \n    initial h, which would give <strong>hw, hwh, hd, hz, ht, hp, hy, hh. \n    </strong>Easily remembed: The half-letters are flagged by an initial h, for \n    &quot;half&quot;.</font></div>\n    <div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div></blockquote>\n<div><font face=\"Arial\" size=\"2\">Although it is very tempting and easy to use ch, \nsh, and ng, c, x, and q will do just as nice, being unused and occuring quite \noften. But it&#39;s very easy to create multiple drivers, so you can always be \noffered a choice.</font></div>\n<div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\">For more information visit <a rel=\"nofollow\"\n target=\"_blank\" href=\"http://www.tavultesoft.com\">www.tavultesoft.com</a> about the programs. \nThe newest version is a commercial one, with no built-in option to create your \nown drivers. Personally I&#39;d go for the Win 3.11 alternative, which is free and \ndoes include a driver-creation option and manual. I do not know if the Win 3.11 \nversion runs properly on Win &#39;95+, but the driver files may still be \ncompatible.</font></div>\n<blockquote>\n    <div><font face=\"Arial\" size=\"2\">Finally, I heartily agree that the keyboard \n    mapping can be improved.&nbsp; It shouldn&#39;t be too difficult for me to \n    create something a little more logical.&nbsp; And I COMPLETELY agree that \n    Read characters shouldn&#39;t be displacing punctuation symbols, no matter how \n    infrequently used.&nbsp; The problem is simple: 62 characters vs. an \n    overwhelmed 26 letter keys.&nbsp; As long as one is stuck with a mapping \n    paradigm, the more letters, the more illogical placements (I really didn&#39;t \n    WANT to put Other on Cap K!)</font></div></blockquote>\n<div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\">First, one of us should create a driver for Junior \nQuickscript. From this we can learn and experiment. Then automatic conversion to \nshort forms can be added. And we can create a Shavian driver too.</font></div>\n<div><font face=\"Arial\" size=\"2\"></font>&nbsp;</div>\n<div><font face=\"Arial\" size=\"2\">Ewout</font></div></span></blockquote></html> \n</div>",
  "specialLinks": [],
  "rawEmail": "Return-Path: &lt;teraiten@...&gt;\r\nX-Sender: teraiten@...\r\nX-Apparently-To: Read_Alphabet@yahoogroups.com\r\nReceived: (EGP: unknown); 3 Mar 2002 10:17:03 -0000\r\nReceived: (qmail 41625 invoked from network); 3 Mar 2002 10:17:03 -0000\r\nReceived: from unknown (216.115.97.167)\n  by m4.grp.snv.yahoo.com with QMQP; 3 Mar 2002 10:17:03 -0000\r\nReceived: from unknown (HELO mint.nl.gxn.net) (62.100.30.37)\n  by mta1.grp.snv.yahoo.com with SMTP; 3 Mar 2002 10:17:03 -0000\r\nReceived: from bertha (asd-tel-ap01-d10-005.dial.freesurf.nl [62.100.9.5])\n\tby mint.nl.gxn.net (Postfix) with SMTP id 692D03C82A\n\tfor &lt;Read_Alphabet@yahoogroups.com&gt;; Sun,  3 Mar 2002 11:16:44 +0100 (MET)\r\nMessage-ID: &lt;001f01c1c29c$74af0b40$0509643e@bertha&gt;\r\nTo: &lt;Read_Alphabet@yahoogroups.com&gt;\r\nSubject: Re: [Read_Alphabet] Macbeth\r\nDate: Sun, 3 Mar 2002 11:15:16 +0100\r\nMIME-Version: 1.0\r\nContent-Type: multipart/alternative;\n\tboundary=&quot;----=_NextPart_000_0008_01C1C2A4.B2701700&quot;\r\nX-Priority: 3\r\nX-MSMail-Priority: Normal\r\nX-Mailer: Microsoft Outlook Express 4.72.3110.5\r\nX-MimeOLE: Produced By Microsoft MimeOLE V4.72.3110.3\r\nFrom: &quot;Ewout Stam&quot; &lt;teraiten@...&gt;\r\nX-Yahoo-Group-Post: member; u=31034496\r\nX-Yahoo-Profile: teraiten\r\n\r\n\r\n------=_NextPart_000_0008_01C1C2A4.B2701700\r\nContent-Type: text/plain;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n\n-----Oorspronkelijk bericht-----\nVan: Jon Zuck &lt;frimmin@...&gt;\nAan: Rea=\r\nd_Alphabet@yahoogroups.com &lt;Read_Alphabet@yahoogroups.com&gt;\nDatum: zondag 24=\r\n februari 2002 20:04\nOnderwerp: Re: [Read_Alphabet] Macbeth\n\n\n    Thanks fo=\r\nr your thoughts, Paige.\n     \n    I&#39;m afraid that I have to disagree about =\r\nthe virtues of a transliterating keyboard driver:  It is not optional, it i=\r\ns essential!  Even if you say that you are able to type &quot;fairly quickly&quot; in=\r\n Jerome, I doubt you could do it well enough to be hired as an administrati=\r\nve assistant for a Read Alphabet-based office!  I&#39;m thinking like a good 40=\r\n-55 words per minute; This isn&#39;t attainable, because too many keys are on c=\r\napitals. Forget the word &quot;transliterating.&quot; The keyboard driver is simply t=\r\nhe way keyboard must work in any language. Consider the fact that with uppe=\r\nr case, we use 52 letters in English on 26 keys- our keyboard drivers inter=\r\npret SHIFT + (letter) as a signal to put down a completely different symbol=\r\n.  And in the many countries of the world, where there are far more charact=\r\ners than keys, E.g., China, Japan, Thailand, India, etc., several keystroke=\r\ns are used to create a single complete character. This is always the case i=\r\nn Chinese and Japanese, where the elements of the radical characters are sp=\r\necified by single keystrokes, and drivers recognize combinations to create =\r\nradical and more complex characters. Some of those languages, like Thai and=\r\n Hindi, can present a trucated form of the writing (for example, omitting v=\r\nowels, which are integrated into the shape of the complete character) by us=\r\ning simple keystrokes, but the full script must use multiple keys to create=\r\n complete characters with the loops and flourishes which indicate vowels.  =\r\nSemitic languages, like Hebrew and Arabic are a bit better off, since they =\r\nnormally are written without vowels, but the inclusion of the vowel of cour=\r\nse, requires another letter keystroke.  Nearly half of the world&#39;s populati=\r\non uses non-Roman-based writing systems.  You can bet that if they&#39;re not h=\r\nitting alt, shift, control all the time, they&#39;re hitting other combinations=\r\n of characters a lot to flesh out the writing.  Even many European language=\r\ns had to use backspace + (accent) on the typewriter to get all of their let=\r\nters to appear correctly, since some Slavic languages can put an accent ove=\r\nr almost every character.\n     \nNo, its accent and then the letter. The acc=\r\nent keys are a little different from the normal letters. They do produce a =\r\ncharacter on the paper, but the paper doesn&#39;t move forward, \n     \n    The =\r\ncomputer keyboard eliminates some of that awkwardness, you can keep going f=\r\norward, and the keyboard can recognize a letter combination a signifying an=\r\n accented letter. Esperantists usually use an x or an h to signify the acce=\r\nnt, with h being the easier combination to type.\nBeing an Esperantist mysel=\r\nf, the creator (Zamenhof) originally said that the h should be used when th=\r\nere is no circumflex available. Computer users have also invented the x for=\r\n this purpose. It has two advantages over the h. One; the alphabetical orde=\r\nr is maintained, circumflexed letters always follow the uncircumflexed one,=\r\n and Two; it will not lead to confusing situations where there is an uncirc=\r\numflexed letter that needs to be followed by an h, as in the word flughaven=\r\no (airport). In the driver this may be a very good idea. If we&#39;d use a non-=\r\nnormal character to change the value of the sound. Instead of th we&#39;d type =\r\ntx or t&#39;. If you&#39;d still want the &#39; key you&#39;d type it twice. The French key=\r\nboard works more or less like this.\n    Or consider it this way: Stop think=\r\ning of the capital letters as &quot;places&quot; on the keyboard, and think about the=\r\n actions that are required to produce a letter.  With only 26 letter keys, =\r\nmultiple keystrokes are going to be needed to produce most of the character=\r\ns in a 62-character alphabet.  We&#39;re using the &quot;Shift +&quot; combination to do =\r\nalmost everything, when a simpler solution, not requiring the poor lil&#39; ol =\r\npinky to do that work would be to simply type a logical character combinati=\r\non. \n     \n    Re Dvorak:  I&#39;m the only person I know who actually tried it=\r\n, and that was twice, as a matter of fact.  The second time was last year, =\r\nand I converted my Windows systems both at home and work to the Dvorak sche=\r\nma.  I liked the more logical arrangement of the keys, and I definitely did=\r\n get up to &quot;fairly quick&quot; typing with it, in the neighborhood of 30 words p=\r\ner minute.  But I abandoned it after about six months because I couldn&#39;t br=\r\neak that barrier, and on Qwerty, I can do 55 wpm easily.  I figured 6 month=\r\ns was adequate time for a trial! Dvorak has its own illogical parts too, li=\r\nke R and L being under the weakest fingers, and A being under a weak finger=\r\n while U gets the prime real estate.  After my two shots at it, I think tha=\r\nt in a non-Qwerty-biased world, it would be a superior alternative for some=\r\none who is just learning to type or one who has never achieved good speed w=\r\nith Qwerty.\n     \n    &gt;No one thinks of a &quot;they&quot; or &quot;thaw&quot; as &quot;dh&quot;, and I f=\r\neel it adds a needless level of complexity. \n     \n    Since in Senior QS w=\r\ne have the blessing(?) of THREE &quot;th&#39;s&quot; Thoth, Thither, and Other (T, H, K),=\r\n  I think the easily remembered digraphs of th, dh, and xdh \nPerhaps we can=\r\n just ignore Thither. Other will do the job nicely.\n    would greatly simpl=\r\nify matters.  It seems a lot more sensible to me than Shift+T, Shift+H, and=\r\n Shift +K, which we have now. It would be a slight exaggeration to say that=\r\n I think in terms of  &quot;dh&quot; sounds, but as soon as one begins learning the s=\r\nounds of the language, th and dh is a fairly common way of differentiating =\r\nbetween the Thoth and Thither sounds in Roman letters. And the less unneces=\r\nsary use of the Shift key, the faster and easier it goes for everyone. Anot=\r\nher possible benefit of the transliterating driver would be that we could p=\r\nut the slash back where it belongs, and have the driver intelligently print=\r\n a namer dot when it encounters a initial capital letter.  Thus, we could a=\r\nctually write things like and/or again without having to remember where the=\r\n slash went, and the Shift key goes back to it&#39;s reasons for living--indica=\r\nting capitals and punctuation, not letters.  Let letters and letter-combina=\r\ntions create letters, and Shift do punctuation selection, not letter select=\r\nion.\n     \n    That way, NO Read characters would have to be mapped onto pu=\r\nnctuation keys, capitalization comes from natural use of the Shift key, and=\r\n no punctuation marks are eliminated or even moved.  \n     \n    Shush, Zhiv=\r\nago, Thoth, Thither and Church can be typed very naturally as sh, zh, th, d=\r\nh, ch, which should be significantly easier to remember, and much easier to=\r\n type than Cap S, Cap Z, Cap T, Cap H, small c!  They all occur in English =\r\nexcept for dh, which once learned, won&#39;t be confused for anything else, and=\r\n is quite intuitive.  Th is to dh, as t is to d, as tall is to deep, as unv=\r\noiced is to voiced. Inkling is usually represented in Roman by ng, which wi=\r\nll do nicely.  The alternate forms, Noon, Up, and Other, could be designate=\r\nd by an x, which would be impossible to confuse in Shavian letters with any=\r\n other meaning. Thus, xn, xa, xdh, or something similar. Again, easily reme=\r\nmbered, x signifying &quot;alternative form.&quot; The half-letters could be flagged =\r\nby something else: say an initial h, which would give hw, hwh, hd, hz, ht, =\r\nhp, hy, hh. Easily remembed: The half-letters are flagged by an initial h, =\r\nfor &quot;half&quot;.\n    \nAlthough it is very tempting and easy to use ch, sh, and n=\r\ng, c, x, and q will do just as nice, being unused and occuring quite often.=\r\n But it&#39;s very easy to create multiple drivers, so you can always be offere=\r\nd a choice.\n\nFor more information visit www.tavultesoft.com about the progr=\r\nams. The newest version is a commercial one, with no built-in option to cre=\r\nate your own drivers. Personally I&#39;d go for the Win 3.11 alternative, which=\r\n is free and does include a driver-creation option and manual. I do not kno=\r\nw if the Win 3.11 version runs properly on Win &#39;95+, but the driver files m=\r\nay still be compatible.\n    Finally, I heartily agree that the keyboard map=\r\nping can be improved.  It shouldn&#39;t be too difficult for me to create somet=\r\nhing a little more logical.  And I COMPLETELY agree that Read characters sh=\r\nouldn&#39;t be displacing punctuation symbols, no matter how infrequently used.=\r\n  The problem is simple: 62 characters vs. an overwhelmed 26 letter keys.  =\r\nAs long as one is stuck with a mapping paradigm, the more letters, the more=\r\n illogical placements (I really didn&#39;t WANT to put Other on Cap K!)\n\nFirst,=\r\n one of us should create a driver for Junior Quickscript. From this we can =\r\nlearn and experiment. Then automatic conversion to short forms can be added=\r\n. And we can create a Shavian driver too.\n\nEwout\n\r\n------=_NextPart_000_0008_01C1C2A4.B2701700\r\nContent-Type: text/html;\n\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD W3 HTML//EN&quot;&gt;\n&lt;HTML&gt;\n&lt;HEAD&gt;\n\n&lt;META conte=\r\nnt=3Dtext/html;charset=3Diso-8859-1 http-equiv=3DContent-Type&gt;&lt;!DOCTYPE HTM=\r\nL PUBLIC &quot;-//W3C//DTD W3 HTML//EN&quot;&gt;&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML =\r\n4.0 Transitional//EN&quot;&gt;\n&lt;META content=3D&#39;&quot;MSHTML 4.72.3110.7&quot;&#39; name=3DGENERA=\r\nTOR&gt;\n&lt;STYLE&gt;&lt;/STYLE&gt;\n\n&lt;/HEAD&gt;\n&lt;BODY bgColor=3D#ffffff&gt;\n&lt;DIV&gt;&nbsp;&lt;/DIV&gt;\n&lt;D=\r\nIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;B&gt;-----Oorspronkelijk bericht-----&lt;/B&gt;&lt;BR&gt;&lt;=\r\nB&gt;Van: \n&lt;/B&gt;Jon Zuck &lt;&lt;A \nhref=3D&quot;mailto:frimmin@...&quot;&gt;frimmin@exis.=\r\nnet&lt;/A&gt;&gt;&lt;BR&gt;&lt;B&gt;Aan: &lt;/B&gt;&lt;A \nhref=3D&quot;mailto:Read_Alphabet@yahoogroups.com=\r\n&quot;&gt;Read_Alphabet@yahoogroups.com&lt;/A&gt; \n&lt;&lt;A \nhref=3D&quot;mailto:Read_Alphabet@y=\r\nahoogroups.com&quot;&gt;Read_Alphabet@yahoogroups.com&lt;/A&gt;&gt;&lt;BR&gt;&lt;B&gt;Datum: \n&lt;/B&gt;zon=\r\ndag 24 februari 2002 20:04&lt;BR&gt;&lt;B&gt;Onderwerp: &lt;/B&gt;Re: [Read_Alphabet] \nMacbet=\r\nh&lt;BR&gt;&lt;BR&gt;&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;/FONT&gt;\n    =\r\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;Thanks for your &lt;FONT \n    face=3DDotumChe=\r\n&gt;thoughts&lt;/FONT&gt;, Paige.&lt;/FONT&gt;&lt;/DIV&gt;\n    &lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;=\r\n&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n    &lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;I&#39;m afraid that I =\r\nhave to disagree about the \n    virtues of a transliterating keyboard drive=\r\nr:&nbsp; It is not optional, \n    &lt;STRONG&gt;it is essential!&lt;/STRONG&gt;&nbsp; E=\r\nven if you say that you are able to \n    type &quot;fairly quickly&quot; in=\r\n Jerome, I doubt you could do it well \n    enough to be hired as an adminis=\r\ntrative assistant for a Read Alphabet-based \n    office!&nbsp; I&#39;m thinking=\r\n like&nbsp;a good 40-55 words per \n    minute;&nbsp;This isn&#39;t attainable, =\r\nbecause too many keys are on \n    capitals.&nbsp;Forget the word &quot;tran=\r\nsliterating.&quot; &lt;/FONT&gt;&lt;FONT \n    face=3DArial size=3D2&gt;The&nbsp;keyboar=\r\nd driver is simply the way keyboard must \n    work in any language.&nbsp;Co=\r\nnsider the fact that with upper case, we use 52 \n    letters in English on =\r\n26 keys- our keyboard drivers interpret SHIFT + \n    (letter) as a signal t=\r\no put down a completely different symbol.&nbsp; And in \n    the many countr=\r\nies of the world, where there are far more characters than \n    keys, E.g.,=\r\n China, Japan, Thailand, India, etc.,&nbsp;several keystrokes are \n    used=\r\n to create a single complete character.&nbsp;This is always the case in \n  =\r\n  Chinese and Japanese, where the elements of the radical characters are \n =\r\n   specified by single keystrokes, and drivers recognize combinations&nbsp;=\r\nto \n    create&nbsp;radical and more complex characters.&nbsp;Some of those=\r\n \n    languages, like Thai and Hindi, can present a trucated form of the \n =\r\n   writing&nbsp;(for example, omitting vowels, which are integrated into th=\r\ne \n    shape of the complete character) by using simple keystrokes, but the=\r\n \n    &lt;EM&gt;full &lt;/EM&gt;script must use multiple keys to create complete charac=\r\nters \n    with the loops and flourishes which indicate vowels.&nbsp; Semiti=\r\nc \n    languages, like Hebrew and Arabic are a bit better off, since they n=\r\normally \n    &lt;EM&gt;are&lt;/EM&gt; written without vowels, but the inclusion of the =\r\nvowel of \n    course, requires another letter keystroke.&nbsp; Nearly half =\r\nof the world&#39;s \n    population uses non-Roman-based writing systems.&nbsp; =\r\nYou can bet that if \n    they&#39;re not hitting alt, shift, control all the ti=\r\nme, they&#39;re hitting other \n    combinations of characters a lot to flesh ou=\r\nt the writing.&nbsp; Even many \n    European languages had to use backspace=\r\n + (accent) on the typewriter to get \n    all of their letters to appear co=\r\nrrectly, since some Slavic languages can \n    put an accent over almost eve=\r\nry character.&lt;/FONT&gt;&lt;/DIV&gt;\n    &lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbs=\r\np;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;No, its accent and t=\r\nhen the letter. The accent keys \nare a little different from the normal let=\r\nters. They do produce a character on \nthe paper, but the paper doesn&#39;t move=\r\n forward, &lt;/FONT&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE&gt;\n    &lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;=\r\n/FONT&gt;&nbsp;&lt;/DIV&gt;\n    &lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;The computer keyboa=\r\nrd eliminates some of that \n    awkwardness, you can keep going forward, an=\r\nd the keyboard can recognize a \n    letter combination a signifying an acce=\r\nnted letter. Esperantists usually use \n    an x or an h to signify the acce=\r\nnt, with h being the easier combination to \n    type.&lt;/FONT&gt;&lt;/DIV&gt;&lt;/BLOCKQU=\r\nOTE&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;Being an Esperantist myself, the crea=\r\ntor (Zamenhof) \noriginally said that the h should be used when there is no =\r\ncircumflex available. \nComputer users have also invented the x for this pur=\r\npose. It has two advantages \nover the h. One; the alphabetical order is mai=\r\nntained, circumflexed letters \nalways follow the uncircumflexed one, and Tw=\r\no; it will not lead to confusing \nsituations where there is an uncircumflex=\r\ned letter that needs to be followed by \nan h, as in the word &lt;EM&gt;flughaveno=\r\n&lt;/EM&gt; (airport). In the driver this may be a \nvery good idea. If we&#39;d use a=\r\n non-normal character to change the value of the \nsound. Instead of th we&#39;d=\r\n type tx or t&#39;. If you&#39;d still want the &#39; key you&#39;d \ntype it twice. The Fre=\r\nnch keyboard works more or less like this.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE&gt;\n    &lt;D=\r\nIV&gt;&lt;FONT face=3DArial size=3D2&gt;Or consider it this way: Stop thinking of th=\r\ne \n    capital letters as &quot;places&quot; on the keyboard, and think abo=\r\nut the \n    actions that are required to produce a letter.&nbsp; With only =\r\n26 letter \n    keys, multiple keystrokes are going to be needed to&nbsp;pro=\r\nduce most of the \n    characters in a 62-character alphabet.&nbsp; We&#39;re us=\r\ning the &quot;Shift \n    +&quot; combination to do almost everything, when =\r\na simpler solution, not \n    requiring the poor lil&#39; ol pinky to do that wo=\r\nrk would be to simply type a \n    logical character combination.&nbsp;&lt;/FON=\r\nT&gt;&lt;/DIV&gt;\n    &lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n    &lt;DIV&gt;=\r\n&lt;FONT face=3DArial size=3D2&gt;Re Dvorak:&nbsp; I&#39;m the only person I know who=\r\n \n    actually tried it, and that was twice, as a matter of fact.&nbsp; The=\r\n second \n    time was last year, and I converted my Windows systems both at=\r\n home and work \n    to the Dvorak schema.&nbsp; I liked the more logical ar=\r\nrangement of the \n    keys, and I definitely did get up to &quot;fairly qui=\r\nck&quot; typing with \n    it, in the neighborhood of 30 words per minute.&n=\r\nbsp; But I abandoned it \n    after about six months because I couldn&#39;t brea=\r\nk that barrier, and on Qwerty, \n    I can do 55 wpm easily.&nbsp; I figured=\r\n 6 months was adequate time for a \n    trial! Dvorak has its own illogical =\r\nparts too, like R and L being under the \n    weakest fingers, and A being u=\r\nnder a weak finger while U gets the prime real \n    estate.&nbsp; After my =\r\ntwo shots at it, I think that in a non-Qwerty-biased \n    world, it would b=\r\ne a&nbsp;superior alternative for someone who is just \n    learning to type=\r\n or one who has never achieved good speed with \n    Qwerty.&lt;/FONT&gt;&lt;/DIV&gt;\n  =\r\n  &lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n    &lt;DIV&gt;&gt;No one =\r\nthinks of a &quot;they&quot; or &quot;thaw&quot; as \n    &quot;dh&quot;, an=\r\nd I feel it adds a needless level of \n    complexity.&nbsp;&lt;/DIV&gt;\n    &lt;DIV&gt;=\r\n&lt;FONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n    &lt;DIV&gt;&lt;FONT face=3DArial=\r\n size=3D2&gt;Since in Senior QS we have the blessing(?) of \n    THREE &quot;th=\r\n&#39;s&quot; Thoth, Thither, and Other &lt;FONT face=3Djerome&gt;(T, H, \n    K),&nbsp=\r\n; &lt;/FONT&gt;&lt;FONT face=3DArial&gt;I think the easily remembered digraphs of \n    =\r\n&lt;STRONG&gt;th&lt;/STRONG&gt;, &lt;STRONG&gt;dh&lt;/STRONG&gt;, and&nbsp;&lt;STRONG&gt;xdh&lt;/STRONG&gt; \n  =\r\n  &lt;/FONT&gt;&lt;/FONT&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;Perhap=\r\ns we can just ignore Thither. Other will do \nthe job nicely.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;=\r\nBLOCKQUOTE&gt;\n    &lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;FONT face=3DArial&gt;would g=\r\nreatly simplify \n    matters.&nbsp; It seems a lot more sensible to me than=\r\n Shift+T, Shift+H, and \n    Shift +K, which we have now. It would be a slig=\r\nht&nbsp;exaggeration to say \n    that I think in terms of&nbsp; &quot;dh&qu=\r\not; sounds, but as soon as one \n    begins learning the sounds of the langu=\r\nage, th and dh is a fairly common way \n    of differentiating between the T=\r\nhoth and Thither sounds in Roman letters. \n    And the less unnecessary use=\r\n of the Shift key, the faster and easier it goes \n    for everyone. Another=\r\n possible benefit of the transliterating driver would \n    be that we could=\r\n put the slash back where it belongs, and have the driver \n    intelligentl=\r\ny print a namer dot when it encounters a initial capital \n    letter.&nbsp;=\r\n Thus, we could actually write things like and/or again without \n    having=\r\n to remember where the slash went, and the Shift key goes back to it&#39;s \n   =\r\n reasons for living--indicating capitals and punctuation, not letters.&nbsp=\r\n; \n    Let letters and letter-combinations create letters, and Shift do pun=\r\nctuation \n    selection, not letter selection.&lt;/FONT&gt;&lt;/FONT&gt;&lt;/DIV&gt;\n    &lt;DIV=\r\n&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;FONT face=3DArial&gt;&lt;/FONT&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n=\r\n    &lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;FONT face=3DArial&gt;That way, NO&nbsp;R=\r\nead \n    characters would have to be mapped onto punctuation keys, capitali=\r\nzation \n    comes from natural use of the Shift key, and no punctuation mar=\r\nks are \n    eliminated or even moved.&nbsp; &lt;/FONT&gt;&lt;/FONT&gt;&lt;/DIV&gt;\n    &lt;DIV&gt;&lt;=\r\nFONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n    &lt;DIV&gt;&lt;FONT face=3DArial =\r\nsize=3D2&gt;Shush, Zhivago, Thoth, Thither and Church can \n    be typed very n=\r\naturally as &lt;STRONG&gt;sh, zh, th, dh, ch&lt;/STRONG&gt;, which should \n    be signi=\r\nficantly easier to remember, and much easier to type than&nbsp;Cap \n    S, =\r\nCap Z, Cap T, Cap H, small c!&nbsp; They&nbsp;all occur in English except \n=\r\n    for&nbsp;dh, which once learned, won&#39;t be confused for anything else, a=\r\nnd is \n    quite intuitive.&nbsp; Th is to dh, as t is to d, as tall is to =\r\ndeep, \n    as&nbsp;unvoiced is to voiced.&nbsp;Inkling is usually represent=\r\ned in Roman \n    by &lt;STRONG&gt;ng, &lt;/STRONG&gt;which will do nicely.&nbsp; The&nb=\r\nsp;alternate \n    forms,&nbsp;Noon, Up, and Other, could be designated by a=\r\nn x, which would be \n    impossible to confuse in Shavian letters with any =\r\nother meaning. Thus, \n    &lt;STRONG&gt;xn,&lt;/STRONG&gt; &lt;STRONG&gt;xa, xdh, &lt;/STRONG&gt;or=\r\n something \n    similar.&nbsp;Again, easily remembered, x signifying&nbsp;&=\r\nquot;alternative \n    form.&quot;&nbsp;The half-letters could be flagged by=\r\n something else: say an \n    initial h, which would give &lt;STRONG&gt;hw, hwh, h=\r\nd, hz, ht, hp, hy, hh. \n    &lt;/STRONG&gt;Easily remembed: The half-letters are =\r\nflagged by an initial h, for \n    &quot;half&quot;.&lt;/FONT&gt;&lt;/DIV&gt;\n    &lt;DIV&gt;&lt;=\r\nFONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;\n&lt;DIV&gt;&lt;FONT face=\r\n=3DArial size=3D2&gt;Although it is very tempting and easy to use ch, \nsh, and=\r\n ng, c, x, and q will do just as nice, being unused and occuring quite \noft=\r\nen. But it&#39;s very easy to create multiple drivers, so you can always be \nof=\r\nfered a choice.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;=\r\n&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;For more information visit &lt;A \nhref=\r\n=3D&quot;http://www.tavultesoft.com&quot;&gt;www.tavultesoft.com&lt;/A&gt; about the programs.=\r\n \nThe newest version is a commercial one, with no built-in option to create=\r\n your \nown drivers. Personally I&#39;d go for the Win 3.11 alternative, which i=\r\ns free and \ndoes include a driver-creation option and manual. I do not know=\r\n if the Win 3.11 \nversion runs properly on Win &#39;95+, but the driver files m=\r\nay still be \ncompatible.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;BLOCKQUOTE&gt;\n    &lt;DIV&gt;&lt;FONT face=3DAr=\r\nial size=3D2&gt;Finally, I heartily agree that the keyboard \n    mapping can b=\r\ne improved.&nbsp; It shouldn&#39;t be too difficult for me to \n    create somet=\r\nhing a little more logical.&nbsp; And I COMPLETELY agree that \n    Read cha=\r\nracters shouldn&#39;t be displacing punctuation symbols, no matter how \n    inf=\r\nrequently used.&nbsp; The problem is simple: 62 characters vs. an \n    over=\r\nwhelmed 26 letter keys.&nbsp; As long as one is stuck with a mapping \n    p=\r\naradigm, the more letters, the more illogical placements (I really didn&#39;t \n=\r\n    WANT to put Other on Cap K!)&lt;/FONT&gt;&lt;/DIV&gt;&lt;/BLOCKQUOTE&gt;\n&lt;DIV&gt;&lt;FONT face=\r\n=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;Firs=\r\nt, one of us should create a driver for Junior \nQuickscript. From this we c=\r\nan learn and experiment. Then automatic conversion to \nshort forms can be a=\r\ndded. And we can create a Shavian driver too.&lt;/FONT&gt;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=\r\n=3DArial size=3D2&gt;&lt;/FONT&gt;&nbsp;&lt;/DIV&gt;\n&lt;DIV&gt;&lt;FONT face=3DArial size=3D2&gt;Ewou=\r\nt&lt;/FONT&gt;&lt;/DIV&gt;&lt;/BODY&gt;&lt;/HTML&gt;\n\r\n------=_NextPart_000_0008_01C1C2A4.B2701700--\r\n\n"
}