{
  "title": "Promoting the Read Alphabet (Quikscript)",
  "webDomain": "https://groups.yahoo.com/",
  "emailDomain": "yahoogroups.com",
  "domainUrlPrefix": "https://groups.yahoo.com/",
  "description": "<div id=\"ygrps-yiv-1950212856\">This group is devoted to spreading knowledge and appreciation of the Read Alphabet (Quikscript) and promoting its use in all forms of communication in English.   The Read Alphabet is an elegant and efficient way to write and communicate in English.   Because each letter represents just one English sound, texts written in the alphabet use two-thirds or less of the space required by the same texts written in the Roman alphabet.\n\nKingsley Read, whose photo appears on the right, designed the Shaw Alphabet (Shavian) and won a contest for the design of a new English alphabet.  After testing, he modified and improved the first alphabet and introduced the innovative Read Alphabet in the 1970s.   He called it Quikscript, because it is fast when written with pen or pencil.   The alphabet was extensively tested by English speakers around the world who found it worked very well.\n\nIn 2000, the Read Alphabet group began and shortly after that computer fonts were designed to enable computer users to write in the alphabet.\n\nNow you can learn the Read Alphabet and experience a better to way to write English.  If you find it useful in your daily life, please share it with your friends and help spread the word that there is a better way to write English than continuing to use the Roman alphabet, which was adapted to the sounds of Latin over 2000 years ago.  It never really fit the sounds of English well at all since there were not nearly enough symbols for English vowels.\n\nHere ia a partial list of what you will find on the site:\n\n    \t1) Email/web-based discussion in and about the Read Alphabet\n\t2) Fonts, software and other files that will help you learn to read and write the Read Alphabet\n\t3) The Quikscript manual in facsimile which was written and distributed by Kingsley Read in the early 1970s.\n   \nTo have your browser read texts written in the Read Alphabet, you will first have to go to files, then fonts and download one of the fonts and copy it into your Window fonts folder.</div>",
  "categoryId": 1600082353,
  "dateCreated": 975512409,
  "name": "Read_Alphabet",
  "membersVis": "SUBSCRIBERS",
  "groupVis": "ALL",
  "messagesVis": "SUBSCRIBERS",
  "filesVis": "SUBSCRIBERS",
  "linksVis": "SUBSCRIBERS",
  "calendarVis": "NOBODY",
  "databaseVis": "SUBSCRIBERS",
  "pollsVis": "SUBSCRIBERS",
  "postsVis": "SUBSCRIBERS",
  "photosVis": "SUBSCRIBERS",
  "messageAttachments": "STORE_ON_SITE_AND_SEND_LINK_IN_EMAIL",
  "messageModeration": "NEW_USERS_MODERATED",
  "messagePost": "SUBSCRIBERS",
  "memberShipType": "OPEN",
  "replyTo": "LIST",
  "unListed": false,
  "emailHidden": false,
  "photoModeration": false,
  "emailSubject": "[Read_Alphabet]",
  "spamFiltering": true,
  "intlCode": "us",
  "langCode": "en-US",
  "adult": false,
  "pictureUrl": "http://xa.yimg.com/kq/groups/EuJk_p3uf9BcykpU/homepage/name/81518.jpg",
  "calView": 3,
  "categoryName": "Other",
  "categoryPath": "/Schools & Education/Other/",
  "isPhotomaticEnabled": true,
  "isPhotomaticEligible": true,
  "isPostAllowForNonMembers": false,
  "subScriptionCreateDate": 1571711216,
  "bucketId": "GB0"
}